#ifndef _GAME_H
#define _GAME_H

#include "gpu.h"
#include "types.h"

struct _AnmHeader;
struct _Model;

#define TICKS_PER_SECOND 60                                            /** Game has a variable time step with 60 ticks max. */
#define TIME_STEP_30_FPS FP_TIME(1.0f / (float)(TICKS_PER_SECOND / 2)) /** Time step at 30 FPS. */

#define SCREEN_WIDTH                   320
#define SCREEN_HEIGHT                  240
#define FRAMEBUFFER_HEIGHT_PROGRESSIVE 224
#define FRAMEBUFFER_HEIGHT_INTERLACED  (FRAMEBUFFER_HEIGHT_PROGRESSIVE * 2)

#define NPC_COUNT_MAX            6
#define NPC_BONE_COUNT_MAX       10 * NPC_COUNT_MAX
#define INVENTORY_ITEM_COUNT_MAX 40
#define INPUT_ACTION_COUNT       14
#define SAVEGAME_FOOTER_MAGIC    0xDCDC
#define MEMORY_CARD_SLOT_COUNT   2
#define CONTROLLER_COUNT_MAX     2

#define DEFAULT_PICKUP_ITEM_COUNT      1
#define HANDGUN_AMMO_PICKUP_ITEM_COUNT 15
#define SHOTGUN_AMMO_PICKUP_ITEM_COUNT 6
#define RIFLE_AMMO_PICKUP_ITEM_COUNT   6

#define EVENT_FLAG5_FIRST_TIME_SAVE_GAME (1 << 26)

#define MAP_MSG_CODE_MARKER         '~' /** Message code start. */
#define MAP_MSG_CODE_COLOR          'C' /** Set color. */
#define MAP_MSG_CODE_DISPLAY_ALL    'D' /** Display message instantly without roll. */
#define MAP_MSG_CODE_END            'E' /** End message. */
#define MAP_MSG_CODE_HIGH_RES       'H' /** High-resolution glyph drawing. */
#define MAP_MSG_CODE_JUMP           'J' /** Jump timer. */

    PlayerFlag_Unk5           = 1 << 5, // `PlayerFlag_MoveBackward`?
    PlayerFlag_Unk6           = 1 << 6,
    PlayerFlag_Unk7           = 1 << 7,
    PlayerFlag_Unk8           = 1 << 8,
    PlayerFlag_Unk9           = 1 << 9,
    PlayerFlag_Unk10          = 1 << 10, // `PlayerFlag_MeleeAttack`?
    PlayerFlag_Unk11          = 1 << 11, // `PlayerFlag_GunAttack`?
    PlayerFlag_Unk12          = 1 << 12,
    PlayerFlag_Unk13          = 1 << 13,
    PlayerFlag_DamageReceived = 1 << 14,
    PlayerFlag_Moving         = 1 << 15
} e_PlayerFlags;

/** @brief Character IDs. The `g_Chara_FileInfo` array associates each character ID with animimation, model, and texture files. */
typedef enum _CharacterId
{
    Chara_None             = 0,
    Chara_Harry            = 1,
    Chara_AirScreamer      = 2,
    Chara_NightFlutter     = 3,
    Chara_Groaner          = 4,
    Chara_Wormhead         = 5,
    Chara_LarvalStalker    = 6,
    Chara_Stalker          = 7,
    Chara_GreyChild        = 8,
    Chara_Mumbler          = 9,
    Chara_HangedScratcher  = 10,
    Chara_Creaper          = 11,
    Chara_Romper           = 12,
    Chara_UnusedChicken    = 13,
    Chara_Splithead        = 14,
    Chara_Floatstinger     = 15,
    Chara_PuppetNurse      = 16,
    Chara_DummyNurse       = 17, /** Uses dummy anim file without model/texture, but uses same update funcptr as `Chara_PuppetNurse`. */
    Chara_PuppetDoctor     = 18,
    Chara_DummyDoctor      = 19, /** Uses dummy anim file without model/texture, but uses same update funcptr as `Chara_PuppetDoctor`. */
    Chara_Twinfeeler       = 20,
    Chara_Bloodsucker      = 21,
    Chara_Incubus          = 22,
    Chara_Unknown23        = 23,
    Chara_MonsterCybil     = 24,
    Chara_LockerDeadBody   = 25,
    Chara_Cybil            = 26,
    Chara_EndingCybil      = 27,
    Chara_Cheryl           = 28,
    Chara_Cat              = 29,
    Chara_Dahlia           = 30,
    Chara_EndingDahlia     = 31,
    Chara_Lisa             = 32,
    Chara_BloodyLisa       = 33,
    Chara_Alessa           = 34,
    Chara_GhostChildAlessa = 35,
    Chara_Incubator        = 36,
    Chara_BloodyIncubator  = 37,
    Chara_Kaufmann         = 38,
    Chara_EndingKaufmann   = 39,
    Chara_Flauros          = 40,
    Chara_LittleIncubus    = 41,
    Chara_GhostDoctor      = 42,
    Chara_Parasite         = 43,
    Chara_Padlock          = 44,

    Chara_Count
} e_CharacterId;

/** Based on LIBOVR.PDF `Buffer Data Format` section. */
typedef enum _PadTerminalType
{
    PadTerminalType_Mouse               = 1,
    PadTerminalType_16ButtonAnalog      = 2,
    PadTerminalType_GunControllerKonami = 3,
    PadTerminalType_16Button            = 4,
    PadTerminalType_AnalogJoystick      = 5,
    PadTerminalType_GunControllerNamco  = 6,
    PadTerminalType_AnalogController    = 7,
    PadTerminalType_MultitapAdapter     = 8
} e_PadTerminalType;

typedef enum _GameDifficulty
{
    GameDifficulty_Easy   = -1,
    GameDifficulty_Normal = 0,
    GameDifficulty_Hard   = 1
} e_GameDifficulty;

typedef union
{
    u32 rawData_0;
    struct
    {
        s8 rightX;
        s8 rightY;
        s8 leftX;
        s8 leftY;
    } sticks_0;
} s_AnalogSticks;

typedef struct _AnalogController
{
    u8  status;
    u8  received_bytes : 4; /** Number of bytes received / 2. */
    u8  terminal_type  : 4; /** `e_PadTerminalType` */
    u16 digitalButtons;
    u8  rightX;
    u8  rightY;
    u8  leftX;
    u8  leftY;
} s_AnalogController;
STATIC_ASSERT_SIZEOF(s_AnalogController, 8);

typedef struct _ControllerData
{
    s_AnalogController analogController_0;
    s32                pulseTicks_8;
    s32                btnsHeld_C;       /** `e_ControllerFlags` */
    s32                btnsClicked_10;   /** `e_ControllerFlags` */
    s32                btnsReleased_14;  /** `e_ControllerFlags` */
    s32                btnsPulsed_18;    /** `e_ControllerFlags` */
    s32                btnsPulsedGui_1C; /** `e_ControllerFlags` */
    s_AnalogSticks     sticks_20;
    s32                field_24;
    s32                field_28;
} s_ControllerData;
STATIC_ASSERT_SIZEOF(s_ControllerData, 44);

/** @brief Controller key bindings for input actions.
 *
 * TODO: Instead of `u16`s, it should use 1-bit packed 16-bit `u32`, similar to `ControllerFlags` but not an enum because it can have multiple values.
 * Only the first 16 values are counted (analog directions are not included). Also, D-Pad is not registered.
 */
typedef struct _ControllerConfig
{
    u16 enter_0;
    u16 cancel_2;
    u16 skip_4;
    u16 action_6;
    u16 aim_8;
    u16 light_A;
    u16 run_C;
    u16 view_E;
    u16 stepLeft_10;
    u16 stepRight_12;
    u16 pause_14;
    u16 item_16;
    u16 map_18;
    u16 option_1A;
} s_ControllerConfig;
STATIC_ASSERT_SIZEOF(s_ControllerConfig, 28);

typedef struct _InventoryItem
{
    u8 id_0;      /** `InventoryItemId` */
    u8 count_1;
    u8 command_2; /** `InventoryCmdId` */
    u8 field_3;   // Some sort of index?
} s_InventoryItem;
STATIC_ASSERT_SIZEOF(s_InventoryItem, 4);

typedef struct _Savegame
{
    s_InventoryItem items_0[INVENTORY_ITEM_COUNT_MAX];
    s8              field_A0;
    s8              field_A1[3];
    s8              mapOverlayId_A4;          /** `e_MapOverlayId` Index to overlay `.BIN` files. */
    s8              mapRoomIdx_A5;            /** Index to local map geometry `.IPD` files. */
    s16             savegameCount_A6;
    s8              locationId_A8;            /** `e_SaveLocationId` */
    u8              current2dMapIdx_A9;       /** `e_Current2dMapIdx` Index to the 2D map shown when opening the map screen. */
    u8              equippedWeapon_AA;        /** `e_InventoryItemId` Affects only the visible player weapon model. */
    u8              inventorySlotCount_AB;    /** Item slots. */
    u32             flags_AC;                 /** Flashlight state? On: 3, Off: 1*/
    s32             field_B0[45];
    s32             hasMapsFlags_164;         // See Sparagas' `HasMapsFlags` struct for details of every bit.
    u32             eventFlags_168[6];        //----------------------------------------
    s32             eventFlags_180[2];        //
    s32             eventFlags_188;           //
    s32             eventFlags_18C;           // Only tested a few, but it seems all are related to events and pick-up flags, grouped by location and not item types.
    s32             eventFlags_190[4];        //
    s32             eventFlags_1A0;           //
    s32             eventFlags_1A4[12];       //----------------------------------------
    s32             mapMarkingFlags_1D4[2];   //----------------------------------------
    s32             mapMarkingFlags_1DC;      // These 3 are one `u32 mapMarkingFlags[25];` (or maybe `u8 mapMarkingFlags[100];`?) See Sparagas' `MapMarkingsFlags` struct for details of every bit.
    s32             mapMarkingFlags_1E0[22];  //----------------------------------------
    q19_12          healthSaturation_238;     /** Range: [0, 300]. Ampoules give extra stored health. If the player loses health, it will be slowly restored. */
    s16             pickedUpItemCount_23C;
    s8              field_23E;
    u8              field_23F;
    q19_12          playerHealth_240;         /** Default: FP_HEALTH(100.0f) */
    q19_12          playerPositionX_244;
    q3_12           playerRotationY_248;      /** Range [0, 0.999755859375], positive Z: 0, clockwise rotation. It can be multiplied by 360 to get degrees. */
    u8              clearGameCount_24A;       /** Range [0, 99] */
    u8              clearGameEndings_24B;     /** `e_GameEndingFlags` */
    q19_12          playerPositionZ_24C;
    q20_12          gameplayTimer_250;
    q20_12          runDistance_254;
    q20_12          walkDistance_258;
    u8              isNextFearMode_25C             : 1; /** Makes savegame entry text gold. */
    u8              add290Hours_25C_1              : 2; /** Adds 290 hours per 1 bit, i.e. 290, 580, 870. */
    u8              pickedUpSpecialItemCount_25C_3 : 5; /** Red/None: 0?, Yellow: 8, Green: 16, @unused Rainbow: 24. */
                                                        /** Sparagas' investigations indicate this variable should be
                                                         * two different variables. However, splitting it causes minor
                                                         * mismatches in some functions.
                                                         *
                                                         * The first 3 bits indicate the number of special items the
                                                         * player has picked up, and the last 2 bits indicate the color of the Hyper
                                                         * Blaster beam.
                                                         *
                                                         * Belek666 suggests that some functions specifically access this field as 5 bits.
                                                         *
                                                         * The the odd access results in a bug where the results screen will count more collected
                                                         * special items than normal by additionally reading one of the two bits
                                                         * for the Hyper Blaster beam color.
                                                         */
    u8              meleeKillCount_25D;
    u8              meleeKillCountB_25E; // Can't be packed if used as `u16`.
    u8              rangedKillCount_25F;
    u32             field_260          : 28;
    s32             gameDifficulty_260 : 4;  /** `e_GameDifficulty`. */
    u16             firedShotCount_264;      /** Missed shot count = firedShotCount - (closeRangeShotCount + midRangeShotCount + longRangeShotCount). */
    u16             closeRangeShotCount_266; /** Only hits counted. */
    u16             midRangeShotCount_268;   /** Only hits counted. */
    u16             longRangeShotCount_26A;  /** Only hits counted. */
    u16             field_26C;
    u16             field_26E; // Related to enemy kills.
    u16             field_270;
    u16             field_272;
    u16             field_274;
    u16             field_276;
    u16             field_278;
    s8              field_27A; // Flags.
    u8              continueCount_27B;
} s_Savegame;
STATIC_ASSERT_SIZEOF(s_Savegame, 636);

/** TODO: Known as `Trigger` in SilentHillMapExaminer: https://github.com/ItEndsWithTens/SilentHillMapExaminer/blob/master/src/SHME.ExternalTool.Guts/Trigger.cs */
typedef struct _EventParam
{
    u8  unk_0[2];
    s16 eventFlagId_2;
    u8  unk_4[1];
    u8  field_5; // Something related to pickup items.
    u8  unk_6[2];
    u32 triggerType_8_0        : 5;
    u32 pointOfInterestIdx_8_5 : 8; /** Index into `g_MapOverlayHeader.mapAreaLoadParams_1C`. */
    u32 flags_8_13             : 6;
    u32 field_8_19             : 5;
    u32 field_8_24             : 1;
    u32 mapOverlayIdx_8_25     : 6;
    u32 field_8_31             : 1;
} s_EventParam;
STATIC_ASSERT_SIZEOF(s_EventParam, 12);

typedef struct _SaveUserConfig
{
    s_ControllerConfig controllerConfig_0;
    s8                 optScreenPosX_1C;          /** Range: [-11, 11], default: 0. */
    s8                 optScreenPosY_1D;          /** Range: [-8, 8], default: 0. */
    u8                 optSoundType_1E;           /** `bool` | Stereo: `false`, Monaural: `true`, default: Stereo. */
    u8                 optVolumeBgm_1F;           /** Range: [0, 128] with steps of 8, default: 16. */
    u8                 optVolumeSe_20;            /** Range: [0, 128] with steps of 8, default: 16. */
    u8                 optVibrationEnabled_21;    /** `bool` | Off: 0, On: 128, default: On. */
    u8                 optBrightness_22;          /** Range: [0, 7], default: 3. */
    u8                 optExtraWeaponCtrl_23;     /** `bool` | Switch: `false`, Press: `true`, default: Press. */
    u8                 optExtraBloodColor_24;     /** `e_BloodColor` | Default: Normal. */
    s8                 optAutoLoad_25;            /** `bool` | Off: `false`, On: `true`, default: Off. */
    u8                 unk_26;                    // Padding?
    u8                 optExtraOptionsEnabled_27; /** Holds unlocked option flags. */
    s8                 optExtraViewCtrl_28;       /** `bool` | Normal: `false`, Reverse: `true`, default: Normal. */
    s8                 optExtraViewMode_29;       /** `bool` | Normal: `false`, Self View: `true`, default: Normal. */
    s8                 optExtraRetreatTurn_2A;    /** `bool` | Normal: `false`, Reverse: `true`, default: Normal. */
    s8                 optExtraWalkRunCtrl_2B;    /** `bool` | Normal: `false`, Reverse: `true`, default: Normal. */
    s8                 optExtraAutoAiming_2C;     /** `bool` | On: `false`, Off: `true`, default: On. */
    s8                 optExtraBulletAdjust_2D;   /** x1-x6: Range [0, 5], default: x1. */
    u16                seenGameOverTips_2E[1];    /** Bitfield tracking seen game-over tips. Each bit corresponds to a tip index (0–14), set bits indicate seen tips. Resets after picking all 15. */
    s8                 unk_30[4];
    u32                palLanguageId_34;
} s_SaveUserConfig;
STATIC_ASSERT_SIZEOF(s_SaveUserConfig, 56);

/** @brief Appended to `ShSavegame` and `ShSaveUserConfig` during game save. Contains 8-bit XOR checksum + magic.
 * Checksum generated via `Savegame_ChecksumGenerate`.
 */
typedef struct _SavegameFooter
{
    u8  checksum_0[2];
    u16 magic_2;
} s_SavegameFooter;
STATIC_ASSERT_SIZEOF(s_SavegameFooter, 4);

/** @brief Contains `s_Savegame` data with the footer appended to the end containing the checksum + magic. */
typedef struct _SavegameContainer
{
    s_Savegame       savegame_0;
    s_SavegameFooter footer_27C;
} s_SavegameContainer;
STATIC_ASSERT_SIZEOF(s_SavegameContainer, 640);

/** @brief Contains `s_SaveUserConfig` data padded to 128 bytes, with footer at the end containing checksum + magic. */
typedef struct _SaveUserConfigContainer
{
    s_SaveUserConfig config_0;
    u8               pad_38[68];
    s_SavegameFooter footer_7C;
} s_SaveUserConfigContainer;

typedef struct _GameWork
{
    s_SaveUserConfig   config_0;
    s_ControllerData   controllers_38[CONTROLLER_COUNT_MAX];
    s_Savegame         autosave_90;
    s_Savegame         savegame_30C;
    u16                gsScreenWidth_588;
    u16                gsScreenHeight_58A;
    u8                 background2dColor_R_58C;
    u8                 background2dColor_G_58D;
    u8                 background2dColor_B_58E;
    u8                 field_58F;            // Command code? Maybe `s_PrimColor` fits here.
    s32                gameStatePrev_590;    /** `e_GameState` */
    s32                gameState_594;        /** `e_GameState` */
    s32                gameStateStep_598[3]; /** Temp data used by current `gameState`. Can be another state ID or other data. 
                                              * This states could be sub-states for specific events of individual screens
                                              * because of the way it's normally used in menus. For example: in the settings
                                              * screen, [0] is used to define what option the player has selected, and [1] is used
                                              * during specific settings screens, such as the position screen or the brightness screen.
                                              *
                                              * [2] is likely rarely used or maybe only used during maps.
                                              */
    s8                 unk_5A4[4];
    s32                field_5A8;
    s32                field_5AC;
    s8                 unk_5B0;
    s8                 mapAnimIdx_5B1;
    s8                 soundCmd_5B2;
    s8                 field_5B3;
    s_AnalogController rawController_5B4;
    s8                 unk_5BC[28];
} s_GameWork;
STATIC_ASSERT_SIZEOF(s_GameWork, 1496);

/** @brief Const data passed over to `Anim_Update` funcs. Struct itself contains which `Anim_Update` func is to be called. */
typedef struct _AnimInfo
{
    void (*updateFunc_0)(struct _Model*, struct _AnmHeader*, GsCOORDINATE2*, struct _AnimInfo*);
    u8  field_4;                /** Packed anim status. See `s_ModelAnimData::status_0`. Unknown purpose for this one. */
    s8  hasVariableTimeDelta_5; // Or `hasVariableDuration_5`?
    u8  status_6;               /** Packed anim status. See `s_ModelAnim::status_0`. */
    u8  field_7;                // Maybe `isLooped_7`? Could also be padding.
    union
    {
        q19_12 constTimeDelta;             // `constantDuration`
        q19_12 (*variableTimeDeltaFunc)(); // `variableDurationFunc`
    } timeDelta_8;                         // `duration_8` Not sure how the time scaling works. Something like `FP_TIME(sec * (TICKS_PER_SECOND / 2))`?
    s16 startKeyframeIdx_C;
    s16 endKeyframeIdx_E;
} s_AnimInfo;
STATIC_ASSERT_SIZEOF(s_AnimInfo, 16);

typedef struct _ModelAnim
{
    u8          status_0;         /** Is active: bit 0, Anim index: bits 1-7. Possible original name: `anim_status` */
    u8          maybeSomeState_1; // State says if `time_4` is anim time/anim status or a func ptr? That field could be a union.
    u16         flags_2;          /** `e_AnimFlags` */
    q19_12      time_4;           /** Time along absolute timeline. */ 
    s16         keyframeIdx_8;    /** Active keyframe along absolute timeline. */
    q3_12       alpha_A;          /** Alpha along active anim. */ 
    s_AnimInfo* animInfo_C;       // } Arrays of anim infos?
    s_AnimInfo* animInfo_10;      // }
} s_ModelAnim;
STATIC_ASSERT_SIZEOF(s_ModelAnim, 20);

typedef struct _Model
{
    s8          charaId_0;      /** `e_CharacterId` */
    u8          paletteIdx_1;   /** Changes the texture palette index for this model. */
    u8          state_2;        /** Current state for this model/character. 0 usually means it still has to be initialized. */
    u8          stateStep_3;    // Step number or temp data for the current `state_2`? In `s_MainCharacterExtra` always 1, set to 0 for 1 tick when anim state appears to change.
                                // Used differently in player's `s_SubCharacter`. 0: anim transitioning(?), bit 1: animated, bit 2: turning.
                                // Sometimes holds actual anim index?
    s_ModelAnim anim_4;
} s_Model;
STATIC_ASSERT_SIZEOF(s_Model, 24);

typedef union 
{
    s32 val32;
    s16 val16[2];
    s8  val8[4];
} u_Property;

// TODO: Unsure if this struct is puppet doctor specific or shared with all characterss. Pointer gets set at puppetDoc+0x124.
typedef struct
{
    s32         health_0;
    s8          unk_4[32];
    s_AnimInfo* animInfo_24;
    s8          unk_28[12];
} s_800D5710;
STATIC_ASSERT_SIZEOF(s_800D5710, 0x34);

// TODO: Re-offset `s_SubCharaPropertiesPlayer` / `s_SubCharaPropertiesNpc`.
// Probably easier to do that after it's merged with rest of code.
typedef struct _SubCharaPropertiesPlayer
{
    s32    field_E4;
    q19_12 afkTimer_E8; // Increments every tick for 10 seconds before AFK anim starts.
    q19_12 positionY_EC;
    s32    field_F0;
    s32    field_F4;
    s32    runTimer_F8; // Tick counter?
    q19_12 exhaustionTimer_FC;
    s32    field_100;
    s32    field_104;    // Distance?
    q19_12 runTimer_108; // `FP_TIME` format timer?.
    u8     field_10C;    // Player SFX pitch?
    u8     field_10D;
    s8     unk_10E[6];
    q19_12 gasWeaponPowerTimer_114; // Timer for the rock drill and chainsaw power.
    s16    field_118;
    s8     unk_11A[2];
    s32    flags_11C; /** `e_PlayerFlags`. */
    s16    field_120; // Angle which the player turns when doing a quick turn. In order words, some sort of holder for angle Y.
    s16    field_122; // Some sort of X angle for the player. Specially used when aiming an enemy.
    s16    headingAngle_124;
    q3_12  playerMoveDistance_126; // Used to indicate how much the player should move foward. Seems to be squared.
} s_SubCharaPropertiesPlayer;
STATIC_ASSERT_SIZEOF(s_SubCharaPropertiesPlayer, 68);

// TODO: This may be a puppet doctor/nurse specific struct, need to compare with other NPCs.
typedef struct _SubCharaPropertiesNpc
{
    s32         unk_E4;
    VECTOR3     field_E8;
    s32         field_F4;
    s32         field_F8;
    s32         field_FC;
    s32         field_100;
    s32         field_104;
    s32         field_108;
    s32         field_10C;
    s8          unk_110[4];
    s32         field_114;
    s8          field_118;
    s8          modelVariation_119;
    s16         field_11A;
    s32         field_11C;
    s16         field_120;
    s16         field_122;
    s_800D5710* field_124;
} s_SubCharaPropertiesNpc;
STATIC_ASSERT_SIZEOF(s_SubCharaPropertiesNpc, 68);

typedef struct _SubCharPropertiesLarvalStalker
{
    s32        unk_E4;            // Is this part of `a_SubCharacter`?
    u_Property properties_E8[16];
} s_SubCharaPropertiesLarvalStalker;
STATIC_ASSERT_SIZEOF(s_SubCharaPropertiesLarvalStalker, 68);

typedef struct
{
    s16 field_0;
    s16 field_2;
    s16 field_4;
    s16 field_6;
} s_SubCharacter_D8;
STATIC_ASSERT_SIZEOF(s_SubCharacter_D8, 8);

typedef struct _SubCharacter
{
    s_Model model_0;           // In player: Manage the half lower part of Harry's body animations (legs and feet).
    VECTOR3 position_18;       /** `Q19.12` */
    SVECTOR rotation_24;       // Maybe `SVECTOR3` instead of `SVECTOR` because 4th field is copy of `.xy` field.
    SVECTOR rotationSpeed_2C;  /** Range [-0x700, 0x700]. */
    q19_12  field_34;          // Character Y Position?
    s32     moveSpeed_38;
    s16     headingAngle_3C;
    s16     flags_3E;
    s8      field_40;          // In player: Index of the NPC attacking the player.
                               // In NPCs: Unknown.
    s8      attackReceived_41; // Indicates what attack has been performed to the character. For enemies is based on `e_EquippedWeaponId` enum.
    s8      unk_42[2];
    s16     field_44;
    s8      field_46; // In player: The ID (from `e_EquippedWeaponId`) of the weapon which player is using.
                      // This is not the same as `attackReceived_41`, as this value only resets when player is aiming.
                      // In NPCs: Indicates attack performed on player.
    s8      field_47;
    s8      unk_48[4];
    s32     field_4C; // } Fields used by `func_8008A3E0`. Types guessed for now.
    s16     field_50; // } Angle?
    s16     field_52; // } Angle?
    s16     field_54; // }
    s16     field_56; // }
    s32     field_58; // }
    VECTOR3 field_5C;
    VECTOR3 field_68;
    VECTOR3 field_74;
    VECTOR3 field_80;
    VECTOR3 field_8C;
    VECTOR3 field_98;
    VECTOR3 field_A4;
    q19_12  health_B0;
    s32     field_B4;          // X? } In player: Adds/subtracts if hurt by enemy. Related to heading angle?
    s32     field_B8;          // Y? }
    s32     field_BC;          // Z? }
    q19_12  damageReceived_C0;
    u16     deathTimer_C4;     // Part of `shBattleInfo` struct in SH2, may use something similar here.
    s16     timer_C6;          // Some sort of timer, value written by `Ai_LarvalStalker_Update`.

    // Fields seen used inside maps (eg. `map0_s00` `func_800D923C`)

    s16               field_C8; // } Anim root offset?
    s16               field_CA; // }
    s16               field_CC; // }
    s16               field_CE;
    s16               field_D0;
    s16               field_D2;
    s16               field_D4;
    s16               field_D6;
    s_SubCharacter_D8 field_D8;

    s32 field_E0   : 8; // Related to collision. If the player collides with the only enemy in memory and the enemy is knocked down, this is set to 1.
    s32 field_E0_8 : 4; // Flags?
    s32 unk_E0_12  : 20;

    union
    {
        s_SubCharaPropertiesPlayer        player;
        s_SubCharaPropertiesNpc           npc;
        s_SubCharaPropertiesLarvalStalker larvalStalker;
    } properties_E4;
} s_SubCharacter;
STATIC_ASSERT_SIZEOF(s_SubCharacter, 296);

typedef struct _MainCharacterExtra
{
    s_Model model_0;              /** Manages upper half body's animations (torso, arms, head). */
    s32     disabledAnimBones_18; /** Bitfield of disabled animation bones. Can be created using the `BITMASK_RANGE` macro. */
    s32     state_1C;             /** `e_PlayerState` */
    s32     upperBodyState_20;    /** `e_PlayerUpperBodyState` */
    s32     lowerBodyState_24;    /** `e_PlayerLowerBodyState` */
    s32     field_28;             // Related to item interactions. Forcing specific values opens options menu, a behaviour is caused by `func_800373CC`.
} s_MainCharacterExtra;
STATIC_ASSERT_SIZEOF(s_MainCharacterExtra, 44);

// TODO: Based on SH2 symbols this struct should be named `shPlayerWork` and `chara_0` should be `player`.
typedef struct _MainCharacter
{
    s_SubCharacter       chara_0;
    s_MainCharacterExtra extra_128;
} s_MainCharacter;
STATIC_ASSERT_SIZEOF(s_MainCharacter, 340);

typedef struct _PlayerCombat
{
    VECTOR3 field_0;
    s8      unk_C[3];
    s8      equippedWeapon_F; /** `e_EquippedWeaponId` */
    u8      currentWeaponAmmo_10;
    u8      totalWeaponAmmo_11;
    s8      field_12;
    u8      isAiming_13; /** `bool` */
} s_PlayerCombat;
STATIC_ASSERT_SIZEOF(s_PlayerCombat, 20);

typedef union
{
    s32 field_0;
    struct
    {
        u8 field_0;
        u8 field_1;
        u8 field_2;
        u8 unk_3;
    } s_field_0;
} u_Unk0;

typedef struct
{
    u_Unk0  field_0;
    s16     field_4; // FP alpha.
    s16     field_6;
    s16     field_8;
    s16     field_A;
    s16     field_C;
    u8      field_E; // Fog enabled if not set to 0, `func_8003F08C` checks for values 0/1/2/3.
    s8      unk_F;
    s32     field_10;
    CVECTOR fogColor_14;
    u8      field_18;
    CVECTOR field_19;
    CVECTOR field_1D;
    CVECTOR field_21;
    CVECTOR field_25;
    u8      unk_29;
    s16     unk_2A;
} s_sub_StructUnk3;
STATIC_ASSERT_SIZEOF(s_sub_StructUnk3, 44);

typedef struct
{
    s_sub_StructUnk3 field_0;
    s16              field_2C; // FP alpha.
    s16              field_2E; // FP alpha.
    s32              field_30;
} s_StructUnk3;
STATIC_ASSERT_SIZEOF(s_StructUnk3, 52);

typedef struct
{
    s32          field_0;
    s8*          field_4;
    s32          field_8;
    s32          field_C;
    s32          field_10;
    u8           field_14;
    u8           isFlashlightOn_15; /** `bool` | Off: `false`, On: `true`. */
    u8           field_16;          /** `bool` */
    s8           unk_17;
    s16          flashlightIntensity_18;
    u16          field_1A;
    s_StructUnk3 field_1C[2];
    s_StructUnk3 field_84[2];
    s_StructUnk3 field_EC[2];
    s_StructUnk3 field_154;
} s_SysWork_2288;
STATIC_ASSERT_SIZEOF(s_SysWork_2288, 392);

typedef struct
{
    s8  field_0[4];
    s32 field_4;
    s8  unk_8[4];
    s32 field_C;
} s_SysWork_2514_C;

typedef struct _s_SysWork_2514_18
{
    struct _s_SysWork_2514_18* next_0;

    u8  unk_4[4]; // Prev?
    u8  unk_8[4];
    s32 field_C;
    u8  unk_10[8];
    u8  unk_18[4];
    u16 field_1C;
    u16 field_1E;
} s_SysWork_2514_18;

typedef struct
{
    u32               field_0   : 8;
    u8                field_1   : 8;
    u32               field_2_0 : 1;
    u32               field_2_1 : 1;
    u32               field_2_2 : 4;
    u32               field_2_3 : 1;
    u32               field_2_4 : 1;
    u32               field_2_5 : 8;
    u8                unk_4[8];
    s_SysWork_2514_C* field_C;
    u8                unk_10[8];
    s_SysWork_2514_18 head_18;
} s_SysWork_2514;
STATIC_ASSERT_SIZEOF(s_SysWork_2514, 56);

typedef struct _SysWork
{
    s8              unk_0[8];
    s32             sysState_8;        /** `e_SysState` */
    s32             sysStateStep_C[3]; /** Temp data used by current `sysState_8`. Can be another state ID or other data. */
    s32             field_18; // Probably a `VECTOR3`.
    s32             timer_1C;
    s32             timer_20;
    s32             timer_24;
    s32             field_28;
    q19_12          timer_2C; // Cutscene message timer?
    s32             field_30;
    s8              unk_34[4];
    s_PlayerCombat  playerCombatInfo_38; // Something related to weapons and attack. This is a struct as `func_8003CD6C` requires one and `GameFs_MapLoad` input is pointing here.
    s_MainCharacter player_4C;
    s_SubCharacter  npcs_1A0[NPC_COUNT_MAX];
    GsCOORDINATE2   playerBoneCoords_890[HarryBone_Count];
    GsCOORDINATE2   unkCoords_E30[5];  // Might be part of previous array for 5 extra coords which go unused.
    GsCOORDINATE2   npcCoords_FC0[NPC_BONE_COUNT_MAX]; // Dynamic coord buffer? 10 coords per NPC (given max of 6 NPCs).
    s8              field_2280;        // Maybe NPC AI data past this point.
    s8              loadingScreenIdx_2281;
    s8              field_2282;
    s8              field_2283; // Index into `SfxPairs`.
    u16             field_2284[3];
    u16             field_228A;
    s32             field_228C;
    s32             field_2290;
    s8              unk_2294[4];
    s32             processFlags_2298; /** `e_SysWorkProcessFlags` */
    s32             field_229C;
    s32             field_22A0; // Flags.
    s32             flags_22A4;
    GsCOORDINATE2   coord_22A8; // For particles only?
    GsCOORDINATE2   coord_22F8; // Likely related to above.
    s8              field_2348   : 8;
    s8              field_2349   : 8; // Particle spawn multiplier?
    u8              field_234A   : 8;
    u8              field_234B_0 : 4;
    u8              field_234B_4 : 4;
    s32             mapMsgTimer_234C;
    u8              enableHighResGlyphs_2350_0      : 4; /** `bool` */
    u8              silentYesSelection_2350_4       : 4; /** `bool` */
    u32             inventoryItemSelectedIdx_2351   : 8;
    u32             flags_2352                      : 8;
    s8              enemyTargetIdx_2353; // Index of the enemy that is being attacked by the player.
    s8              field_2354[4];       // Size dervied from `func_80070320`.
    u8              field_2358;
    s8              unk_2359[1];
    u8              field_235A; /** If the player stop walking or running forward the value (as a bit) changes
                                 * to 00000001 and if the player stop walking backward the value changes
                                 * to 00000010.
                                 */
    s8              unk_235B[1];
    GsCOORDINATE2*  field_235C;
    VECTOR3         field_2360; // Position?
    GsCOORDINATE2*  field_236C;
    SVECTOR         field_2370; // Rotation.
    s16             field_2378;
    s16             cameraAngleY_237A;
    s16             cameraAngleZ_237C;
    s16             field_237E;
    q19_12          cameraRadiusXz_2380;
    q19_12          cameraY_2384;
    s_SysWork_2288  field_2388;
    s32             field_2510;
    s_SysWork_2514  field_2514;
    u8              unk_254C[508];
    s16             field_2748[9];  // `func_80035ED0` loops over this.
    u8              unk_275A[2];
    s32             field_275C; // Q19_12?
    s32             field_2760;
    s32             field_2764;
} s_SysWork;
STATIC_ASSERT_SIZEOF(s_SysWork, 10088);

extern void* g_OvlBodyprog; // 0x80010004
extern void* g_OvlDynamic;  // 0x80010000

extern s_SysWork               g_SysWork;       // 0x800B9FC0
extern s_GameWork              g_GameWork;      // 0x800BC728
extern s_GameWork* const       g_GameWorkConst; // 0x80024D44
extern s_GameWork* const       g_GameWorkPtr;   // 0x80024D54
extern s_Savegame* const       g_SavegamePtr;   // 0x80024D48
extern s_ControllerData* const g_Controller0;   // 0x80024D4C
extern s_ControllerData* const g_Controller1;   // 0x80024D50

extern s32  g_ObjectTableIdx; // 0x800B9FB8
extern GsOT g_ObjectTable0[]; // 0x800A8F74
extern GsOT g_ObjectTable1[]; // 0x800A8FC4

extern q19_12        g_DeltaTime0;    // 0x800B5CC0
extern q19_12        g_DeltaTime1;    // 0x800A8FEC
extern q19_12        g_DeltaTime2;    // 0x800B9CC8
extern u32           g_MapEventIdx;   // 0x800A9A14
extern s_EventParam* g_MapEventParam; // 0x800BCDD8

extern s32 g_IntervalVBlanks; // 0x800A8FF0
