#ifndef _BODYPROG_H
#define _BODYPROG_H

#include "game.h"
#include "bodyprog/vw_system.h"
#include "main/fsqueue.h"
#include "types.h"

/** @brief This header is used to declare any variable, struct, or
 * function part of `BODYPROG.BIN` that has not been identified to
 * be related a to currently recognized and separated section of
 * the engine (like player logic, save game or item screens).
 */

// ========
// DEFINES
// ========

#define OPT_SOUND_VOLUME_MIN   0
#define OPT_SOUND_VOLUME_MAX   128
#define OPT_VIBRATION_DISABLED 0
#define OPT_VIBRATION_ENABLED  128

#define IPD_HEADER_MAGIC       20  // 0x14 / 20
#define PLM_HEADER_MAGIC       '0' // 0x30 / 48 / '0'

// ======
// ENUMS
// ======

typedef enum _SpeedZoneType
{
    SpeedZoneType_Slow   = 0,
    SpeedZoneType_Normal = 1,
    SpeedZoneType_Fast   = 2,
} e_SpeedZoneType;

typedef enum _Sfx
{
    Sfx_Base        = 1280,
				    
    Sfx_StartGame   = Sfx_Base + 1,  // `SND/FIRST.VAB`
				    
    Sfx_Denied      = Sfx_Base + 24, // `1ST/BASE.VAB` onward, but loaded out of order?
    Sfx_Back        = Sfx_Base + 25,
    Sfx_Cancel      = Sfx_Base + 26,
    Sfx_Confirm     = Sfx_Base + 27, // TODO: Continue this pattern.
				    
    Sfx_Unk1309     = 1309,
    Sfx_Unk1310     = 1310,
				    
    Sfx_Stumble0    = 1314,

    Sfx_Unk1317     = 1317,
    Sfx_Unk1318     = 1318,
    Sfx_Unk1319     = 1319,
    Sfx_HeavyBreath = 1320,
    Sfx_Unk1321     = 1321,
    Sfx_Unk1322     = 1322,

    Sfx_Unk1336     = 1336,
    Sfx_Unk1337     = 1337,
    Sfx_Unk1338     = 1338,
    Sfx_Unk1339     = 1339,
    Sfx_Unk1340     = 1340,
    Sfx_Unk1341     = 1341,
				    
    Sfx_Unk1351     = 1351,
    Sfx_Unk1352     = 1352,
				    
    Sfx_Unk1354     = 1354,
				    
    Sfx_Unk1357     = 1357,
    Sfx_Unk1358     = 1358,
    Sfx_Unk1359     = 1359,
    Sfx_Unk1360     = 1360,
    Sfx_Unk1361     = 1361,
				    
    Sfx_Unk1373     = 1373,
    Sfx_Unk1374     = 1374,
    Sfx_Unk1375     = 1375,
				    
    Sfx_Unk1387     = 1387,
				    
    Sfx_Unk1391     = 1391,
				    
    Sfx_Unk1396     = 1396,
    Sfx_Unk1397     = 1397,
    Sfx_Unk1398     = 1398,
    Sfx_Unk1399     = 1399,
				    
    Sfx_Unk1418     = 1418,
				    
    Sfx_Unk1431     = 1431,
    Sfx_Unk1432     = 1432,
				    
    Sfx_Unk1458     = 1458,
    Sfx_Unk1459     = 1459,
				    
    Sfx_Unk1487     = 1487,
				    
    Sfx_Unk1490     = 1490,
    Sfx_Unk1491     = 1491,
				    
    Sfx_Unk1501     = 1501,
    Sfx_Unk1502     = 1502,
				    
    Sfx_Unk1504     = 1504,
    Sfx_Unk1505     = 1505,
				    
    Sfx_Unk1521     = 1521,
				    
    Sfx_Unk1525     = 1525,
				    
    Sfx_Unk1527     = 1527,
				    
    Sfx_Unk1567     = 1567,
				    
    Sfx_Unk1590     = 1590,
				    
    Sfx_Unk1601     = 1601,
    Sfx_Unk1602     = 1602,
				    
    Sfx_Unk1604     = 1604,
    Sfx_Unk1605     = 1605,
				    
    Sfx_Unk1609     = 1609,
    Sfx_Unk1610     = 1610,
} e_Sfx;

typedef enum _MainMenuEntry
{
    MainMenuEntry_Load     = 0,
    MainMenuEntry_Continue = 1,
    MainMenuEntry_Start    = 2,
    MainMenuEntry_Option   = 3,
    MainMenuEntry_Extra    = 4 /** @unused The extra options menu may have been accessible via the main menu. */
} e_MainMenuEntry;

typedef enum _MainMenuState
{
    MenuState_Start              = 0,
    MenuState_Main               = 1,
    MenuState_LoadGame           = 2,
    MenuState_DifficultySelector = 3,
    MenuState_NewGameStart       = 4
} e_MainMenuState;

/** Used by `func_8003F654` to cast a specific field to the desired type. */
typedef enum _PrimitiveType
{
    PrimitiveType_None = 0,
    PrimitiveType_S8   = 1,
    PrimitiveType_U8   = 2,
    PrimitiveType_S16  = 3,
    PrimitiveType_U16  = 4,
    PrimitiveType_S32  = 5
} e_PrimitiveType;

typedef enum _LoadingScreenId
{
    LoadingScreenId_None              = 0,
    LoadingScreenId_PlayerRun         = 1,
    LoadingScreenId_BackgroundTexture = 2,
    LoadingScreenId_StageString       = 3
} e_LoadingScreenId;

typedef enum _StaticModelLoadState
{
    StaticModelLoadState_Invalid   = 0,
    StaticModelLoadState_Unloaded  = 1,
    StaticModelLoadState_Corrupted = 2, // Maybe wrong name for this.
    StaticModelLoadState_Loaded    = 3
} e_StaticModelLoadState;

// ================
// UNKNOWN STRUCTS
// ================

/* Structs called by functions that haven't been identified. */

/** SFX pair used for area loading (e.g. door opening and closing). */
typedef struct
{
    u16 sfx_0;
    u16 sfx_2;
} s_AreaLoadSfx;

// Exception, as one of the unidentified structs uses this.
typedef struct _s_8002AC04
{
    struct _s_8002AC04* field_0;
    u8                  field_4;
    u8                  field_5;
    u16                 field_6;
    s32                 field_8;
    union
    {
        // `func_80089DF0` reads `field_C` as bitfield, other `D_800AFD08` funcptrs read as `u32`?
        // TODO: Some funcs also treat `field_8` differently, should probably be part of union too.
        struct
        {
            u32 field_C_0  : 16;
            u32 field_C_16 : 12;
            u32 field_C_28 : 3;
            u32 field_C_31 : 1;
        } bitField;
        u32 u32;
    } field_C;
} s_8002AC04;
STATIC_ASSERT_SIZEOF(s_8002AC04, 16);

typedef struct
{
    s32 field_0;
    s32 field_4;
} s_func_80089644_1;

typedef struct
{
    s32               id_0;
    s32               flags_4;
    s32               objectCount_8;
    struct TMD_STRUCT objects_C[1];
} s_TmdFile;

// Used in string parsing.
typedef struct
{
    s32 lineCount_0;
    s8  unk_1;
    s8  unk_38B4;
} s_800C38B4;

typedef struct
{
    u8  unk_0;
    u8  field_1;
    u8  unk_2[18];
    s32 field_14;
} s_800C45C8;

typedef struct
{
    char pad[12];
} s_func_8005B424;

typedef struct
{
    s32 vx_0;
    s32 vz_4;
    s16 vy_8;
    u8  field_A;
    s8  field_B;
    s8  field_C;
    s8  field_D;
    s16 field_E;
    s32 field_10;
} s_func_800625F4;
STATIC_ASSERT_SIZEOF(s_func_800625F4, 20);

/** Returned by `func_800699F8`. Probably contains 2D point collision. */
typedef struct _s_func_800699F8
{
    q19_12 groundHeight_0;
    s16    field_4;
    s16    field_6;
    s8     field_8;
    u8     unk_9[3];
} s_func_800699F8;
STATIC_ASSERT_SIZEOF(s_func_800699F8, 12);

typedef struct
{
    VECTOR3  position_0;
    SVECTOR3 rotation_C;
    s8       field_12;
} s_func_8006AB50;

typedef struct
{
    s32     field_0;
    s32     field_4;
    s32     field_8; // 2D distance.
    SVECTOR field_C;
    s16     directionX_14;
    s16     directionZ_16;
    q23_8   positionX_18;
    q23_8   positionZ_1C;
    s32     field_20;
    s32     field_24;
    s16     field_28; // } `SVECTOR3`, packed rotation?
    s16     field_2A; // }
    s16     field_2C; // }
} s_func_8006ABC0;

typedef struct
{
    s16 field_0;
    u8  unk_2[2];
    s16 field_4;
} s_func_8006B1C8;

typedef struct
{
    s8  field_0;
    s8  unk_1;
    s16 field_2;
    s16 field_4;
} s_func_8006BDDC;

typedef struct
{
    u8  unk_0[2];
    s16 field_2;
    u8  unk_4[2];
    s16 field_6;
} s_func_8006CA18;

typedef struct
{
    u8  field_0;
    u8  field_1;
    u16 field_2;
    s32 field_4;
} s_func_8006CC44_A8;

typedef union
{
    s16 field_0;
    struct
    {
        u8 field_0;
        u8 field_1;
    } s_field_0;
} u_func_8006CC44_D8;

typedef struct
{
    u8                 field_0_0  : 8;
    s8                 field_0_8  : 1;
    s8                 field_0_9  : 1;
    s8                 field_0_10 : 1;
    s8                 field_0_11 : 5;
    u16                field_2    : 16;
    s_func_8006ABC0    field_4;
    s32                field_34;
    s16                field_38;
    s16                field_3A;
    s16                field_3C;
    s16                field_3E;
    s8                 unk_40[4];
    s8                 field_44;
    s8                 unk_45[5];
    s16                field_4A;
    s8                 field_4C;
    s8                 unk_4D[3];
    s8                 unk_50[36];
    s8                 field_74;
    s8                 unk_75[5];
    s16                field_7A;
    s32                field_7C;
    s32                field_80; // X
    s32                field_84; // Z
    s32                field_88; // X
    s32                field_8C; // Z
    s32                field_90; // `bool`?
    s32                field_94;
    s16                field_98;
    s16                field_9A;
    s16                field_9C;
    s16                field_9E;
    u8                 field_A0;
    u8                 field_A1;
    u8                 field_A2;
    u8                 field_A3;
    s_func_8006CA18*   field_A4;
    s_func_8006CC44_A8 field_A8[4];
    u8                 field_C8;
    u8                 unk_C9[1];
    s16                field_CA;
    s32                field_CC; // TODO: This is a `s_IpdCollisionData` pointer.
    u8                 field_D0;
    s8                 field_D1;
    u16                field_D2;
    s16                field_D4;
    s16                field_D6;
    u_func_8006CC44_D8 field_D8;
    u8                 field_DA;
    u8                 field_DB;
    u8                 field_DC;
    u8                 field_DD;
    s16                field_DE;
    s16                field_E0;
    u8                 unk_E2[2];
    s16                field_E4;
    s16                field_E6;
    u8                 unk_E8[4];
    s16                field_EC;
    s16                field_EE;
    s16                field_F0;
    s16                field_F2;
    u8                 field_F4;
    u8                 unk_F5[3];
    s32                field_F8;
    u16                field_FC;
    u8                 unk_FE[2];
    s16                field_100;
    s16                field_102;
    // TODO: May be incomplete. Maybe not, added the final padding based on `func_800699F8`
} s_func_8006CC44;

typedef struct
{
    s32      field_0;
    s16      field_4;
    s16      field_6;
    s16      field_8;
    s8       unk_A[2];
    s8       unk_C[20];
    s32      field_20;
    s8       unk_24[8];
    VECTOR3  field_2C; // Q23.8
    s8       unk_38[4];
    s32      field_3C;
    s32      field_40;
    s32      field_44;
    s8       unk_48[4];
    s16      field_4C;
    s16      field_4E;
    SVECTOR3 field_50; // Q23.8
    u16      field_56;
    s16      field_58;
    s16      field_5A;
    s16      field_5C;
    s16      field_5E;
    s16      field_60;
    s8       unk_62[2];
    s32      field_64;
    s32      field_68;
    s32      field_6C;
    s32      field_70;
    s16      field_74;
    s16      field_76;
    s16      field_78;
    s16      field_7A;
    s32      field_7C;
    s32      field_80;
    u16      field_84;
} s_func_8006DCE0;

typedef struct
{
    VECTOR3 field_0;
    VECTOR3 field_C;
    s8      unk_18[6];
    u8      field_1E;
    u8      field_1F;
} s_func_800CFFF8;

// Function from lib_unk
typedef struct
{
    char unk_0[0xC];
    s32 field_C;
    s_8002AC04* field_10;
    u32 field_14_0  : 16;
    u32 field_14_16 : 8;
    u32 field_14_24 : 7;
    u32 field_14_31 : 1;
    u32 field_18;
    u16 field_1C;
    u16 field_1E;
} s_func_8009ECCC;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    s32 field_C;
    s32 field_10;
    s32 field_14;
    s32 field_18;
    s32 field_1C;
    s32 field_20;
    s32 field_24;
    s32 field_28;
    s32 field_2C;
} s_func_8006F338;

typedef struct
{
    s16 field_0;
    s16 field_2;
} s_func_8006E490_20;

typedef struct
{
    s8                 unk_0[16];
    s32                field_10;
    s32                field_14;
    s8                 unk_18[4];
    s32                field_1C;
    s_func_8006E490_20 field_20[2];
} s_func_8006E490;

typedef struct
{
    s16 field_0;
    s16 field_2;
    s16 field_4;
    s16 field_6;
    s16 field_8;
    s16 field_A;
    s16 field_C;
    s16 field_E;
    s16 field_10;
    s16 field_12;
} s_func_80070400_1;

typedef struct
{
    s32 field_0;
    s32 field_4;
} s_func_8006F250;

// ========
// STRUCTS
// ========

typedef struct _ObjNormal
{
    s8 nx;
    s8 ny;
    s8 nz;
    u8 count;
} s_ObjNormal;
STATIC_ASSERT_SIZEOF(s_ObjNormal, 4);

/** @brief 8-character string usually used for filenames. Can be compared via the `u32` field. */
typedef union _Filename
{
    char str[8];
    u32  u32[2];
} u_Filename;

/** @brief Struct used by many functions involved with GTE. Kept at `PSX_SCRATCH_ADDR` (possibly only temporarily). */
typedef struct _GteScratchData
{
    DVECTOR screenXy_0[90];
    u16     screenZ_168[18];
    s16     field_18C[150];
    u8      field_2B8[200]; // Size likely incorrect.
    MATRIX  field_380;

    s_ObjNormal field_3A0;

    DVECTOR  screenPos_3A4;
    s32      depthP_3A8;
    SVECTOR  field_3AC;
    u8       unk_3B4[36];
    CVECTOR  field_3D8; // Written by `func_8005A42C`.
    DVECTOR  screenPos_3DC;
    s32      depthP_3E0;
    MATRIX   field_3E4;
} s_GteScratchData;

typedef struct _ObjPrimitive
{
    u16 field_0;
    u16 field_2;
    u16 field_4;
    u8  field_6_0  : 8;
    s8  field_6_8  : 7;
    u8  field_6_15 : 1; // `bool`
    u16 field_8;
    u16 field_A;
    u8  unk_C[8];
} s_ObjPrimitive;
STATIC_ASSERT_SIZEOF(s_ObjPrimitive, 20);

typedef struct _ObjHeader
{
    u8 primitiveCount_0;
    u8 vertexCount_1;
    u8 normalCount_2;
    u8 unkCount_3;

    s_ObjPrimitive* primitives_4;
    DVECTOR*        vertexXy_8;
    s16*            vertexZ_C;
    s_ObjNormal*    normals_10;
    u8*             unkPtr_14;
} s_ObjHeader;
STATIC_ASSERT_SIZEOF(s_ObjHeader, 24);

typedef struct _ObjList
{
    u_Filename   objName_0;
    u8           meshCount_8;
    u8           vertexOffset_9;
    u8           normalOffset_A;
    u8           field_B_0 : 1;
    u8           field_B_1 : 3;
    u8           field_B_4 : 2;
    u8           unk_B_6   : 2;
    s_ObjHeader* meshes_C;
} s_ObjList;
STATIC_ASSERT_SIZEOF(s_ObjList, 16);

// Individual texture data.
typedef struct _PlmTexList_8
{
    s_FsImageDesc imageDesc_0;
    u_Filename    textureName_8;
    u32           queueIdx_10;
    s8            field_14;
} s_PlmTexList_8;

typedef struct _PlmTexList
{
    u_Filename      textureName_0;
    s_PlmTexList_8* field_8;
    u8              field_C;
    u8              unk_D[1];
    u8              field_E;
    u8              field_F;
    u16             field_10;
    u16             field_12;
    union
    {
        u8  u8[2];
        u16 u16;
    } field_14;
    union
    {
        u8  u8[2];
        u16 u16;
    } field_16;
} s_PlmTexList;
STATIC_ASSERT_SIZEOF(s_PlmTexList, 24);

typedef struct _PlmHeader
{
    u8            magic_0;
    u8            version_1;
    u8            isLoaded_2;
    u8            textureCount_3;
    s_PlmTexList* textureList_4;
    u8            objectCount_8;
    u8            unk_9[3];
    s_ObjList*    objectList_C;
    u8*           objectOrds_10;

    // File header ends, extra data below.
    // After this goes array of `s_PlmTexList`, `s_ObjList` `objOrder`.
    // See https://github.com/Sparagas/Silent-Hill/blob/main/010%20Editor%20-%20Binary%20Templates/sh1_model.bt
    s8            unk_11[4075];
    s32           queueIdx_1000;
} s_PlmHeader;

typedef struct _IpdCollisionData_10
{
    s16 field_0;
    s16 field_2;
    s16 field_4;
    u16 field_6_0  : 5; // TODO: Might be using `s_IpdCollisionData_18` substruct here? Won't fit though.
    u16 field_6_5  : 3;
    u16 field_6_8  : 3;
    u16 field_6_11 : 4;
    u16 field_6_15 : 1;
    s16 field_8;
    s16 field_A;
} s_IpdCollisionData_10;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_10, 12);

typedef struct _IpdCollisionData_18
{
    u16 field_0_0  : 5;
    u16 field_0_5  : 3;
    u16 field_0_8  : 4;
    u16 field_0_12 : 3;
    u16 field_0_15 : 1;
    u16 field_2;
    u16 field_4;
    u16 field_6;
    u16 field_8;
} s_IpdCollisionData_18;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_18, 10);

typedef struct _IpdCollisionData
{
    s32                    posX_0;
    s32                    posZ_4;
    u32                    field_8_0  : 8;
    u32                    field_8_8  : 8;
    u32                    field_8_16 : 8;
    u32                    field_8_24 : 8;
    void*                  ptr_C;
    s_IpdCollisionData_10* ptr_10;
    void*                  ptr_14;
    s_IpdCollisionData_18* ptr_18;
    s16                    field_1C;
    u8                     field_1E;
    u8                     field_1F;
    s32*                   ptr_20;   // Might point to `s_func_8006B1C8`?
    u16                    field_24; // `field_24/``field_26` defined in ipd2obj but haven't seen used yet, might be size of `ptr_28`/`ptr_2C`.
    u16                    field_26;
    u8*                    ptr_28;
    void*                  ptr_2C;
    u8                     field_30;
    u8                     unk_31[3];
    u8                     field_34[256];
} s_IpdCollisionData;

typedef struct _IpdModelBuffer_C
{
    s_ObjList* objList_0;
    u8         unk_4[32];
} s_IpdModelBuffer_C;
STATIC_ASSERT_SIZEOF(s_IpdModelBuffer_C, 36);

typedef struct _IpdModelBuffer
{
    u8                  field_0; // Count of `field_C` entries.
    u8                  unk_1[3];
    u8                  unk_4[8];
    s_IpdModelBuffer_C* field_C;
    void*               field_10; // Pointer to unknown collision data.
    void*               field_14; // Pointer to unknown collision data.
} s_IpdModelBuffer;
STATIC_ASSERT_SIZEOF(s_IpdModelBuffer, 24);

typedef struct _IpdModelInfo
{
    u8         isGlobalPlm_0; // `false` if loaded from inside `IPD`, `true` if loaded from `*_GLB.PLM`.
    u8         unk_1[3];
    u_Filename modelName_4;
    s_ObjList* objList_C;
} s_IpdModelInfo;
STATIC_ASSERT_SIZEOF(s_IpdModelInfo, 16);

typedef struct _IpdHeader
{
    u8                 magic_0;
    u8                 isLoaded_1; /** `bool` */
    s8                 levelGridX_2;
    s8                 levelGridY_3;
    s_PlmHeader*       plmHeader_4;
    u8                 modelCount_8;
    u8                 modelBufferCount_9;
    u8                 modelOrderCount_A;
    u8                 unk_B[1];
    u8                 unk_C[8];
    s_IpdModelInfo*    modelInfo_14;
    s_IpdModelBuffer*  modelBuffers_18;
    u8                 textureCount_1C; // Should it be `u32`?
                                        // "`u8` - Relative pointer to textures list"
                                        // "`u32` - Relative pointer to object order"
    u8                 unk_1D[3];
    u8                 unk_20[48];
    u8*                modelOrderList_50;
    s_IpdCollisionData collisionData_54;
} s_IpdHeader;

// See: https://github.com/laura-a-n-n/silent-hill-museum/blob/main/ksy/sh1anm.ksy
typedef struct _AnmBindPose
{
    s8 parentBone;
    s8 rotationDataIdx_1;
    s8 translationDataIdx_2;
    s8 translationInitial_3[3];
} s_AnmBindPose;
STATIC_ASSERT_SIZEOF(s_AnmBindPose, 6);

typedef struct _AnmHeader
{
    u16 dataOffset_0;
    u8  rotationBoneCount_2;
    u8  translationBoneCount_3;
    u16 frameDataSize_4; // Size per keyframe, `(rotationBoneCount_2 * 9) + (translationBoneCount_3 * 3)`?
    u8  boneCount_6;
    u8  unk_7;
    u32 activeBones_8; // Holds bit field of bones to update.
    u32 offset_C;      // In ANM files this points to another duplicate `s_AnmHeader` at end of the file, or might just be size of the main ANM data.
    u16 frameCount_10;
    u8  scaleLog2_12;
    u8  rootYOffset_13;

    s_AnmBindPose bindPoses_14[0]; // Array size = `boneCount_6`
} s_AnmHeader;
STATIC_ASSERT_SIZEOF(s_AnmHeader, 20);

// PLM data? Likely `D_800C1158`'s struct.
typedef struct
{
    s_PlmHeader* plmHeader_0;
    s32          fileIdx_4;
    s32          queueIdx_8; // Passed to `Fs_QueueEntryLoadStatusGet`, thus the name.
} s_func_80041CB4;

typedef struct
{
    u8 field_0;
    u8 field_1;
} s_func_800452EC_8;

// Probably Skeleton too.
typedef struct
{
    s8                      unk_0[8];
    s_func_800452EC_8*      field_8;
    s8                      unk_C[4];
    s8                      field_10;
    s8                      unk_11[3];
    struct s_func_800452EC* field_14;
} s_func_800452EC;

// Maybe a collection of matrices.
typedef struct
{
    s32        flags_0;
    s8         unk_4[4];
    s_ObjList* objList_8;
    s32        objListIdx_C;
    s8         field_10;
    s8         unk_11[3];
    s32        field_14;
} s_Bone;
STATIC_ASSERT_SIZEOF(s_Bone, 24);

// PROBABLY skeleton data.
typedef struct
{
    u8               boneCount_0;
    u8               boneIdx_1; // Current bone index? Used in traversal.
    s8               field_2;
    s8               field_3;
    s_func_800452EC* field_4;
    s_Bone* bones_8;

    // Maybe incorrect.
    s8                 field_C[4]; // Maybe struct similar to `s_Bone` but smaller.
    u8                 field_10;   // Some count related to bone hierarchy.
    s8                 field_11;
    s8                 field_12;
    s8                 field_13;
    struct s_Skeleton* skeleton_14;
    s8                 unk_18[4];
} s_Skeleton;
STATIC_ASSERT_SIZEOF(s_Skeleton, 28);

typedef struct
{
    s32        field_0;
    u8         unk_4[4];
    s_ObjList* field_8;
    // Likely incomplete.
} s_func_80057344;

typedef struct
{
    s8  field_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s32 field_4[4];
} s_800382B0;

typedef struct
{
    s16 field_0; // Flags?
} s_8008D850;

// Maybe level stream data?
typedef struct
{
    void* destBuffer_0;
    s32   queueEntryIdx_4;
    s16   fileChunkCoordX_8;
    s16   fileChunkCoordZ_A;
    s32   field_C;  // } Something to do with distance from file chunk edge.
    s32   field_10; // }
} s_80043338;

typedef struct
{
    s8             charaId0_0; /** `e_CharacterId`. */
    s8             charaId1_1; /** `e_CharacterId`. */
    s8             unk_2[2];
    s32            animFile0_4;//s_AnmHeader*    animFile0_4; // TODO: Needs to be a pointer.
    s_AnmHeader*   animFile1_8;
    s32            animFileSize1_C;
    s32            animFileSize2_10;
    GsCOORDINATE2* npcCoords_14;
} s_800A992C;
STATIC_ASSERT_SIZEOF(s_800A992C, 24);

typedef struct
{
    u8  field_0;
    u8  unk_1;
    u8  unk_2;
    u8  unk_3;
    u32 field_4    : 24;
    u8  field_4_24 : 8;
    u32 field_8    : 24;
    u8  field_8_24 : 8;
} s_800AA894;
STATIC_ASSERT_SIZEOF(s_800AA894, 12);

typedef struct
{
    u16 field_0;
    u8  unk_2[4];
    s8  field_6;
    s8  unk_7;
    u8  field_8;
    u8  field_9;
    u8  unk_A[4];
    u8  field_E;
    u8  field_F;
    u8  field_10;
    u8  field_11;
    u16 unk_12;  // Guessed.
    u32* unk_14; // Some pointer. All entries have the same value `D_800AD4C4`.
} s_800AD4C8;
STATIC_ASSERT_SIZEOF(s_800AD4C8, 24);

typedef struct
{
    VECTOR3         position_0;
    s_func_800699F8 field_C; // Collision data?
    s32             field_18;
} s_800AFC78;

typedef struct
{
    s32 field_0[16];
} s_800B5C40;

typedef struct
{
    s32 unk_0[2048];
} s_800B5D04;

typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800BCDA8;
STATIC_ASSERT_SIZEOF(s_800BCDA8, 4);

typedef struct _SpeedZone
{
    s8 speedIdx_0;
    // 1 byte of padding.
    s16 minX_2; // } Q11.4? Q7.8 fits more cleanly, but `Map_SpeedZoneGet` uses `<< 8` for comparison with Q19.12 input position.
    s16 maxX_4; // }
    s16 minZ_6; // }
    s16 maxZ_8; // }
} s_SpeedZone;

typedef struct _WaterZone
{
    u8  enabled_0;
    // 1 byte of padding.
    s16 illumination_2;
    s16 minX_4; // } Q11.4? Q7.8 fits more cleanly, but a call to `Map_WaterZoneGet` uses `>> 8` with Q19.12 arg position.
    s16 maxX_6; // }
    s16 minZ_8; // }
    s16 maxZ_A; // }
} s_WaterZone;

// Looks similar to `s_Skeleton`
typedef struct
{
    u8            field_0;
    u8            field_1;
    u8            unk_2[2];
    s32           field_4;
    s_PlmHeader*  plmHeader_8;
    s_FsImageDesc texture_C;
    s_Skeleton    field_14; // Could be different struct?
} s_800BCE18_0_CC; // Unknown size.

typedef struct _MapType
{
    s16          plmFileIdx_0;
    char         tag_2[4];
    u8           flags_6;
    // 1 byte of padding.
    s_WaterZone* waterZones_8;
    s_SpeedZone* speedZones_C;
} s_MapType;

typedef struct
{
    s_MapType*        type_0;
    s8                field_4;
    u8                unk_5[3];
    VECTOR3           field_8;               // Position.
    s32               field_14;              // Used frequently as `s_PlmHeader*`, but code adds file lengths to it. Could just be `u8*` pointing to current file data?
    s_800BCE18_0_CC*  field_18[Chara_Count]; // Per-character data? So far only seen accessed by `map4_s03::800D59EC` which calls `func_8003BE50(Chara_Twinfeeler)`.
    s_800BCE18_0_CC   field_CC;
    u8                unk_D0[368];
    s32               field_26C;
    u8                unk_270[752];
} s_800BCE18_0;
STATIC_ASSERT_SIZEOF(s_800BCE18_0, 1376);

typedef struct
{
    char string_0[8];
    s8   field_8;
    s8   field_9;
} s_800BCE18_2BEC_0_10;

typedef struct
{
    s32                   field_0;
    s8                    unk_0[4];
    s_ObjList*            field_8;
    s32                   field_C;
    s_800BCE18_2BEC_0_10  field_10;
} s_800BCE18_2BEC_0;
STATIC_ASSERT_SIZEOF(s_800BCE18_2BEC_0, 28);

typedef struct
{
    s_800BCE18_2BEC_0* field_0;
    s32                gsCoordinate0_4 : 18; // Used as `GsCOORDINATE2::coord.t[0].`
    s32                gsCoordinate1_4 : 14; // Used as `GsCOORDINATE2::coord.t[1].`
    s32                gsCoordinate2_8 : 18; // Used as `GsCOORDINATE2::coord.t[2].`
    s32                unk_8_18        : 14;
    s32                vx_C            : 10;
    s32                vy_C            : 12;
    s32                vz_C            : 10;
} s_800BCE18_2BEC;
STATIC_ASSERT_SIZEOF(s_800BCE18_2BEC, 16);

typedef struct
{
    s32           itemId_0; /** `e_InventoryItemId` or `e_CutsceneItemId` */
    s32           field_4;
    char*         field_8;
    s_FsImageDesc imageDesc_C;
    s_PlmHeader*  field_14;
    s32           field_18;
    s32           field_1C;
    s32           field_20;
} s_800BCE18_1BAC;

typedef struct
{
    s_800BCE18_0      field_0[4];
    u8                unk_1580[204];
    s_800BCE18_0_CC   field_164C;
    u8                unk_1650[1328];
    s_800BCE18_1BAC   field_1BAC;
    u8                unk_1BD0[8];
    s32               field_1BD8;
    VC_CAMERA_INTINFO vcCameraInternalInfo_1BDC; // Debug camera info.
    s_PlmHeader       field_1BE4;
    s32               field_2BE8;
    s_800BCE18_2BEC   field_2BEC[1]; // Unknown size, valid count determined by `field_2BE8`?
} s_800BCE18;
STATIC_ASSERT_SIZEOF(s_800BCE18, 11260);

// IPD data?
typedef struct
{
    s_IpdHeader* ipdHeader_0;
    s32          queueIdx_4;
    s16          field_8; // X cell coord?
    s16          field_A; // Z cell coord?
    s32          field_C;
    s32          field_10;
    u8           field_14;
    s8           unk_15[3];
    s32          field_18;
} s_800C117C;
STATIC_ASSERT_SIZEOF(s_800C117C, 28);

typedef struct _IpdRow
{
    s16 idx[16];
} s_IpdColumn;
STATIC_ASSERT_SIZEOF(s_IpdColumn, 32);

typedef struct
{
    s32             count_0;
    s_PlmTexList_8* entries_4[10];
} s_800C1450_0;

// Related to textures.
typedef struct
{
    s_800C1450_0   field_0;
    s_800C1450_0   field_2C;
    s_PlmTexList_8 field_58[8];
    s_PlmTexList_8 field_118[2];
} s_800C1450;
STATIC_ASSERT_SIZEOF(s_800C1450, 328);

typedef struct
{
    s_IpdCollisionData field_0;
    s32                field_134;
    s_func_80041CB4    field_138;
    char               mapTag_144[4];
    s32                mapTagSize_148;
    s32                field_14C;
    s_IpdHeader*       field_150;
    s32                field_154;
    s32                ipdTableSize_158;
    s_800C117C         ipdTable_15C[4]; // Temp name. Uses either 2 or 4 fields depending map type.
    s_IpdColumn        ipdGrid_1CC[18];
    s8                 unk_40C[32];     // Could be one extra row in table above.
    s_IpdColumn*       ipdGridCenter_42C;
    s_800C1450         field_430;
    s32                field_578;
    s32                field_57C;
    s32                field_580;
    s32                field_584;
    s32                field_588;
} s_800C1020;
STATIC_ASSERT_SIZEOF(s_800C1020, 1420);

typedef struct
{
    u8 field_0;
    u8 field_1;
} s_800C15F0;

typedef struct
{
    u16 field_0;
    u16 field_2;
    u16 field_4;
    u16 field_6;
    u16 field_8[1]; // Unknown size.
    s16 field_A;
    s16 field_C;
    u16 field_E;
    union
    {
        s8  field_0[3];
        u16 field_01;
    } field_F;
    u8  field_14;
    u8  field_15;
    s8  field_16;
    s8  field_17;
} s_800C1658;

typedef struct
{
    u8 field_0;
    s8 field_1;
    u8 field_2;
    s8 field_3;
} s_800C1670;

// Sound data struct?
typedef struct
{
    s16 volumeXa_0; // Might be wrong, but it's used in a `Sd_SetVolBXa` call.
    s16 field_2;
    u16 field_4;
    s16 field_6;
    s16 volumeBgm_8; // Might be wrong, but it's used in a `Sd_SetVolBgm` call.
    s16 field_A;
    s8  field_C; // (?) volume?
    s8  field_D; // BGM volume?
    s8  field_E; // SE volume?
} s_800C1678;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
} s_800C1688;

/** Sound struct for currently used SFX? */
typedef struct
{
    u8  field_0;
    u8  field_1;
    s16 field_2;
    s16 field_4;
    s16 field_6;
    s16 field_8;
    s16 field_A; // Pitch?
    s16 volumeLeft_C;
    s16 volumeRight_E;
} s_800C1698;

typedef struct
{
    s8  field_0;
    s8  unk_1;
    u16 field_2;
    u32 field_4;
    s32 field_8;
} s_800C37D4;

// Used in string parsing.
typedef struct
{
    s8 field_0;
    s8 positionIdx_1;
} s_800C38B0;

typedef struct
{
    u8            field_0;
    u8            fogEnabled_1; // `bool`
    u8            field_2;
    u8            field_3;
    s_WaterZone*  waterZones_4;
    s32           screenBrightness_8;
    s8            unk_C[4];
    q23_8         drawDistance_10; // Name from SHME, "has no effect when fog is disabled".
    s32           fogRelated_14;   // "FogThing1" from SHME, seems to affect distance where fog begins.
    s32           fogRelated_18;   // "FogThing2" from SHME.
    CVECTOR       fogColor_1C;
    s32           field_20;
    u8            field_24;
    u8            field_25;
    u8            field_26;
    s8            unk_27;
    CVECTOR       worldTintColor_28;
    MATRIX        field_2C;
    s32           field_4C;
    s16           field_50;
    s32           field_54;
    SVECTOR       field_58;
    VECTOR3       field_60; // Type assumed.
    SVECTOR       field_6C; // Player current angles?
    SVECTOR       field_74;
    SVECTOR       field_7C;
    u8            unk_84[72];
    u8            field_CC[1]; // Unknown size.
} s_800C4168;

typedef struct
{
    u16 field_0;
    u8  field_2;
    u8  unk_3;
    s32 field_4[20]; // Guessed size.
} s_800C4478;

typedef struct
{
    u8      field_0; // `bool`?
    u8      field_1; // `bool`?
    u8      field_2; // `bool`?
    u8      field_3;
    s8      unk_4[4];
    s16     field_8;
    s16     field_A;
    VECTOR3 field_C;
    s8      unk_18[4];
    s32     field_1C;
    s32     field_20;
} s_800C4818;

typedef struct
{
    u8  unk_0[4];
    s16 field_4;
    s16 field_6; // Keyframe index or time.
} s_800C44F0; // Probable size: 8 bytes.

/** Holds file IDs of anim/model/texture for each `e_CharacterId`, along with some data used in VC camera code. */
typedef struct
{
    s16            animFileIdx;
    s16            modelFileIdx;
    s16            textureFileIdx : 16;
    u16            field_6        : 10;
    u16            field_6_10     : 6;
    s_FsImageDesc* field_8; // Guessed type.
    u16            field_C_0  : 2;
    s32            field_C_2  : 14;
    u16            field_C_16 : 16;
} s_CharaFileInfo;
STATIC_ASSERT_SIZEOF(s_CharaFileInfo, 16);

typedef struct
{
    SVECTOR3 posTarget_0;    // Q7.8
    SVECTOR3 lookAtTarget_6; // Q7.8
    s16      field_C[2]; // `field_C[1]` gets passed to `vcChangeProjectionValue`.
} s_DmsKeyframeCamera;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCamera, 16);

typedef struct
{
    SVECTOR3 position_0; // Q7.8
    SVECTOR3 rotation_6; // Q7.8
} s_DmsKeyframeCharacter;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCharacter, 12);

typedef struct
{
    s16       keyframeCount_0;
    u8        svectorCount_2;
    u8        field_3;        // Usually 0, but sometimes filled in, possibly junk data left in padding byte.
    char      name_4[4];      // First 4 chars of name. E.g. Code checks for "DAHLIA", file is "DAHL".
    SVECTOR3* svectorPtr_8;   // Pointer to `SVECTOR3`s. Unknown purpose.
    union
    {
        s_DmsKeyframeCharacter* character;
        s_DmsKeyframeCamera*    camera;
    } keyframes_C;
} s_DmsEntry;
STATIC_ASSERT_SIZEOF(s_DmsEntry, 16);

typedef struct
{
    s16 start;
    s16 duration;
} s_DmsInterval;
STATIC_ASSERT_SIZEOF(s_DmsInterval, 4);

typedef struct
{
    u8             isLoaded_0;
    u8             characterCount_1;
    u8             intervalCount_2;
    u8             field_3; // Usually 0, but sometimes filled in.
    u32            field_4; // Unknown, correlates with DMS file size.
    s_DmsInterval* intervalPtr_8;
    VECTOR3        origin_C; // Q23.8 | Origin point, gets added to character positions.
    s_DmsEntry*    characters_18;
    s_DmsEntry     camera_1C;
} s_DmsHeader;
STATIC_ASSERT_SIZEOF(s_DmsHeader, 44);

/** @brief Used for normal credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E24, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E434C`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
} s_800AFE08;
STATIC_ASSERT_SIZEOF(s_800AFE08, 28);

/** @brief Used for UFO ending credits screen. */
typedef struct
{
    s_800AFE08 sub_0;
    s32  field_1C;
    s16  field_20;
    s16  field_22;
    s32  field_24;
    s32  field_28;
    s32  field_2C;
    s32  field_30;
    s32  field_34;
    s32  field_38;
    s32  field_3C;
    s32  field_40;
    s32  field_44;
    s32  field_48;
    s32  field_4C;
    s32  field_50;
    s32  field_54;
} s_800AFE24; // Size: 85

/** Part of map headers, pointer passed to `Chara_PositionUpdateFromParams`. */
/** TODO: Rename to `PointOfInterest` to match SilentHillMapExaminer name? The array inside map header seems more for holding data for points on the map rather than just chara positioning. */
/** This also makes use of union from 0x4 - 0x8 for different kinds of params, see https://github.com/Sparagas/Silent-Hill/blob/87549363834af24c65f6432908b2b036f9a300ad/010%20Editor%20-%20Binary%20Templates/sh1_overlays.bt#L126 */
typedef struct _AreaLoadParams
{
    q19_12 char_x_0; // TODO: Rename to `positionX_0`.
    u32    mapIdx_4_0          : 5; /** `e_Current2dMapIdx` */
    u32    field_4_5           : 4;
    u32    loadingScreenId_4_9 : 3; /** `e_LoadingScreenId`` */
    u32    field_4_12          : 4;
    u32    rotationY_4_16      : 8; /** Degrees in Q7.8, range [0, 256]. */
    u32    field_4_24          : 8;
    q19_12 char_z_8; // TODO: Rename to `positionZ_8`.
} s_AreaLoadParams;

typedef struct
{
    u8  field_0;
    u8  unk_1;
    u16 field_2;
    u8  field_4;
    s8  field_5;
} s_Sfx;

typedef struct _SpawnInfo
{
    q19_12 positionX_0;
    s8     charaId_4;   /** `e_CharacterId` */
    u8     rotationY_5; /** Degrees in Q7.8, range [0, 256]. */
    s8     flags_6;     /** Copied to `stateStep_3` in `s_Model`, with `state_2 = 0`. */
    s8     unk_7;
    q19_12 positionZ_8;
} s_SpawnInfo;
STATIC_ASSERT_SIZEOF(s_SpawnInfo, 12);

/** Contains loaded anim data? */
typedef struct
{
    s16 status_0; /** Packed anim status. See `s_ModelAnim::status_0`. */
    s16 status_2; /** Packed anim status. See `s_ModelAnim::status_0`. */
    s16 time_4;   /** Fixed-point anim time. */
    s16 field_6;
} s_UnkStruct3_Mo; // Probable size: 8 bytes.

/** Guessed based on in-debugger observation during gameplay.
 * Everything is inited to 0xFFFF and some data is written when I get hit by monsters.
 * Might be more generic 'particles / decals' struct
 */
typedef struct _BloodSplat
{
    s16 unk_0; // At this point, maybe its an array of u16?
} s_BloodSplat;

/** TODO: `g_MapOverlayHeader` is part of the map overlay BIN files. Maybe should be moved to `maps/shared.h`. 
 * If field has a comment that lists only certain map(s) it means all others set this field to 0.
 * func(?) means the signature is unknown and a default void() was selected for now.
 */
typedef struct _MapOverlayHeader
{
    s_MapType*        type_0;
    u8                (*getMapRoomIdxFunc_4)(s32 x, s32 y); // Called by `Savegame_MapRoomIdxSet`.
    s8                field_8;
    s8                unk_9[3];
    s32               (*func_C)();
    void              (*func_10)(s32 arg);
    s8                field_14; // Flags?
    u8                field_15;
    s8                field_16;
    s8                field_17;
    void              (**loadingScreenFuncs_18)();
    s_AreaLoadParams* mapAreaLoadParams_1C;
    void              (**mapEventFuncs_20)(); /** Points to array of event functions. */
    u8*               unk_24;
    GsCOORDINATE2*    field_28;
    u8*               loadableItems_2C;
    const char**      mapMessages_30; // Array of strings.
    s_AnimInfo*       animInfos_34;   // Map-specific anim infos for Harry (for anims 38+).
    s_UnkStruct3_Mo*  field_38;
    void              (*func_3C)(); // func(?).
    void              (*func_40)();
    void              (*func_44)();
    void              (*func_48)(); // func(?).
    s_func_800625F4*  unkTable1_4C;
    s16               unkTable1Count_50;
    s8                unk_52[2];
    s_BloodSplat*     bloodSplats_54;
    s16               bloodSplatCount_58;
    s8                unk_5A[2];
    s32               always0_5C;
    s32               always0_60;
    s32               always0_64;
    s32               always0_68;
    void              (*func_6C)(); // func(?).
    void              (*func_70)(); // func(?).
    void              (*func_74)(); // func(?).
    void              (*func_78)(); // func(?).
    u8*               unk_7C; // only map1_s01, map6_s04. 
    void              (*func_80)(); // func(?).
    void              (*func_84)(); // func(?).
    s32*              unk_88; // only map0_s01, map7_s01.
    void              (*func_8C)(); // func(?) only map0_s01, map7_s01.
    void              (*func_90)(); // func(?) only map5_s00.
    s32*              unk_94; // only map1_s02, map1_s03.
    s32*              unk_98; // only map1_s02, map1_s03.
    s32*              unk_9C; // only map1_s02, map1_s03.
    s32*              unk_A0; // only map1_s03.
    void              (*func_A4)(); // func(?) only map1_s03.
    void              (*func_A8)(); // func(?) only map6_s02.
    void              (*func_AC)(); // func(?) only map4_s03, map4_s05.
    void              (*func_B0)(); // func(?) only map4_s03, map4_s05.
    void              (*func_B4)(); // func(?) only map1_s03, map4_s05, map6_s01, map6_s02, map5_s01.
    void              (*func_B8)(s_SubCharacter*, s_MainCharacterExtra*, GsCOORDINATE2*);
    void              (*func_BC)(s_SubCharacter*, s_MainCharacterExtra*, GsCOORDINATE2*);
    void              (*func_C0)(); // func(?).
    void              (*func_C4)(); // func(?).
    void              (*freezePlayerControl_C8)();
    void              (*unfreezePlayerControl_CC)(s32);
    s32               (*func_D0)(s32, void*, s16, s32); // 0x800C964C
    s32               (*func_D4)(s32);                  // Assumed return type.
    void              (*func_D8)();                     // Assumed return type.
    void              (*func_DC)();                     // Assumed return type.
    void              (*func_E0)(); // func(?).
    s32               (*func_E4)(s_SubCharacter*, s32); // Assumed return type.
    s64               (*func_E8)(s_SubCharacter*);      // Is it really `s64`???
    s32               (*func_EC)();
    void              (*func_F0)(); // func(?).
    void              (*func_F4)(); // func(?).
    void              (*func_F8)(); // func(?).
    void              (*func_FC)(); // func(?).
    void              (*func_100)(); // func(?).
    void              (*func_104)(); // func(?).
    s32               (*func_108)();
    void              (*func_10C)(); // func(?).
    void              (*func_110)(); // func(?).
    void              (*func_114)(); // func(?).
    void              (*func_118)(); // func(?).
    void              (*func_11C)(); // func(?).
    void              (*func_120)(); // func(?).
    void              (*func_124)(s_SubCharacter*); // Assumed return type.
    s32               (*func_128)(s_SubCharacter*); // Assumed return type.
    s32               (*func_12C)(s_SubCharacter*); // Assumed return type.
    void              (*func_130)(); // func(?).
    s32               (*func_134)(s_SubCharacter*);           // Assumed return type.
    s32               (*func_138)(s_SubCharacter*);           // Assumed return type.
    s32               (*func_13C)(s32, s32, void*, s16, s32); // 0x800C96B8
    void              (*func_140)(); // func(?).
    void              (*func_144)(); // func(?).
    void              (*func_148)(); // func(?).
    void              (*func_14C)(); // func(?).
    void              (*func_150)(); // func(?).
    void              (*func_154)(); // func(?).
    void              (*func_158)(s32, s32); // only map1_s05, map1_s06.
    void              (*func_15C)(); // func(?) only map5_s01.
    void              (*func_160)(); // func(?) only map5_s01.
    void              (*func_164)(); // func(?) only map5_s01.
    void              (*func_168)(s32, s32, s32);
    void              (*func_16C)(VECTOR3*, s16);
    void              (*func_170)(); // func(?).
    void              (*func_174)(); // func(?).
    void              (*func_178)(void*, void*, void*);
    void              (*func_17C)(void*, void*);
    void              (*func_180)(); // func(?).
    s32*              windSpeedX_184;
    s32*              windSpeedZ_188;
    s32*              data_18C;
    s32*              data_190;
    void              (*charaUpdateFuncs_194[Chara_Count])(s_SubCharacter*, void*, s32); /** Guessed params. Funcptrs for each `e_CharacterId`, set to 0 for IDs not included in the map overlay. Called by `func_80038354`. */
    s8                charaGroupIds_248[4];                                              /** `e_CharacterId` values where if `s_SpawnInfo.charaId_4` == 0, `charaGroupIds_248[0]` is used for `charaSpawns_24C[0]` and `charaGroupIds_248[1]` for `charaSpawns_24C[1]`. */
    s_SpawnInfo       charaSpawns_24C[2][16];                                            /** Array of character type/position/flags. `flags_6 == 0` are unused slots? Read by `func_80037F24`. */
    VC_ROAD_DATA      roadDataList_3CC[48];
    u32               unk_84C[512];
} s_MapOverlayHeader;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader, 4172); // Size incomplete.

typedef struct
{
    s8 maxIdx_0;
    u8 selectedEntryIdx_1;
    u8 unk_2;
    u8 cancelIdx_3;
} s_MapMsgSelect;

typedef struct
{
    u8 field_0;
    u8 field_1;
} s_800A9F80;

typedef struct
{
    s8   field_0; /** `bool` */
    u8   field_1;
    s8   unk_2[2];
    s32* field_4;
    s32* field_8;
    s32  field_C;
    u32  field_10; // Maybe `bool`, not enough context.
    s32  field_14;
    s32  field_18;
    s16  field_1C;
} s_func_800700F8_2;

typedef struct
{
    VECTOR3 field_0;
    s32     field_C; // Y height?
    s16     field_10;
    s16     field_12;
    s8      field_14;
    s8      unk_15[3];
    s32     field_18;
} s_800C4590;

typedef struct
{
    DVECTOR     screenXy_0[90];
    u16         screenZ_168[18];
    s16         field_18C[72];
    s32         field_21C[39]; // Used as `VECTOR3`?
    u8          field_2B8[200];
    MATRIX      field_380;
    s_ObjNormal field_3A0;
