#ifndef _BODYPROG_H
#define _BODYPROG_H

#include "game.h"
#include "bodyprog/vw_system.h"
#include "main/fsqueue.h"

#define TEMP_MEMORY_ADDR (s8*)0x801A2600

#define IMAGE_BUFFER_0 (u_long*)0x801CFA00
#define IMAGE_BUFFER_1 (u_long*)0x801C8200
#define IMAGE_BUFFER_2 (u_long*)0x801ABE00

#define CD_ADDR_0 0x801E2600

#define OPT_SOUND_VOLUME_MAX  128
#define OPT_VIBRATION_ENABLED 128

typedef struct
{
    s8 unk_0[16];
} s_8002AC04;
STATIC_ASSERT_SIZEOF(s_8002AC04, 16);
// Maybe same.
typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    struct s_80043F2C* field_C;
} s_80043F2C;
STATIC_ASSERT_SIZEOF(s_80043F2C, 16);
// Maybe same.
typedef struct
{
    u8  field_0;
    s8  unk_1[3];
    s32 field_4;
    s8  unk_2[3];
    s32 field_C;
} s_80043E50Sub;
STATIC_ASSERT_SIZEOF(s_80043E50Sub, 16);

typedef struct
{
    s32            field_0;
    s32            field_4;
    u8             elementCount_8;
    s8             unk_C[9];
    s_80043E50Sub* elements_14;
} s_80043E50;

typedef struct
{
    s8  unk_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s8  unk_4[80];
    s32 field_54;
    s32 field_58;
} s_80044044;

typedef struct
{
    s16 field_0; // Flags?
} s_8008D850;

// Likely not skeleton since filed_8 must be `s8`.
typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
    s8 unk_4[4];
    s8 field_8;
} s_80041CEC;

// Maybe level stream data?
typedef struct
{
    s32 field_0;
    s32 queueEntryIdx_4;
    s16 fileChunkCoordX_8;
    s16 fileChunkCoordZ_A;
    s32 field_C;           // Something to do with distance from file chunk edge.
    s32 field_10;          // Something to do with distance from file chunk edge.
} s_80043338;

// Maybe s_Skeleton?
typedef struct
{
    s8  unk_0;
    u8  field_1;
    s8  unk_2[2];
    s32 field_4;
    s8  unk_8[12];
    s32 field_14;
    s32 unk_18; 
} s_80043B70;

typedef struct
{
    s8 unk_0;
    u8 field_1;
} s_80043BA4;

typedef struct
{
    s8 unk_0[14];
    u8 field_E;
    u8 field_F;
} s_8008A35C;

typedef struct
{
    u8  field_0;
    s8  unk_1;
    s16 field_2;
    s8  unk_4[4];
    s32 field_8;
} s_8008E51C;

/** Something related to ANM files. See `D_800A90FC`. */
typedef struct
{
    s16 fileIdx;
    s16 field_2;
    u32 field_4;
    u32 field_8;
    u32 field_C;
} s_800A90FC;

typedef struct
{
    s8  unk_0[4];
    u32 field_4; // Fields 4 and 8 are related.
    u32 field_8;
    s32 field_C;
    s32 field_10;
    s32 field_14;
} s_800A992C;

typedef struct
{
    s8 unk_0[15];
    s8 field_F;
    s8 unk_10[8];
} s_800AD4C8;
STATIC_ASSERT_SIZEOF(s_800AD4C8, 24);

typedef struct
{
    s8  unk_0[2];
    u8  field_2;
    s8  unk_6[4090];
    s32 queueIdx_1000;
} s_800BE9FC;

typedef struct
{
    s32                field_0;
    s8                 field_4[16]; 
    struct s_800B5508* field_14;
    s32                field_18; 
} s_800B5508;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    s32 field_C;
    s32 field_10;
    s32 field_14;
} s_800B55E8;

typedef struct
{
    s32 field_0[16];
} s_800B5C40;

typedef struct
{
    s8 unk_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800BCDA8;
STATIC_ASSERT_SIZEOF(s_800BCDA8, 4);

typedef struct _s_800BCE18
{
    s8                unk_0[4];
    s8                field_4;
    u8                unk_5[3];
    u8                unk_8[0x1644];
    s32               field_164C;
    u8                unk_1650[0x58C];
    VC_CAMERA_INTINFO vcCameraInternalInfo_1BDC; // Debug camera info.
    s_800BE9FC        field_1BE4;
    s32               field_2BE8;
} s_800BCE18;
STATIC_ASSERT_SIZEOF(s_800BCE18, 0x2BEC); // TODO: likely even larger. `func_8003CB44` accesses some 16 byte fields at 0x2BEC.

typedef struct
{
    s8  unk_0[28];
    s16 field_1C;
    s8  unk_1E[304];
    s32 field_150;
    s32 field_154;
    s32 field_158;
    s8  unk_15A[1068];
    s32 field_588;
    // More may follow.
} s_800C1020;

typedef struct
{
    s8 unk_0[28];
} s_800C117C;
STATIC_ASSERT_SIZEOF(s_800C117C, 28);

typedef struct
{
    u16 field_0;
    s8  field_2[2];
    u16 field_4;
    u16 field_6;
    s8  unk_8[13];
    u8  field_15;
} s_800C1658;

typedef struct
{
    u8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800C1670;

typedef struct
{
    s8 unk_0[12];
    s8 field_C;
    s8 field_D;
    s8 field_E;
} s_800C1678;

typedef struct
{
    s8  unk_0[4];
    s32 field_4;
    s32 field_8;
} s_800C1688;

typedef struct
{
    s8  unk_0[2];
    u16 field_2;
    s32 field_4;
    s32 field_8;
} s_800C37D4;
// Maybe the same.
typedef struct
{
    u8  field_0;
    s8  unk_1[3];
    u32 field_4;
    s32 field_8;
} s_800C37D8;

typedef struct
{
    s8 field_0;
    s8 field_1;
} s_800C38B0;

typedef struct
{
    s8  unk_0[12];
    s8  field_C;
    s8  field_D;
    s8  field_E;
    s8  unk_F;
    s32 field_10;
    s32 field_14;
    s32 field_18;
    s8  field_1C;
    s8  field_1D;
    s8  field_1E;
    s8  unk_1F;
} s_800C39A8;
STATIC_ASSERT_SIZEOF(s_800C39A8, 32);

typedef struct
{
    s32 unk_0[36];
    s32 field_24;
    s8  unk_2[212];
    s32 field_168;
    s32 field_16C;
    s32 field_170;
    s32 unk_174;
    s16 field_178;
    s16 field_17A;
    s16 field_17C;
    s32 field_180;
    s32 field_184;
    s32 field_188;
} s_800C3BE8;

typedef struct
{
    s8  unk_0[36];
    s32 field_24;
} s_800C3E18;

typedef struct
{
    s32 field_0;
    s8  unk_4[4];
    s8  field_8;
} s_800C4620;

typedef struct
{
    u8      field_0;
    u8      field_1;
    u8      field_2;
    u8      field_3;
    s8      unk_4[4];
    s16     field_8;
    s16     field_A;
    VECTOR3 field_C;
    s8      unk_18[4];
    s32     field_1C;
    s32     field_20;
} s_800C4818;

// Contains animation data? Size is rather small, so if it does, it would be indices to
// larger arrays containing actual data.
typedef struct
{
    s8  unk_0[12];
    s16 field_C;
    s8  unk_10[2];
} s_MaybeCharacterAnim;

// Maybe a collection of matrices.
typedef struct
{
    s32 flags_0;
    s8  unk_4[12];
    s8  field_10;
    s8  unk_11[7];
} s_Bone;
STATIC_ASSERT_SIZEOF(s_Bone, 24);

// PROBABLY skeleton data.
typedef struct
{
    u8      boneCount_0;
    u8      boneIdx_1; // Current bone index? Used in traversal.
    s8      field_2;
    s8      field_3;
    s32     field_4;
    s_Bone* bones_8;

    // Maybe incorrect.
    s8      unk_C[3];
    u8      field_10; // Some count related to bone hierarchy.
    s8      unk_11;
    s8      field_12;
    s8      field_13;
    s8      field_14;
    s8      unk_15[8];
} s_Skeleton;
STATIC_ASSERT_SIZEOF(s_Skeleton, 28);

typedef struct
{
    SVECTOR3 posTarget_0;
    SVECTOR3 lookAtTarget_6;
    s16      field_C[2]; // `field_C[1]` gets passed to `vcChangeProjectionValue`.
} s_DmsKeyframeCamera;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCamera, 16);

typedef struct
{
    SVECTOR3 position_0;
    SVECTOR3 rotation_6;
} s_DmsKeyframeCharacter;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCharacter, 12);

typedef struct
{
    s16       keyframeCount_0;
    u8        svectorCount_2;
    u8        field_3;        // Usually 0, but sometimes filled in, possibly junk data left in padding byte.
    char      name_4[4];      // First 4 chars of name. E.g. Code checks for "DAHLIA", file is "DAHL".
    SVECTOR3* svectorPtr_8;   // Pointer to `SVECTOR3`s. Unknown purpose.
    union
    {
        s_DmsKeyframeCharacter* character;
        s_DmsKeyframeCamera*    camera;
    } keyframes_C;
} s_DmsEntry;
STATIC_ASSERT_SIZEOF(s_DmsEntry, 16);

typedef struct
{
    s16 start;
    s16 duration;
} s_DmsInterval;
STATIC_ASSERT_SIZEOF(s_DmsInterval, 4);

typedef struct
{
    u8             isLoaded_0;
    u8             characterCount_1;
    u8             intervalCount_2;
    u8             field_3; // Usually 0, but sometimes filled in.
    u32            field_4; // Unknown, correlates with DMS file size.
    s_DmsInterval* intervalPtr_8;
    VECTOR3        origin_C; // Origin point, gets added to character positions.
    s_DmsEntry*    characters_18;
    s_DmsEntry     camera_1C;
} s_DmsHeader;
STATIC_ASSERT_SIZEOF(s_DmsHeader, 44);

/** @brief Returned by `func_800699F8`, collision related? */
typedef struct _s_func_800699F8
{
    s32 chara_grnd_0;
    s16 field_4;
    s16 field_6;
    s8  field_8;
    u8  unk_9[3];
} s_func_800699F8;
STATIC_ASSERT_SIZEOF(s_func_800699F8, 12);

/** @brief Used for normal credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E24, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E434C`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
} s_800AFE08;
STATIC_ASSERT_SIZEOF(s_800AFE08, 28);

/** @brief Used for UFO ending credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E40, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E4BD4`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
    s32  field_1C;
    s16  field_20;
    s16  field_22;
    s32  field_24;
    s32  field_28;
    s32  field_2C;
    s32  field_30;
    s32  field_34;
    s32  field_38;
    s32  field_3C;
    s32  field_40;
    s32  field_44;
    s32  field_48;
    s32  field_4C;
    s32  field_50;
    s32  field_54;
} s_800AFE24; // Size: 85

