#ifndef _BODYPROG_H
#define _BODYPROG_H

#include "game.h"
#include "bodyprog/sound_effects.h"
#include "bodyprog/view/vw_system.h"
#include "main/fsqueue.h"

/** @brief This header is used to declare any variable, struct, or
 * function of `BODYPROG.BIN` that has not been identified to
 * be related to a currently recognized and separated section of
 * the engine (like player logic, save game, or item screens).
 */

// ==========
// CONSTANTS
// ==========

#define WORLD_OBJECT_COUNT_MAX 29

#define OPT_SOUND_VOLUME_MIN   0
#define OPT_SOUND_VOLUME_MAX   128
#define OPT_VIBRATION_DISABLED 0
#define OPT_VIBRATION_ENABLED  128

#define IPD_HEADER_MAGIC 20
#define LM_HEADER_MAGIC  '0'
#define LM_VERSION       6

#define CHARA_FORCE_FREE_ALL 0xFF /** `Chara_Load` can force free already loaded models to make room for new ones. */

// ==============
// HELPER MACROS
// ==============

/** @brief Compares 8-character filenames using `u32`. Similar to `strcmp`.
 *
 * @param a First filename.
 * @param b Second filename.
 * @return `true` if the filenames aren't equal, `false` otherwise.
 */
#define COMPARE_FILENAMES(a, b)                                  \
    (((u_Filename*)(a))->u32[0] != ((u_Filename*)(b))->u32[0] || \
     ((u_Filename*)(a))->u32[1] != ((u_Filename*)(b))->u32[1])

// ======
// ENUMS
// ======

/** @brief IPD chunk load states.
 *
 * See `Map_ChunkLoadStateGet`.
 */
typedef enum _ChunkLoadState
{
    ChunkLoadState_Invalid  = 0, /** Entry index is `NO_VALUE`. */

    MapType_APR = 7, /** @unused */
    MapType_APU = 8,
    MapType_ER  = 9,
    MapType_ER2 = 10,
    MapType_DR  = 11,
    MapType_DRU = 12,
    MapType_HP  = 13,
    MapType_HU  = 14,
    MapType_XXX = 15, /** @unused */

    MapType_Count
} e_MapType;

typedef enum _BoneHierarchy
{
    BoneHierarchy_MultiModel = -3,
    BoneHierarchy_End        = -2
} e_BoneHierarchy;

typedef enum _EffectTextureFlags
{
    EffectTextureFlag_None         = 0,
    EffectTextureFlag_Glass        = 1 << 1, /** Broken glass in the cafe Air Screamer cutscene. */
    EffectTextureFlag_WaterRefract = 1 << 2, /** Water waves and light reflection in the sewer. */
    EffectTextureFlag_Water        = 1 << 3,
    EffectTextureFlag_Fire         = 1 << 4,
    EffectTextureFlag_Ef           = 1 << 5, // TODO: Rename. Looks like stringy flesh?
    EffectTextureFlag_Blood        = 1 << 6,
    EffectTextureFlag_WarmTest     = 1 << 7  /** @unused Test lens flare? */
} e_EffectTextureFlags;

typedef enum _SpeedZoneType
{
    SpeedZoneType_Slow   = 0,
    SpeedZoneType_Normal = 1,
    SpeedZoneType_Fast   = 2
} e_SpeedZoneType;

typedef enum _MainMenuEntry
{
    MainMenuEntry_Load     = 0,
    MainMenuEntry_Continue = 1,
    MainMenuEntry_Start    = 2,
    MainMenuEntry_Option   = 3,
    MainMenuEntry_Extra    = 4, /** @unused The extra options menu may have been accessible via the main menu. */

    MainMenuEntry_Count    = 5
} e_MainMenuEntry;

typedef enum _MainMenuState
{
    MenuState_Start              = 0,
    MenuState_Main               = 1,
    MenuState_LoadGame           = 2,
    MenuState_DifficultySelector = 3,
    MenuState_NewGameStart       = 4
} e_MainMenuState;

/** Used by `func_8003F654` to cast a specific field to the desired type. */
typedef enum _PrimitiveType
{
    PrimitiveType_None = 0,
    PrimitiveType_S8   = 1,
    PrimitiveType_U8   = 2,
    PrimitiveType_S16  = 3,
    PrimitiveType_U16  = 4,
    PrimitiveType_S32  = 5
} e_PrimitiveType;

typedef enum _LoadingScreenId
{
    LoadingScreenId_None              = 0,
    LoadingScreenId_PlayerRun         = 1,
    LoadingScreenId_BackgroundTexture = 2,
    LoadingScreenId_StageString       = 3
} e_LoadingScreenId;

typedef enum _StaticModelLoadState
{
    StaticModelLoadState_Invalid   = 0,
    StaticModelLoadState_Unloaded  = 1,
    StaticModelLoadState_Corrupted = 2, // Maybe wrong name for this.
    StaticModelLoadState_Loaded    = 3
} e_StaticModelLoadState;

typedef enum _FloorType
{
    FloorType_0     = 0,
    FloorType_1     = 1,
    FloorType_2     = 2,
    FloorType_Grass = 3,
    FloorType_4     = 4,
    FloorType_5     = 5,
    FloorType_6     = 6,
    FloorType_7     = 7,
    FloorType_8     = 8,
    FloorType_9     = 9,
    FloorType_10    = 10,
    FloorType_11    = 11,
    FloorType_12    = 12
} e_FloorType;

// ================
// UNKNOWN STRUCTS
// ================

/* Structs called by functions that haven't been identified. */

/** SFX pair used for area loading (e.g. door opening and closing). */
typedef struct
{
    u16 sfx_0;
    u16 sfx_2;
} s_AreaLoadSfx;

// Exception, as one of the unidentified structs uses this.
typedef struct _s_8002AC04
{
    struct _s_8002AC04* field_0;

    union
    {
        u8 funcIdx_4; // `funcIdx_4` in structs below, needs to be part of those structs for match.

        struct
        {
            u8  funcIdx_4;
            u8  field_5;
            u16 field_6;
            s32 field_8;
            u32 field_C;
        } func_8008973C_data;
        struct
        {
            u8  funcIdx_4;
            u8  field_5;
            u16 field_6;
            s32 field_8;
            u32 field_C;
        } func_80089D0C_data;

        struct
        {
            u8                  funcIdx_4;
            u8                  field_5   : 7;
            u32                 field_5_7 : 1;
            u16                 field_6;
            struct _s_8002AC04* field_8;
            u32                 field_C;
        } func_80089BB8_data;

        struct
        {
            u8  funcIdx_4;
            u8  field_5;
            u16 field_6;
            u8* field_8;
            u32 field_C_0  : 16;
            u32 field_C_16 : 12;
            u32 field_C_28 : 3;
            u32 field_C_31 : 1;
        } func_80089DF0_data;
        struct
        {
            u8  funcIdx_4;
            u8  field_5_0 : 5;
            u32 field_5_5 : 1;
            u32 field_5_6 : 1;
            u32 field_5_7 : 1;
            u16 field_6;
            s32 field_8;
            u32 field_C;
        } func_80089A30_data;
    } field_4;
} s_8002AC04;
STATIC_ASSERT_SIZEOF(s_8002AC04, 16);

typedef struct
{
    /* 0x0 */ s32               id;
    /* 0x4 */ s32               flags;
    /* 0x8 */ s32               modelCount;
    /* 0xC */ struct TMD_STRUCT models[1];
} s_TmdFile;

typedef struct
{
    u8  unk_0;
    u8  field_1;
    u8  unk_2[18];
    s32 field_14;
} s_800C45C8;

typedef struct
{
    char pad[12];
} s_func_8005B424;

// Something related to enemies attacks.
typedef struct
{
    union
    {
        q19_12 vx_0; // Displacement offset.
        struct
        {
            s16 field_0;
            s16 field_2;
        } s_0;
        struct
        {
            u16 field_0;
            u16 field_2;
        } s_1;
    } field_0;
    union
    {
        q19_12 vz_4;
        struct
        {
            s16 field_0;
            s16 field_2;
        } s_0;
    } field_4;
    q3_12 vy_8;
    u8    field_A;
    u8    field_B; // Flags?
    union
    {
        s32 field_0;
        struct
        {
            q3_12 field_0; // Angle.
            q3_12 field_2; // Angle.
        } s_0;
        struct
        {
            u8 field_0;
            u8 field_1;
            u8 field_2;
            u8 field_3;
        } s_1;
        struct
        {
            q4_12 field_0;
            u16   field_2;
        } s_2;
    } field_C;
    union
    {
        q20_12 field_0; // Timer.
        struct
        {
            s16 field_0;
            s16 field_2;
        } s_0;
        struct
        {
            s16 field_0;
            u8  field_2;
            u8  field_3;
        } s_1;
        struct
        {
            u8 field_0;
            u8 field_1;
            u8 field_2;
            u8 field_3;
        } s_2;
        struct
        {
            u16 field_0;
            u16 field_2;
        } s_3;
    } field_10;
} s_MapHdr_field_4C;
STATIC_ASSERT_SIZEOF(s_MapHdr_field_4C, 20);

typedef struct _Collision
{
    /* 0x0 */ q19_12 groundHeight;
    /* 0x4 */ q3_12  field_4;  // X
    /* 0x6 */ q3_12  field_6;  // Z
    /* 0x8 */ s8     field_8;  // Count of something, maybe valid ground at probed points around center? Set to 0, 7, or 12.
    // 3 bytes of padding.
} s_Collision;
STATIC_ASSERT_SIZEOF(s_Collision, 12);

typedef struct _CollisionQuery
{
    /* 0x0  */ VECTOR3 position; /** Q19.12 */
    /* 0xC  */ q3_12   bottom;
    /* 0xE  */ q3_12   top;
    /* 0x10 */ q3_12   radius;         // Unsure. Set to cylinder radius.
    /* 0x14 */ s8      collisionState; /** `e_CharaCollisionState` */
} s_CollisionQuery;
STATIC_ASSERT_SIZEOF(s_CollisionQuery, 20);

// Collision-related.
typedef struct
{
    /* 0x0  */ s32        collisionState; /** `e_CharaCollisionState` */
    /* 0x4  */ bool       field_4;
    /* 0x8  */ q19_12     distance_8;
    /* 0xC  */ SVECTOR    offset_C; // Q23.8
    /* 0x14 */ DVECTOR_XZ direction_14;
    /* 0x18 */ q23_8      positionX_18;
    /* 0x1C */ q23_8      positionZ_1C;
    /* 0x20 */ q23_8      newPositionX_20;
    /* 0x24 */ q23_8      newPositionZ_24;
    /* 0x28 */ q7_8       field_28; // Radius.
    /* 0x2A */ q7_8       field_2A; // Wrong name. Top.
    /* 0x2C */ q7_8       field_2C; // Bottom.
} s_func_8006ABC0;

typedef struct
{
    u8  unk_0[2];
    s16 field_2;
    u8  unk_4[2];
    s16 field_6;
} s_func_8006CA18;

typedef struct
{
    u8  field_0;
    u8  field_1;
    s16 field_2;
    s32 field_4;
} s_CollisionState_A8;

typedef struct
{
    s8      field_0;
    s8      unk_1;
    DVECTOR field_2; // Q3.12 | Angle constraint. X is min, Y is max. TODO: Don't use `DVECTOR` for this anymore.
} s_CollisionState_44_0;

typedef struct
{
    s_CollisionState_44_0 field_0;
    s16                  field_6;
    s_CollisionState_44_0 field_8;
    s16                  field_E;
    s8*                  field_10[8];
    s_CollisionState_44_0 field_30;
    s16                  field_36;
} s_CollisionState_44;

// Function from lib_unk
typedef struct _func_8009ECCC
{
    struct _func_8009ECCC* field_0; // TODO: Not sure if these point to other struct type or same type.
    struct _func_8009ECCC* field_4;
    s32                    field_8;
    s32                    field_C;
    s_8002AC04*            field_10;
    u32                    field_14_0  : 16;
    u32                    field_14_16 : 8;
    u32                    field_14_24 : 7;
    u32                    field_14_31 : 1;
    u32                    field_18;
    u16                    field_1C;
    u16                    field_1E;
} s_func_8009ECCC;

typedef struct
{
    q19_12 field_0; // X position.
    q19_12 field_4; // Z position.
    s32    field_8;
    s32    field_C;
    q19_12 field_10; // X
    q19_12 field_14; // Z
    s32    field_18; // X } Bounds?
    s32    field_1C; // X }
    s32    field_20; // Z }
    s32    field_24; // Z }
    q19_12 field_28; // Maybe XZ position.
    q19_12 field_2C; // Base height?
} s_func_8006F338;

typedef struct
{
    q3_12 field_0; // X
    q3_12 field_2; // Z
} s_func_8006E490_20;

typedef struct
{
    s8                 unk_0[8];
    DVECTOR            field_8;
    s16                field_C;
    s16                field_E;
    s32                field_10; // } X
    s32                field_14; // } Z?
    s16                field_18;
    s8                 unk_1A[2];
    s32                field_1C; // Index into `field_20`.
    s_func_8006E490_20 field_20[2];
} s_func_8006E490;

/** @brief Character keyframe collision info. */
typedef struct _Keyframe
{
    /* 0x0 */ s_CharaBox          box;
    /* 0xC */ s_CharaShapeOffsets shapeOffsets;
} s_Keyframe;

/** @brief 8-character string usually used for filenames. Can be compared via the `u32` field. */
typedef union _Filename
{
    char str[8];
    u32  u32[2];
} u_Filename;

/** @brief Struct used by many functions involved with GTE. Kept at `PSX_SCRATCH_ADDR` (possibly only temporarily). */
typedef struct _GteScratchData
{
    DVECTOR screenXy_0[90];
    u16     screenZ_168[18];

    s16 field_18C[99]; // The size changed from 150 due to the addition of `field_252`. Not sure if this is correct.
    u8  field_252[102];

    u8      field_2B8[200]; // Size likely incorrect.

    union
    {
        MATRIX field_0;
        struct
        {
            s32     field_0;
            s32     field_4;
            CVECTOR field_8;
            CVECTOR field_C;
            u8      field_10;
            u8      field_11;
            u8      field_12;
            u8      field_13;
            u8      field_14;
            u8      field_15;
            u8      field_16;
            u8      field_17;
            s32     field_18;
            s32     field_1C;
        } s_0;
    } field_380;

    s_Normal field_3A0;

    DVECTOR  screenPos_3A4;
    s32      depthP_3A8;
    SVECTOR  field_3AC;
    u8       unk_3B4[36];
    CVECTOR  field_3D8; // Written by `func_8005A42C`.
    DVECTOR  screenPos_3DC;
    s32      depthP_3E0;
    s16      rotMatrix_3E4[3][3]; // Truncated `MATRIX` without the `long t[3];` transfer vector?
} s_GteScratchData;

typedef struct _Primitive
{
    u16 field_0;
    u16 field_2;
    u16 field_4;
    union
    {
        struct
        {
            u8 field_6_0  : 8;
            s8 field_6_8  : 7;
            u8 isTransparent : 1; /** `bool` */
        } bits;

        u16 flags; // @hack `func_8005AC50` accesses `isTransparent` above with some weird shifts, haven't found how to make it work with bitfield yet.
    } field_6;
    u16 field_8;
    u16 field_A;
    u8  field_C[4];  // } Unknown type. `func_8005AC50` reads these as `s32`, but that breaks other funcs which use this struct. `s32` reads might have just been `memcpy`?
    u8  field_10[4]; // }
} s_Primitive;
STATIC_ASSERT_SIZEOF(s_Primitive, 20);

typedef struct _MeshHeader
{
    /* 0x0  */ u8           primitiveCount;
    /* 0x1  */ u8           vertexCount;
    /* 0x2  */ u8           normalCount;
    /* 0x3  */ u8           unkCount_3;
    /* 0x4  */ s_Primitive* primitives;
    /* 0x8  */ DVECTOR*     verticesXy;
    /* 0xC  */ s16*         verticesZ;
    /* 0x10 */ s_Normal*    normals;
    /* 0x14 */ u8*          unkPtr_14;
} s_MeshHeader;
STATIC_ASSERT_SIZEOF(s_MeshHeader, 24);

typedef struct _ModelHeader
{
    u_Filename    name_0;
    u8            meshCount_8;
    u8            vertexOffset_9;
    u8            normalOffset_A;
    u8            field_B_0 : 1;
    u8            field_B_1 : 3; // Value used in `func_800571D0` switch.
    u8            field_B_4 : 2;
    u8            unk_B_6   : 2;
    s_MeshHeader* meshHdrs_C;
} s_ModelHeader;
STATIC_ASSERT_SIZEOF(s_ModelHeader, 16);

/** @brief Model texture. */
typedef struct _Texture
{
    /* 0x0  */ s_FsImageDesc imageDesc;
    /* 0x8  */ u_Filename    name;
    /* 0x10 */ u32           queueIdx;
    /* 0x14 */ s8            refCount;
} s_Texture;

typedef struct _Material
{
    u_Filename name_0;
    s_Texture* texture_8;
    u8         field_C;
    u8         unk_D[1];
    u8         field_E;
    u8         field_F;
    u16        field_10;
    u16        field_12;
    union
    {
        u8  u8[2];
        u16 u16;
    } field_14;
    union
    {
        u8  u8[2];
        u16 u16;
    } field_16;
} s_Material;
STATIC_ASSERT_SIZEOF(s_Material, 24);

/** @brief LM file header. */
typedef struct _LmHeader
{
    /* 0x0  */ u8             magic;    /** See `LM_HEADER_MAGIC`. */
    /* 0x1  */ u8             version;  /** See `LM_VERSION`. */
    /* 0x2  */ u8             isLoaded; /** `bool` */
    /* 0x3  */ u8             materialCount;
    /* 0x4  */ s_Material*    materials;
    /* 0x8  */ u8             modelCount;
               // 3 bytes of padding.
    /* 0xC  */ s_ModelHeader* modelHdrs;
    /* 0x10 */ u8*            modelOrder;
} s_LmHeader;

typedef struct _IpdCollisionData_10
{
    s16 field_0;
    s16 field_2; // Q8? Related to ground height?
    s16 field_4;
    u16 field_6_0  : 5; // TODO: Might be using `s_IpdCollisionData_18` substruct here? Won't fit though.
    u16 field_6_5  : 3;
    u16 field_6_8  : 3;
    u16 field_6_11 : 4;
    u16 field_6_15 : 1;
    s16 field_8;
    s16 field_A;
} s_IpdCollisionData_10;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_10, 12);

typedef struct
{
    s16 field_0_0  : 14;
    u16 field_0_14 : 2;
    s16 field_2_0  : 14;
    u16 field_2_14 : 2;
    s16 field_4;
    u8  field_6;
    u8  field_7;
    u8  field_8;
    u8  field_9;
} s_IpdCollisionData_14;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_14, 10);

typedef struct
{
    s16 field_0; // Base index into `s_IpdCollisionData::ptr_28`.
    s8  __pad_2[2];
} s_IpdCollisionData_20;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_20, 4);

typedef struct _IpdCollisionData_18
{
    u16      field_0_0  : 5;
    u16      field_0_5  : 3;
    u16      field_0_8  : 4;
    u16      field_0_12 : 3;
    u16      field_0_15 : 1;
    SVECTOR3 vec_2;
    s16      field_8;
} s_IpdCollisionData_18;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_18, 10);

typedef struct _IpdCollisionData
{
    s32                    positionX;
    s32                    positionZ;
    u32                    field_8_0  : 8;
    u32                    field_8_8  : 8;
    u32                    field_8_16 : 8;
    u32                    field_8_24 : 8;
    SVECTOR3*              ptr_C;
    s_IpdCollisionData_10* ptr_10;
    s_IpdCollisionData_14* ptr_14;
    s_IpdCollisionData_18* ptr_18;
    q7_8                   field_1C;
    u8                     field_1E; // } Used as multipliers for `field_1C` in `func_8006B004`.
    u8                     field_1F; // }
    s_IpdCollisionData_20* ptr_20;
    u16                    field_24; // `field_24/``field_26` defined in ipd2obj but haven't seen used yet, might be size of `ptr_28`/`ptr_2C`.
    u16                    field_26;
    u8*                    ptr_28; // Accessed as array of indices into `field_34` by `func_8006E53C`.
    void*                  ptr_2C;
    u8                     field_30;
    u8                     __pad_31[3];
    u8                     field_34[256];
} s_IpdCollisionData;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData, 308);

// Node of some kind?
typedef struct _IpdModelBuffer_C
{
    /* 0x0 */ s_ModelHeader* modelHdr;
    /* 0x4 */ MATRIX         mat;
} s_IpdModelBuffer_C;
STATIC_ASSERT_SIZEOF(s_IpdModelBuffer_C, 36);

/** @brief IPD model buffer. */
typedef struct _IpdModelBuffer
{
    /* 0x0  */ u8                  field_0; // Count of `field_C` entries.
    /* 0x1  */ u8                  field_1;
    /* 0x2  */ u8                  subcellCount;
    /* 0x3  */ s8                  __pad_3;
    /* 0x4  */ q7_8                minX; // } TODO: Cell range or subcell range?
    /* 0x6  */ q7_8                maxX; // }
    /* 0x8  */ q7_8                minZ; // }
    /* 0xA  */ q7_8                maxZ; // }
    /* 0xC  */ s_IpdModelBuffer_C* field_C;
    /* 0x10 */ SVECTOR*            field_10;         // Pointer to unknown collision data.
    /* 0x14 */ SVECTOR*            subcellPositions; /** XZ positions. TODO: Use different struct. */
} s_IpdModelBuffer;
STATIC_ASSERT_SIZEOF(s_IpdModelBuffer, 24);

typedef struct _IpdModelInfo
{
    /** 0x0 */ u8             isGlobalPlm; // `false` if loaded from inside `IPD`, `true` if loaded from `*_GLB.PLM`.
               // 3 bytes of padding.
    /** 0x4 */ u_Filename     modelName;
    /** 0xC */ s_ModelHeader* modelHdr;
} s_IpdModelInfo;
STATIC_ASSERT_SIZEOF(s_IpdModelInfo, 16);

/** @brief IPD model file header. */
typedef struct _IpdHeader
{
    /* 0x0  */ u8                 magic;
    /* 0x1  */ u8                 isLoaded; /** `bool` */
    /* 0x3  */ s8                 cellX;
    /* 0x3  */ s8                 cellZ;
    /* 0x4  */ s_LmHeader*        lmHdr;
    /* 0x8  */ u8                 modelCount;
    /* 0x9  */ u8                 modelBufferCount;
    /* 0xA  */ u8                 modelOrderCount;
    /* 0xB  */ s8                 unk_B[9];
    /* 0x14 */ s_IpdModelInfo*    modelInfo;
    /* 0x18 */ s_IpdModelBuffer*  modelBuffers;
    /* 0x1C */ u8                 textureCount; // Should it be `u32`?
                                                // "`u8` - Relative pointer to textures list"
                                                // "`u32` - Relative pointer to object order"
    /* 0x1D */ s8                 unk_1D[51];
    /* 0x50 */ u8*                modelOrderList;
    /* 0x54 */ s_IpdCollisionData collisionData;
} s_IpdHeader;

// See: https://github.com/laura-a-n-n/silent-hill-museum/blob/main/ksy/sh1anm.ksy
typedef struct _AnmBindPose
{
    /* 0x0 */ s8 parentBone;
    /* 0x1 */ s8 rotationDataIdx;
    /* 0x2 */ s8 translationDataIdx;
    /* 0x3 */ s8 translationInitial[3];
} s_AnmBindPose;
STATIC_ASSERT_SIZEOF(s_AnmBindPose, 6);

/** @brief ANM file header. */
typedef struct _AnmHeader
{
    /* 0x0  */ u16           dataOffset;
    /* 0x2  */ u8            rotationBoneCount;
    /* 0x3  */ u8            translationBoneCount;
    /* 0x4  */ u16           keyframeDataSize; /** Size per keyframe. `(rotationBoneCount * 9) + (translationBoneCount * 3)`? */
    /* 0x6  */ u8            boneCount;        /** Size of `bindPoses`. */
               // 1 byte of padding.
    /* 0x8  */ u32           activeBones; /** Bit field of bones to update. */
    /* 0xC  */ u32           fileSize;
    /* 0x10 */ u16           keyframeCount;
    /* 0x12 */ u8            scaleLog2;
    /* 0x13 */ u8            rootYOffset;
    /* 0x14 */ s_AnmBindPose bindPoses[0];
} s_AnmHeader;
STATIC_ASSERT_SIZEOF(s_AnmHeader, 20);

typedef union
{
    s16 field_0;
    struct
    {
        u8 field_0;
        u8 field_1;
    } s_field_0;
} s_CollisionState_CC_C;

typedef struct
{
    DVECTOR_XZ field_0;
    DVECTOR_XZ field_4;
    u32        field_8;
    s32        field_C;
    s16        field_10;
    s8         __pad_12[2];
    DVECTOR_XZ field_14;
} s_CollisionState_CC_20;

typedef struct
{
    s_IpdCollisionData*   ipdCollisionData_0;
    u8                    field_4; // Index.
    u8                    field_5;
    SVECTOR3              field_6; // Q7.8 | Probe position?
    s_CollisionState_CC_C  field_C;
    u8                    field_E;
    u8                    field_F;
    u8                    field_10;
    u8                    field_11;
    SVECTOR3              field_12;
    SVECTOR3              field_18;
    s8                    unk_1E[2];
    s_CollisionState_CC_20 field_20;
} s_CollisionState_CC;
STATIC_ASSERT_SIZEOF(s_CollisionState_CC, 56);

typedef struct _CollisionState
{
    u8                 field_0_0  : 8; // Boolean? Code only assigns 1.
    s8                 field_0_8  : 1; // Something to do with collision. `bool` flag that states if there's a displacement?
    s8                 field_0_9  : 1;
    s8                 field_0_10 : 1;
    s8                 field_0_11 : 5;
    u16                flags_2    : 16; /** `e_CollisionFlags` */
    s_func_8006ABC0    field_4;
    s32                field_34;
    s16                field_38;
    s16                field_3A;
    s16                field_3C; // X?
    s16                field_3E; // Z?
    s8*                field_40;
    s_CollisionState_44 field_44;
    q23_8              field_7C; // Related to ground height?
    s32                field_80; // X
    s32                field_84; // Z
    s32                field_88; // X
    s32                field_8C; // Z
    s32                field_90; // `bool`?
    s32                field_94;
    union
    {
        DVECTOR_XZ vec_0;
        s32        field_0;
    } field_98;
    union
    {
        DVECTOR_XZ vec_0;
        s32        field_0;
    } field_9C;
    union
    {
        struct
        {
            u8                 field_0; // Start index for something.
            u8                 field_1;
            u8                 field_2;
            u8                 field_3;
            s_func_8006CA18*   field_4;
            s_CollisionState_A8 field_8[4];
        } s_0;
        struct
        {
            q7_8 field_0; // Set to absolute character bottom height.
            q7_8 field_2; // Set to absolute character top height.
            s16  field_4;
            u8   collisionState; /** `e_CharaCollisionState` */
            u8*  field_8;
            s8   unk_C[28];
        } s_1;
    } field_A0;
    u8                 field_C8;
    u8                 unk_C9[1];
    /* 0xCA */ q7_8               groundHeight;
    s_CollisionState_CC field_CC;
    // TODO: Maybe incomplete. Maybe not, added the final padding based on `Collision_Get`.
} s_CollisionState;

/** @brief Global LM model. */
typedef struct _GlobalLm
{
    /* 0x0 */ s_LmHeader* lmHdr;
    /* 0x4 */ s32         fileIdx;
    /* 0x8 */ s32         queueIdx;
} s_GlobalLm;

typedef struct _ModelInfo
{
    /* 0x0 */ s32            field_0; // Bone flags?
    /* 0x4 */ GsCOORDINATE2* coord;
    /* 0x8 */ s_ModelHeader* modelHdr;
    /* 0xC */ s32            modelIdx;
} s_ModelInfo;

/** @brief IPD skeleton model bone. */
typedef struct _Bone
{
    /* 0x0  */ s_ModelInfo modelInfo;
    /* 0x10 */ s8          idx;
               // 3 bytes of padding.
} s_Bone;
STATIC_ASSERT_SIZEOF(s_Bone, 20);

/** @brief IPD skeleton model bone node. */
typedef struct _LinkedBone
{
    /* 0x0  */ s_Bone              bone;
    /* 0x14 */ struct _LinkedBone* next;
} s_LinkedBone;
STATIC_ASSERT_SIZEOF(s_LinkedBone, 24);

typedef struct
{
    /* 0x0 */ u8            boneCount;
    /* 0x1 */ u8            boneIdx;
    /* 0x2 */ u8            field_2;
    /* 0x3 */ s8            field_3;
    /* 0x4 */ s_LinkedBone* bones_4;
    /* 0x8 */ s_LinkedBone* bones_8;
    /* 0xC */ s_LinkedBone  bones_C[56];
} s_Skeleton;
STATIC_ASSERT_SIZEOF(s_Skeleton, 1356);

typedef struct
{
    s8  field_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s32 field_4[4];
} s_800382B0;

typedef struct
{
    s16 field_0; // Flags?
} s_8008D850;

// or `s_AnimMetadata`?
typedef struct _CharaAnimDataInfo
{
    /* 0x0  */ s8             charaId0_0;  /** `e_CharaId` */
    /* 0x1  */ s8             charaId1_1;  /** `e_CharaId` */
               // 2 bytes of padding.
    /* 0x4  */ s32            animFile0_4; // s_AnmHeader* animFile0_4; // TODO: Needs to be a pointer.
    /* 0x8  */ s_AnmHeader*   animFile1_8;
    /* 0xC  */ s32            animBufferSize1_C;
    /* 0x10 */ s32            animBufferSize2_10;
    /* 0x14 */ GsCOORDINATE2* npcBoneCoords;
} s_CharaAnimDataInfo;
STATIC_ASSERT_SIZEOF(s_CharaAnimDataInfo, 24);

/** Related to weapon attacks. Stats, SFX IDs, damange values, etc.? */
typedef struct
{
    /* 0x0  */ q4_12 field_0;
    /* 0x2  */ q3_12 field_2;
    /* 0x4  */ u16   field_4; // Related to damage. Multiplier?
    /* 0x6  */ s8    field_6; // Accessed by `func_8008BF84` as `u16`
    /* 0x7  */ s8    unk_7;
    /* 0x8  */ u8    field_8;   // Accessed by `func_8008BF84` as `u16`
    /* 0x9  */ u8    charaId_9; /** `e_CharaId` */
    /* 0xA  */ u8    field_A;   // Accessed by `func_8008BF84` as `u16`
    /* 0xB  */ u8    field_B;
    /* 0xC  */ q4_12 field_C;
    /* 0xE  */ u8    field_E;  // Keyframe index offset?
    /* 0xF  */ u8    field_F;  // Keyframe index offset?
    /* 0x10 */ u8    field_10; // State.
    /* 0x11 */ u8    field_11;
    /* 0x12 */ u8    field_12; // SFX ID subgroup. Uses values 0-4.
    /* 0x13 */ s8    __pad_13;
    /* 0x14 */ u32*  unk_14; // Some pointer. All entries have the same value `D_800AD4C4`.
} s_800AD4C8;
STATIC_ASSERT_SIZEOF(s_800AD4C8, 24);

/** @brief Collision point data. */
typedef struct _CollisionPoint
{
    /* 0x0  */ VECTOR3     position; /** Q19.12 */
    /* 0xC  */ s_Collision collision;
    /* 0x18 */ s32         field_18; // Count of points in circle?
} s_CollisionPoint;

typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800BCDA8;
STATIC_ASSERT_SIZEOF(s_800BCDA8, 4);

/** @brief Speed zone. Defines a volume used for player speed modulation. */
typedef struct _SpeedZone
{
    /* 0x0 */ s8   type; /** `e_SpeedZoneType` */
              // 1 byte of padding.
    /* 0x2 */ q11_4 minX;
    /* 0x4 */ q11_4 maxX;
    /* 0x6 */ q11_4 minZ;
    /* 0x/ */ q11_4 maxZ;
} s_SpeedZone;

/** @brief Water zone. Defines a volume used for visual water effects. */
typedef struct _WaterZone
{
    /* 0x0 */ u8    isEnabled; /** `bool` */
              // 1 byte of padding.
    /* 0x2 */ q11_4 illumination;
    /* 0x4 */ q11_4 minX;
    /* 0x6 */ q11_4 maxX;
    /* 0x8 */ q11_4 minZ;
    /* 0xA */ q11_4 maxZ;
} s_WaterZone;

/** @brief Character model. */
typedef struct _CharaModel
{
    /* 0x0  */ u8            charaId;  /** `e_CharaId` */
    /* 0x1  */ u8            isLoaded; /** `bool` */
               // 2 bytes of padding.
    /* 0x4  */ s32           queueIdx;
    /* 0x8  */ s_LmHeader*   lmHdr;
    /* 0xC  */ s_FsImageDesc texture;
    /* 0x14 */ s_Skeleton    skeleton;
} s_CharaModel;
STATIC_ASSERT_SIZEOF(s_CharaModel, 1376);

/** @brief Map GFX info. */
typedef struct _MapGfxInfo
{
    /* 0x0 */ s16                plmFileIdx_0;
    /* 0x2 */ char               tag_2[4];
    /* 0x6 */ u8                 flags_6; /** `e_MapFlags` */
              // 1 byte of padding.
    /* 0x8 */ const s_WaterZone* waterZones_8;
    /* 0xC */ const s_SpeedZone* speedZones_C;
} s_MapInfo;

// Rough name.
typedef struct _WorldObjectMetadata
{
    /* 0x0 */ u_Filename name_0;
    /* 0x8 */ s8         field_8;
    /* 0x9 */ s8         lmIdx_9; /** Set to 2 when found in `g_Map.globalLm.lmHdr` and 3-6 if found in `g_Map.ipdActive[i] (i + 3)`. */
} s_WorldObjectMetadata;

// Rough name.
typedef struct _WorldObjectModel
{
    /* 0x0  */ s_ModelInfo           modelInfo;
    /* 0x10 */ s_WorldObjectMetadata metadata;
} s_WorldObjectModel;
STATIC_ASSERT_SIZEOF(s_WorldObjectModel, 28);

/** @brief Geometry-space world object to draw. */
typedef struct _WorldObject
{
    /* 0x0    */ s_WorldObjectModel* model;
    /* 0x4+0  */ s32                 positionX  : 18;
    /* 0x4+18 */ s32                 positionY  : 14;
    /* 0x8+0  */ s32                 positionZ : 18;
    /* 0x8+18 */ s32                 __pad_8_18 : 14;
    /* 0xC+0  */ s32                 rotationX  : 10;
    /* 0xC+10 */ s32                 rotationY  : 12;
    /* 0xC+22 */ s32                 rotationZ  : 10;
} s_WorldObject;
STATIC_ASSERT_SIZEOF(s_WorldObject, 16);

/** @brief World-space trigger zone. */
typedef struct _TriggerZone
{
    /* 0x0+0  */ u8  isEndOfArray : 1;  /** `bool` | Marks last entry. */
    /* 0x0+1  */ s32 positionX    : 10; /** Meter steps. */
    /* 0x0+11 */ s32 positionZ    : 10; /** Meter steps. */
    /* 0x0+21 */ u32 sizeX        : 4;  /** Meter steps. */
    /* 0x0+25 */ u32 sizeZ        : 4;  /** Meter steps. */
    /* 0x0+29 */ u32 height       : 3;  /** Half-meter steps. Used to set `s_func_8006F338::field_2C` which is then copied by `func_8006F250`. */
} s_TriggerZone;
STATIC_ASSERT_SIZEOF(s_TriggerZone, 4);

/** @brief Hand-held player item. */
typedef struct _HeldItem
{
    /* 0x0  */ s32           itemId; /** `e_InvItemId` */
    /* 0x4  */ s32           queueIdx;
    /* 0x8  */ char*         textureName;
    /* 0xC  */ s_FsImageDesc imageDesc;
    /* 0x14 */ s_LmHeader*   lmHdr;
    /* 0x18 */ s_Bone        bone;
} s_HeldItem;
STATIC_ASSERT_SIZEOF(s_HeldItem, 44);

/** @brief World GFX workspace.
 * TODO: Could be `s_RendererWork`? Will depend on where other data resides.
 * Will: `s_WorldModelWork` fits better, this is mainly responsible for handling model data.
 * `s_WorldEnvWork` should have this name as it is used for general GFX.
 * Will (2): Maybe isn't supposed to be something exclusively graphic related, but rather
 * general in-game world struct, as it also contains triggers and camera information.
 */
typedef struct _WorldGfxWork
{
    /* 0x0    */ s_MapInfo*        mapInfo;
    /* 0x4    */ u8                useStoredPoint; /** `bool` */
    /* 0x5    */ s8                __pad_5[3];
    /* 0x8    */ VECTOR3           ipdSamplePoint; /** Used by IPD logic to sample which chunks to load or unload. */
    /* 0x14   */ u8*               charaLmBuffer;
    /* 0x18   */ s_CharaModel*     registeredCharaModels[Chara_Count];
    /* 0xCC   */ s_CharaModel      charaModels[CHARA_GROUP_COUNT];
    /* 0x164C */ s_CharaModel      harryModel;
    /* 0x1BAC */ s_HeldItem        heldItem; /** Item held by the player. */
    /* 0x1BD8 */ s_TriggerZone*    triggerZone;
    /* 0x1BDC */ VC_CAMERA_INTINFO vcCameraInternalInfo; /** Debug camera info. */
    /* 0x1BE4 */ s_LmHeader        itemLmHdr;
    /* 0x1BF4 */ u8                itemLmData[4096 - sizeof(s_LmHeader)]; // 4kb allocated for 2.75kb game files.
    /* 0x2BE4 */ s32               itemLmQueueIdx;
    /* 0x2BE8 */ s32               objectCount;                     /** `objects` size. */
    /* 0x2BEC */ s_WorldObject     objects[WORLD_OBJECT_COUNT_MAX]; /** World objects to draw. */
} s_WorldGfxWork;
STATIC_ASSERT_SIZEOF(s_WorldGfxWork, 11708);

/** @brief IPD map geometry chunk. */
typedef struct _IpdChunk
{
    /* 0x0  */ s_IpdHeader* ipdHdr;
    /* 0x4  */ s32          queueIdx;
    /* 0x8  */ s16          cellX;
    /* 0xA  */ s16          cellZ;
    /* 0xC  */ q19_12       distance0;
    /* 0x10 */ q19_12       distance1;
    /* 0x14 */ u8           materialCount;
    /* 0x15 */ s8           __pad_15[3];
    /* 0x18 */ s32          outsideCount;
} s_IpdChunk;
STATIC_ASSERT_SIZEOF(s_IpdChunk, 28);

typedef struct _IpdRow
{
    s16 idx[16];
} s_IpdColumn;
STATIC_ASSERT_SIZEOF(s_IpdColumn, 32);

typedef struct _ActiveTextures
{
    /* 0x0 */ s32        count;
    /* 0x4 */ s_Texture* textures[10];
} s_ActiveTextures;

typedef struct _IpdTextures
{
    /* 0x0   */ s_ActiveTextures fullPage;
    /* 0x2C  */ s_ActiveTextures halfPage;
    /* 0x58  */ s_Texture        fullPageTextures[8];
    /* 0x118 */ s_Texture        halfPageTextures[2];
} s_IpdTextures;
STATIC_ASSERT_SIZEOF(s_IpdTextures, 328);

typedef struct _Map
{
    /* 0x0   */ s_IpdCollisionData collisionData; // Default chunk collision data?
    /* 0x134 */ s32                texFileIdx;
    /* 0x138 */ s_GlobalLm         globalLm;
    /* 0x144 */ char               mapTag[4];
    /* 0x148 */ s32                mapTagSize;
    /* 0x14C */ s32                ipdFileIdx;
    /* 0x150 */ s_IpdHeader*       ipdBuffer;
    /* 0x154 */ s32                ipdBufferSize;
    /* 0x158 */ s32                ipdActiveCount;
    /* 0x15C */ s_IpdChunk         ipdActive[4];
    /* 0x1CC */ s_IpdColumn        ipdGrid[18];
    /* 0x40C */ s8                 unk_40C[32]; // Could be one extra row in table above.
    /* 0x42C */ s_IpdColumn*       ipdGridCenter;
    /* 0x430 */ s_IpdTextures      ipdTextures;
    /* 0x578 */ q19_12             positionX;
    /* 0x57C */ q19_12             positionZ;
    /* 0x580 */ s32                cellX;
    /* 0x584 */ s32                cellZ;
    /* 0x588 */ bool               isExterior;
} s_Map;
STATIC_ASSERT_SIZEOF(s_Map, 1420);

/** @brief World fog info. */
typedef struct _Fog
{
    /* 0x0  */ s32     nearDistance;
    /* 0x4  */ q23_8   farDistance; // "DrawDistanmce" in SHME, "has no effect when fog is disabled".
    /* 0x8  */ s32     depthShift;  // "FogThing1" from SHME. Affects the distance where fog begins.
    /* 0xC  */ s32     intensity;   // "FogThing2" from SHME. Affects the distance where fog begins.
    /* 0x10 */ CVECTOR color;
} s_Fog;

// Related to `s_PointLight`.
typedef struct
{
    VECTOR3 field_0[2][1];
} s_WorldEnvWork_84;

/** @brief Dynamic point light. */
typedef struct _PointLight
{
    /* 0x0  */ s32               field_0; // Light intensity in Q4?
    /* 0x4  */ q3_12             lensFlareIntensity;
    /* 0x8  */ q19_12            intensity;
    /* 0xC  */ SVECTOR           direction; /** Q3.12 */
    /* 0x14 */ VECTOR3           position;  /** Q19.12 */
    /* 0x20 */ SVECTOR           rotation;  /** Q3.12 */
    /* 0x28 */ SVECTOR           field_28;  // Q8 light position for matrix?
    /* 0x30 */ SVECTOR           field_30;  // Light offset?
    /* 0x38 */ s_WorldEnvWork_84 field_38[3];
} s_PointLight;

/** @brief World environment workspace.
 *
 * Holds fog distances and ramps, lighting and color parameters, water zone references, and other per-map environmental
 * data used for world drawing.
 */
typedef struct _WorldEnvWork
{
    /* 0x0   */ u8           field_0;      // `bool`?
    /* 0x1   */ u8           isFogEnabled; /** `bool` */
    /* 0x2   */ u8           field_2;
    /* 0x3   */ u8           field_3; // Enviroment lighting.
    /* 0x4   */ s_WaterZone* waterZones;
    /* 0x8   */ s32          screenBrightness;
    /* 0xC   */ s_Fog        fog;
    /* 0x20  */ s32          field_20; // Map lighting.
    /* 0x24  */ CVECTOR      field_24; // Character color lighting.
    /* 0x28  */ CVECTOR      worldTintColor;
    /* 0x2C  */ MATRIX       colorMat;
    /* 0x50  */ s_PointLight light;
    /* 0xCC  */ u8           fogRamp[128]; // Fog-related values based on `fog.nearDistance`/`fog.farDistance`.
    /* 0x14C */ u16          field_14C;
} s_WorldEnvWork;

typedef struct
{
    u8      field_0; // `bool`?
    u8      field_1; // `bool`?
    u8      field_2; // `bool`?
    u8      field_3;
    s8      unk_4[4];
    s16     field_8;
    s16     field_A;
    VECTOR3 field_C; // Q19.12
    s8      unk_18[4];
    s32     field_1C;
    q19_12  field_20;
} s_800C4818;

typedef struct
{
    u8  unk_0[4];
    s16 field_4;
    s16 field_6; // Keyframe index or time.
} s_800C44F0; // Probable size: 8 bytes.

/** @brief Character file info.
 * Holds file IDs of anim/model/texture for each `e_CharaId` along with some data used in VC camera code.
 */
typedef struct _CharaFileInfo
{
    /* 0x0    */ s16            animFileIdx;
    /* 0x2    */ s16            modelFileIdx;
    /* 0x4+0  */ s16            textureFileIdx    : 16;
    /* 0x4+16 */ q8_8           field_6           : 10;
    /* 0x4+26 */ u16            materialBlendMode : 6; /** `e_BlendMode` */
    /* 0x8    */ s_FsImageDesc* field_8;               // TODO: Extra texture pointer? Usually `NULL` in `CHARA_FILE_INFOS`.
    /* 0xC+0  */ u16            cameraAnchor  : 2;     /** `e_CameraAnchor` */
    /* 0xC+2  */ q19_12         cameraOffsetY : 14;
                 // 2 bytes of padding.
} s_CharaFileInfo;
STATIC_ASSERT_SIZEOF(s_CharaFileInfo, 16);

/** @brief Used for normal credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height? */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E24, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E434C`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
} s_800AFE08;
STATIC_ASSERT_SIZEOF(s_800AFE08, 28);

/** @brief Used for UFO ending credits screen. */
typedef struct
{
    s_800AFE08 sub_0;
    s32        field_1C;
    s16        field_20;
    s16        field_22;
    s32        field_24;
    s32        field_28;
    s32        field_2C;
    s32        field_30;
    s32        field_34;
    s32        field_38;
    s32        field_3C;
    s32        field_40;
    s32        field_44;
    s32        field_48;
    s32        field_4C;
    s32        field_50;
    s32        field_54;
} s_800AFE24; // Size: 85

/** @brief Contains X/Z coordinates and optional 4 bytes of data.
 * Map headers include an array of these, into which `s_EventData` includes an index. */
typedef struct _MapPoint2d
{
    /* 0x0    */ q19_12 positionX;
    /* 0x4+0  */ u32    mapIdx_4_0      : 5; /** `e_PaperMapIdx`? */
    /* 0x4+5  */ u32    field_4_5       : 4;
    /* 0x4+9  */ u32    loadingScreenId : 3; /** `e_LoadingScreenId` */
    /* 0x4+12 */ u32    field_4_12      : 4;
    /* 0x4+16 */ q24_8  triggerParam0   : 8; // Usually a `Q8_ANGLE`.
    /* 0x4+24 */ u32    triggerParam1   : 8;
    /* 0x8    */ q19_12 positionZ;
} s_MapPoint2d;
STATIC_ASSERT_SIZEOF(s_MapPoint2d, 12);

/** @brief Character spawn info. */
typedef struct _SpawnInfo
{
    /* 0x0   */ q19_12 positionX;
    /* 0x4   */ s8     charaId; /** `e_CharaId` */
    /* 0x5   */ q0_8   rotationY;
    /* 0x6   */ s8     flags_6;               /** `e_SpawnFlags` | Copied to `stateStep` in `s_Model`, with `controlState = 0`. */
    /* 0x7+0 */ s32    gameDifficultyMin : 4; /** `e_GameDifficulty` | Minimum difficulty required for successful spawn. */
    /* 0x8   */ q19_12 positionZ;
} s_SpawnInfo;
STATIC_ASSERT_SIZEOF(s_SpawnInfo, 12);

/** @brief Special map-specific Harry anim data. */
typedef struct
{
    s16   status; /** Packed anim status. See `s_ModelAnim::status`. */
    s16   status_2; /** Packed anim status. See `s_ModelAnim::status`. */
    q3_12 time;   /** Fixed-point anim time. */
    s16   keyframeIdx_6;
} s_UnkStruct3_Mo;
STATIC_ASSERT_SIZEOF(s_UnkStruct3_Mo, 8);

/** Guessed based on in-debugger observation during gameplay.
 * Everything is inited to 0xFFFF and some data is written when the player is hit by monsters.
 * Might be more generic particles/decals struct.
 */
typedef struct _BloodSplat
{
    s16 field_0; // Maybe an array of `u16`s? Contains indices.
} s_BloodSplat;

typedef struct
{
    u8    unk_0;
    u8    field_1;
    u8    field_2;
    u8    unk_3;
    u8    field_4;
    u8    field_5;
    u8    field_6;
    u8    unk_7;
    u8    unk_8[2];
    s16   field_A;
    u8    unk_C[2];
    s16   field_E;
    q3_12 field_10;
    u8    unk_12[4];
    s16   field_16;
    u8    unk_18[8];
    s32   field_20;
    s32   field_24;
} s_MapOverlayHeader_5C;

typedef struct
{
    u8    field_0;
    u8    field_1;
    u8    field_2;
    u8    field_3;
    s16   field_4;
    s16   field_6;
    s16   field_8;
    s16   field_A;
    s16   field_C;
    s16   field_E;
    q3_12 field_10;
    s16   field_12;
    s32   field_14;
    s32   field_18;
    s32   field_1C;
} s_MapOverlayHeader_7C;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader_7C, 32);

typedef struct
{
    s32    field_0[4];
    s16    field_10[4];
    q19_12 field_18[4];
    u16    field_28[4];
    u8     field_30[4];
    q3_12  field_34[4]; // Y angles.
    u16    field_3C[4];
    u16    field_44[4];
    s16    field_4C[4];
    u16    field_54[4];
    u16    field_5C[4];
    q4_12  field_64[4];
    s16    field_6c[4];
    s16    field_74;
    s8     __pad_76[2];
    u8     field_78;
} s_MapOverlayHeader_94;

/** TODO: `g_MapOverlayHeader` is part of the map overlay BIN files. Maybe should be moved to `maps/shared.h`.
 * If field has a comment that lists only certain map(s) it means all others set this field to 0.
 * func(?) means the signature is unknown and a default void() was selected for now.
 */
typedef struct _MapOverlayHeader
{
    /* 0x0   */ s_MapInfo*             mapInfo;
    /* 0x4   */ u8                     (*mapRoomIdxGet)(q19_12 posX, q19_12 posY); // Called by `Savegame_MapRoomIdxUpdate`.
    /* 0x8   */ s8                     field_8;
    /* 0xC   */ s32                    (*func_C)();
                // 3 bytes of padding.
    /* 0x10  */ void                   (*bgmEvent)(bool);
    /* 0x14  */ s8                     bgmIdx;
    /* 0x15  */ u8                     ambientAudioIdx; // Ambient file index from `g_AmbientVabTaskLoadCmds`.
    /* 0x16  */ s8                     field_16;        // Set ambient tint and draw distance.
                                                        // A value of 3 sets the map to night.
                                                        // A value of 2 will sets the map to use a tint used during the hallaway
                                                        // intro.
                                                        // Giving this and next variable a name will require further investigation
                                                        // of `particle.c` code.
    /* 0x17  */ s8                     field_17;        // Set weather to play. Rain, heavy rain, or snow.
    /* 0x18  */ void                   (**loadingScreenFuncs)();
    /* 0x1C  */ s_MapPoint2d*          mapPoints;
    /* 0x20  */ void                   (**mapEventFuncs)(); /** Points to array of event functions. */
    /* 0x24  */ s_EventData*           mapEvents;
    /* 0x28  */ GsCOORDINATE2*         field_28; // Bone coords of some kind.
    /* 0x2C  */ u8*                    loadableItems;
    /* 0x30  */ const char**           mapMessages;
    /* 0x34  */ s_AnimInfo*            harryMapAnimInfos; /** Map-specific anim infos for Harry (for anims 38+). */
    /* 0x38  */ s_UnkStruct3_Mo*       field_38; // Array of 40?
    /* 0x3C  */ void                   (*initWorldObjects)(void);
    /* 0x40  */ void                   (*updateWorldObjects)(void);
    /* 0x44  */ void                   (*func_44)();
    /* 0x48  */ void                   (*npcSpawnEvent)();
    /* 0x4C  */ s_MapHdr_field_4C*     unkTable1_4C; // Related to collision?
    /* 0x50  */ s16                    unkTable1Count_50;
                // 2 bytes of padding.
    /* 0x54  */ s_BloodSplat*          bloodSplats;
    /* 0x58  */ s16                    bloodSplatCount;
                // 2 bytes of padding.
    /* 0x5C  */ s_MapOverlayHeader_5C* field_5C;
    /* 0x60  */ void                   (*func_60)(s32 idx, bool arg1);
    /* 0x64  */ s32                    (*func_64)(POLY_FT4** poly, s32);
    /* 0x68  */ s32                    (*func_68)(POLY_FT4** poly, s32);
    /* 0x6C  */ void                   (*func_6C)();
    /* 0x70  */ s32                    (*func_70)(POLY_FT4** poly, s32);
    /* 0x74  */ void                   (*func_74)();
    /* 0x78  */ s32                    (*func_78)(POLY_FT4** poly, s32);
    /* 0x7C  */ s_MapOverlayHeader_7C* field_7C; // Only map1_s01, map6_s04.
    /* 0x80  */ void                   (*func_80)();
    /* 0x84  */ s32                    (*func_84)(POLY_FT4** poly, s32);
    /* 0x88  */ s32*                   func_88;                          // Only map0_s01, map7_s01.
    /* 0x8C  */ s32                    (*func_8C)(POLY_FT4** poly, s32); // Only map0_s01, map7_s01.
    /* 0x90  */ s32                    (*func_90)(POLY_FT4** poly, s32); // Only map5_s00.
    /* 0x94  */ s_MapOverlayHeader_94* field_94;                         // Only map1_s02, map1_s03.
    /* 0x98  */ s32                    (*func_98)(POLY_FT4** poly, s32); // Only map1_s02, map1_s03.
    /* 0x9C  */ void                   (*func_9C)();                     // Only map1_s02, map1_s03.
    /* 0xA0  */ void*                  ptr_A0;                           // M1S03 only, pointer to `s_800E3A40` array.
    /* 0xA4  */ s32                    (*func_A4)(POLY_FT4** poly, s32); // Only map1_s03.
    /* 0xA8  */ void                   (*func_A8)();                     // Only map6_s02.
    /* 0xAC  */ s32                    (*func_AC)(POLY_FT4** poly, s32); // Only map4_s03, map4_s05.
    /* 0xB0  */ s32                    (*func_B0)(POLY_FT4** poly, s32); // Only map4_s03, map4_s05.
    /* 0xB4  */ s32                    (*func_B4)(POLY_FT4** poly, s32); // Only map1_s03, map4_s05, map6_s01, map6_s02, map5_s01.
    /* 0xB8  */ void                   (*func_B8)(s_SubCharacter* chara, s_PlayerExtra* extra, GsCOORDINATE2* coords);
    /* 0xBC  */ void                   (*func_BC)(s_SubCharacter* chara, s_PlayerExtra* extra, GsCOORDINATE2* coords);
    /* 0xC0  */ void                   (*func_C0)();
    /* 0xC4  */ void                   (*playerMatchArmAnimDisable)();
    /* 0xC8  */ void                   (*playerControlFreeze)();
    /* 0xCC  */ void                   (*playerControlUnfreeze)(bool setIdle);
    /* 0xD0  */ bool                   (*func_D0)(s32 playerExtraState, VECTOR3* vec, q3_12 angle, s32 vecCount); // 0x800C964C
    /* 0xD4  */ s32                    (*func_D4)(s32 playerExtraState); // Points to `sharedFunc_800D2C7C_0_s00` which has `void` return type, but changing this funcptr causes mismatch in `func_80085EB8`
    /* 0xD8  */ void                   (*func_D8)();                     // Assumed return type.
    /* 0xDC  */ void                   (*playerAnimLock)(void);
    /* 0xE0  */ void                   (*isPlayerAnimLocked)();
    /* 0xE4  */ s32                    (*playerAnimUnlock)(s_SubCharacter*, s32); // Assumed return type.
    /* 0xE8  */ s64                    (*func_E8)(s_SubCharacter*);               // Is it really `s64`???
    /* 0xEC  */ bool                   (*playerMoveDistIsZero)();
    /* 0xF0  */ void                   (*playerMoveDistClear)();
    /* 0xF4  */ void                   (*playerFallBackward)();
    /* 0xF8  */ void                   (*func_F8)();
    /* 0xFC  */ void                   (*playerDamageFeetFront)();
    /* 0x100 */ void                   (*func_100)();
    /* 0x104 */ void                   (*func_104)();
    /* 0x108 */ s32                    (*func_108)();
    /* 0x10C */ void                   (*func_10C)();
    /* 0x110 */ void                   (*func_110)();
    /* 0x114 */ void                   (*func_114)();
    /* 0x118 */ void                   (*func_118)();
    /* 0x11C */ void                   (*func_11C)();
    /* 0x120 */ void                   (*func_120)();
    /* 0x124 */ void                   (*func_124)(s_SubCharacter*); // Assumed return type.
    /* 0x128 */ s32                    (*playerRunTimerReset)(s_SubCharacter* player);
    /* 0x12C */ s32                    (*charaLock)(s_SubCharacter* chara);
    /* 0x130 */ void                   (*charaIsLockedCheck)(s_SubCharacter* chara);
    /* 0x134 */ s32                    (*charaUnlock)(s_SubCharacter* chara);
    /* 0x138 */ s32                    (*charaAnimPlaybackStateGet)(s_SubCharacter* chara);
    /* 0x13C */ bool                   (*func_13C)(s_SubCharacter* chara, s32 arg1, VECTOR3* arg2In, s32 angleIn, s32 arg4);
    /* 0x140 */ void                   (*charaVisibleSet)(s_SubCharacter* chara);
    /* 0x144 */ void                   (*charaInvisibleSet)(s_SubCharacter* chara);
    /* 0x148 */ bool                   (*func_148)(s32 animStatus, s_SubCharacter* chara, s32 keyframeIdx0, s32 keyframeIdx1, s32 sfxId, s32 pitch);
    /* 0x14C */ bool                   (*func_14C)(s32 animStatus, s_SubCharacter* chara, s32 keyframeIdx, s32 sfxId); // Play SFX?
    /* 0x150 */ s32                    (*charaAnimStartKeyframeIdxGet)(s_SubCharacter* chara);
    /* 0x154 */ void                   (*charaCollisionReset)(s_SubCharacter* chara);
    /* 0x158 */ void                   (*func_158)(q19_12 x, q19_12 z); // Only map1_s05, map1_s06.
    /* 0x15C */ void                   (*func_15C)();                   // Only map5_s01.
    /* 0x160 */ void                   (*func_160)();                   // Only map5_s01.
    /* 0x164 */ void                   (*func_164)();                   // Only map5_s01.
    /* 0x168 */ void                   (*particlesUpdate)(s32 unused, s32 mapId, s32);
    /* 0x16C */ void                   (*enviromentSet)(s8, u32);
    /* 0x170 */ void                   (*func_170)();
    /* 0x174 */ void                   (*func_174)();
    /* 0x178 */ void                   (*particleHyperBlasterBeamDraw)(VECTOR3* vec0, q19_12* rotX, q19_12* rotY);
    /* 0x17C */ void                   (*particleBeamDraw)(const VECTOR3* from, const VECTOR3* to);
    /* 0x180 */ void                   (*particleSoundStop)();
    /* 0x184 */ s32*                   windSpeedX;
    /* 0x188 */ s32*                   windSpeedZ;
    /* 0x18C */ s32*                   data_18C;
    /* 0x190 */ s32*                   data_190;
    /* 0x194 */ void                   (*charaUpdateFuncs[Chara_Count])(s_SubCharacter* chara, s_AnmHeader* anmHdr, GsCOORDINATE2* coords); /** Guessed params. Funcptrs for each `e_CharaId`, set to 0 for IDs not included in the map overlay. Called by `Game_NpcUpdate`. */
    /* 0x248 */ s8                     charaGroupIds[CHARA_GROUP_COUNT]; /** `e_CharaId` values where if `s_SpawnInfo::charaId == Chara_None`, `charaGroupIds[0]` is used for `charaSpawns[0]` and `charaGroupIds[1]` for `charaSpawns[1]`. */
    /* 0x24C */ s_SpawnInfo            charaSpawns[2][16];               /** Array of character type/position/flags. `flags_6 == 0` are unused slots? Read by `Game_NpcRoomInitSpawn`. */
    /* 0x3CC */ VC_ROAD_DATA           cameraPaths[100];
    /* 0xD2C */ s_TriggerZone          triggerZones[200];
} s_MapOverlayHeader;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader, 0x104C);

typedef struct _MapMsgSelect
{
    /* 0x0 */ s8 maxIdx;
    /* 0x1 */ u8 selectedEntryIdx;
} s_MapMsgSelect;

typedef struct _MapEffectsPresetIdxs
{
    u8 presetIdx1_0;
    u8 presetIdx2_1;
} s_MapEffectsPresetIdxs;

typedef struct
{
    q23_8 field_0; // X position.                } Offset ray hit position?
    q23_8 field_4; // Z position.                }
    q7_8  field_8; // Y position, but why `s16`? }
    q7_8  field_A; // Y??
    q7_8  field_C; // Some kind of bound or threshold or radius?
    s16   field_E;
} s_RayState_6C;

typedef struct
{
    s16 field_0;
    s16 field_2;
} s_RayState_8C;

/** @brief State for an in-progress ray trace. Contains pointers to active characters among other things. */
typedef struct
{
    s32              field_0;
    s16              field_4; // Collision flags.
    s16              field_6;
    q7_8             field_8; // Hit distance? `SHRT_MAX` if no valid hit.
    s8               unk_A[2];
    q19_12           field_C;  // } Q19.12 `VECTOR3`
    q19_12           field_10; // }
    q19_12           field_14; // }
    s8               unk_18[4];
    q7_8             field_1C; // Distance Z?
    s8               unk_1E[2];
    s_SubCharacter*  field_20;
    q3_12            field_24; // X
    q3_12            field_26; // Z
    s32              field_28;
    VECTOR3          field_2C; // Q23.8
    s8               unk_38[4];
    s32              field_3C; // X  } Q23.8 `VECTOR3`?
    s32              field_40; // Y? }
    s32              field_44; // Z  }
    s8               unk_48[4];
    q7_8             field_4C; // X?
    q7_8             field_4E; // Z?
    SVECTOR          field_50; // Q23.8
    u16              field_58;
    s16              field_5A;
    s16              field_5C; // 
    s16              field_5E;
    s16              field_60;
    s8               unk_62[2];
    s_SubCharacter** characters_64; // Active characters?
    s32              characterCount_68;
    s_RayState_6C    field_6C;
    s32              field_7C;
    s32              field_80;
    u16              field_84;
    u8               unk_86[2];
    s32              field_88;
    s_RayState_8C    field_8C[1]; // Unknown size.
} s_RayState;

/** @brief Ray trace line of sight info. */
typedef struct _RayTrace
{
    /* 0x0  */ s8              hasHit; /** `bool` */
    /* 0x1  */ u8              field_1;
    /* 0x2  */ s8              __pad_2[2];
    /* 0x4  */ VECTOR3         target; /** Q19.12 */
    /* 0x10 */ s_SubCharacter* character;
    /* 0x14 */ q19_12          field_14; // Hit distance X?
    /* 0x18 */ q19_12          field_18; // Hit distance Z?
    /* 0x1C */ q3_12           field_1C; // Angle? Counter??
} s_RayTrace;

typedef struct _CollisionResult
{
    /* 0x0  */ VECTOR3 offset_0; /** Q19.12 */
    /* 0xC  */ q19_12  groundHeight;
    /* 0x10 */ s16     field_10;
    /* 0x12 */ s16     field_12;
    /* 0x14 */ s8      field_14; /** `e_FloorType` */
    /* 0x18 */ q19_12  field_18;
} s_CollisionResult;

typedef struct
{
    DVECTOR  screenXy_0[90];
    s16      screenZ_168[18];
    s16      field_18C[72];
    s32      field_21C[39]; // Used as `VECTOR3`?
    u8       field_2B8[200];
    MATRIX   field_380;
    s_Normal field_3A0;
    DVECTOR  screenPos_3A4;
    s32      depthP_3A8;
    SVECTOR  field_3AC;
    u8       unk_3B4[36];
    CVECTOR  field_3D8;

    // Different functions access different data at 0x3DC onwards.
    // Union works for it, but also possible those functions just took different `s_GteScratchData` structs.
    union
    {
        struct
        {
            DVECTOR screenPos_3DC;
            s32     depthP_3E0;
            s16     rotMatrix_3E4[3][3]; // Truncated `MATRIX` without the `long t[3];` transfer vector?
        } vertex;

        struct
        {
            s_Normal field_3DC;
            SVECTOR  field_3E0[3];
        } normal;

        struct
        {
            u8  field_0;
            u8  field_1;
            u8  field_2;
            u8  field_3;
            u8  field_4;
            u8  field_5;
            u8  field_6;
            u8  field_7;
            s32 field_8;
        } s_1;
    } u;
} s_GteScratchData2;

// Something for inventory items.
typedef struct
{
    /* 0x0  */ q3_12   positionY;
    /* 0x2  */ q3_12   field_2; // Move dist?
    /* 0x4  */ q3_12   field_4; // Angle.
    /* 0x6  */ s16     field_6;
    /* 0x8  */ s16     field_8;
    /* 0xA  */ s8      __pad_A[2];
    /* 0xC  */ SVECTOR field_C;  // Q3.12 | Offset?
    /* 0x14 */ SVECTOR position; /** Q3.12 */
} s_800AE204;

typedef struct
{
    /* 0x0 */ s_800AE204* ptr_0;
    /* 0x4 */ u8          count_4;
    /* 0x5 */ u8          unk_5;
    /* 0x6 */ q7_8        field_6;
    /* 0x8 */ u8          field_8;
    /* 0x9 */ u8          field_9;
    /* 0xA */ u8          field_A;
    /* 0xB */ u8          field_B;
} s_800AE4DC;

typedef struct
{
    u8 field_0;
    u8 field_1;
    u8 field_2;
    u8 field_3; // Map marking sprite height?
} s_800AE8A0_0;

typedef struct
{
    s8 field_0;
    s8 field_1;
    u8 field_2;
    u8 field_3;
} s_800AE8A0_4;

/** Paper map marking graphic data? */
typedef struct
{
    POLY_FT4*    field_0;
    s_800AE8A0_0 field_4;
    s_800AE8A0_4 field_8;
    s32          field_C; // Count.
} s_func_80068E0C;

typedef struct
{
    POLY_FT4* field_0;
    SVECTOR   field_4; // Q23.8
    MATRIX    field_C;
    VECTOR3   field_2C; // Q23.8 | Set as grid-aligned player position in `func_80065B94`.
    s32       field_38;
    DVECTOR   field_3C;
    s32       field_40;
    DVECTOR   field_44;
    DVECTOR   field_48;
} s_func_80065B94;

typedef struct
{
    POLY_GT4* field_0;
    MATRIX    field_4;
    SVECTOR   field_24[3];
    VECTOR3   field_3C; // Q19.12
    s32       field_48;
    DVECTOR   field_4C;
    DVECTOR   field_50;
