#ifndef _BODYPROG_H
#define _BODYPROG_H

#include "game.h"
#include "bodyprog/vw_system.h"
#include "main/fsqueue.h"

#define TEMP_MEMORY_ADDR ((s8*)0x801A2600)
#define DEMO_WORK()      ((s_DemoWork*)0x800FDE00) // TODO: Move closer to demo structs (or to separate header?)

#define IMAGE_BUFFER_0 ((u_long*)0x801CFA00)
#define IMAGE_BUFFER_1 ((u_long*)0x801C8200)
#define IMAGE_BUFFER_2 ((u_long*)0x801ABE00)
#define FONT24_BUFFER ((u_long*)0x801F5600) // Loaded by `GameFs_StfRollBinLoad`.

#define CD_ADDR_0 0x801E2600

#define OPT_SOUND_VOLUME_MIN   0
#define OPT_SOUND_VOLUME_MAX   128
#define OPT_VIBRATION_DISABLED 0
#define OPT_VIBRATION_ENABLED  128

typedef struct 
{
    s32  field_0;
    u8   unk_4[12];
    s8*  field_16;
    u8   unk_20[4];
    s8   field_24;
    s8   field_25;
} s_func_8003C8F8;

typedef struct
{
    s8  field_0;
    s8  unk_1;
    s16 field_2;
    s16 field_4;
} s_func_8006BDDC;

typedef struct
{
    s8  unk_0[124];
    s32 field_7C;
    s32 field_80;
    s32 field_84;
    s32 field_88;
    s32 field_8C;
    s8  unk_90[4];
    s32 field_94;
} s_func_8006CC44;

typedef struct 
{
    u8 unk_0[2];
    s8 field_2;
    s8 field_3; 
    u8 unk_4[2];
} s_80024C90;

typedef struct
{
    s8 unk_0[16];
} s_8002AC04;
STATIC_ASSERT_SIZEOF(s_8002AC04, 16);
// Maybe same.
typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    struct s_80043F2C* field_C;
} s_80043F2C;
STATIC_ASSERT_SIZEOF(s_80043F2C, 16);
// Maybe same.
typedef struct
{
    u8  field_0;
    s8  unk_1[3];
    s32 field_4;
    s8  unk_2[3];
    s32 field_C;
} s_80043E50Sub;
STATIC_ASSERT_SIZEOF(s_80043E50Sub, 16);

typedef struct
{
    s32            field_0;
    s32            field_4;
    u8             elementCount_8;
    s8             unk_C[9];
    s_80043E50Sub* elements_14;
} s_80043E50;

typedef struct
{
    s8  unk_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s8  unk_4[80];
    s32 field_54;
    s32 field_58;
} s_80044044;

typedef struct
{
    s16 field_0; // Flags?
} s_8008D850;

// Likely not skeleton since filed_8 must be `s8`.
typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
    s8 unk_4[4];
    s8 field_8;
} s_80041CEC;

// Maybe level stream data?
typedef struct
{
    s32 field_0;
    s32 queueEntryIdx_4;
    s16 fileChunkCoordX_8;
    s16 fileChunkCoordZ_A;
    s32 field_C;           // Something to do with distance from file chunk edge.
    s32 field_10;          // Something to do with distance from file chunk edge.
} s_80043338;

// Maybe s_Skeleton?
typedef struct
{
    s8  unk_0;
    u8  field_1;
    s8  unk_2[2];
    s32 field_4;
    s8  unk_8[12];
    s32 field_14;
    s32 unk_18; 
} s_80043B70;

typedef struct
{
    s8 unk_0;
    u8 field_1;
} s_80043BA4;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s16 field_8;
    s8  unk_A;
    s8  field_B;
    s8  field_C;
    s8  field_D;
    s16 field_E;
    s32 field_10;
} s_func_800625F4;
STATIC_ASSERT_SIZEOF(s_func_800625F4, 20);

typedef struct
{
    s8  unk_0[4];
    u8  field_4;
    u8  field_5;
    u16 field_6;
    s32 field_8;
    s32 field_C;
} s_func_8008973C;

typedef struct
{
    s8  unk_0[22];
    s32 field_18;
} s_func_80089840;

typedef struct
{
    s8 unk_0[14];
    u8 field_E;
    u8 field_F;
} s_8008A35C;

typedef struct
{
    u8  field_0;
    s8  unk_1;
    s16 field_2;
    s8  unk_4[4];
    s32 field_8;
} s_8008E51C;

typedef struct
{
    s8  unk_0[4];
    u32 field_4; // Fields 4 and 8 are related.
    u32 field_8;
    s32 field_C;
    s32 field_10;
    s32 field_14;
} s_800A992C;

typedef struct
{
    s8  unk_0[8];
    s32 field_8;
} s_800AA894;
STATIC_ASSERT_SIZEOF(s_800AA894, 12);

typedef struct
{
    s8 field_0[44];
} s_800A93CC;

typedef struct
{
    s16 unk_0;
    s16 field_2;
    s8  field_4;
} s_800ACAA8;

typedef struct
{
    s8 unk_0[15];
    s8 field_F;
    u8 field_10;
    s8 field_14[7];
} s_800AD4C8;
STATIC_ASSERT_SIZEOF(s_800AD4C8, 24);

typedef struct
{
    s8  unk_0[2];
    u8  field_2;
    s8  unk_6[4090];
    s32 queueIdx_1000;
} s_800BE9FC;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    s32 field_C;
    s32 field_10;
    s32 field_14;
    s32 field_18;
    s32 field_1C;
    s32 field_20;
    s32 field_24;
    s32 field_28;
    s32 field_2C;
    s32 field_30;
    s32 field_34;
} s_800B5488;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    s32 field_C;
    s32 field_10;
    s32 field_14;
} s_800B55E8;

typedef struct
{
    s32 field_0[16];
} s_800B5C40;

typedef struct
{
    s32 unk_0[2048];
} s_800B5D04;

typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800BCDA8;
STATIC_ASSERT_SIZEOF(s_800BCDA8, 4);

typedef struct
{
    s32*              field_0;
    s8                field_4;
    u8                unk_5[3];
    s32               field_8;
    s32               field_C;
    s32               field_10;
    s8                unk_14[4];
    s32               field_18[837];
    s32               field_D2C;
    u8                unk_D30[2332];
    s32               field_164C;
    u8                unk_1650[1372];
    s32               field_1BAC;
    u8                unk_1BB0[20];
    s32               field_1BC4;
    u8                unk_1BC8[16];
    s32               field_1BD8;
    VC_CAMERA_INTINFO vcCameraInternalInfo_1BDC; // Debug camera info.
    s_800BE9FC        field_1BE4;
    s32               field_2BE8;
} s_800BCE18;
STATIC_ASSERT_SIZEOF(s_800BCE18, 11244); // TODO: Likely even larger. `func_8003CB44` accesses some 16 byte fields at 0x2BEC. `func_8003BE50` also uses it.

typedef struct
{
    s8  unk_0[28];
    s16 field_1C;
    s8  unk_1E[304];
    s32 field_150;
    s32 field_154;
    s32 field_158;
    s8  unk_15A[1068];
    s32 field_588;
    // More may follow.
} s_800C1020;

typedef struct
{
    s8 unk_0[28];
} s_800C117C;
STATIC_ASSERT_SIZEOF(s_800C117C, 28);

typedef struct
{
    u16 field_0;
    u16 field_2;
    u16 field_4;
    u16 field_6;
    s16 field_8;
    s16 field_A;
    s16 field_C;
    u16 field_E;
    union
    {
        s8  field_0[3];
        u16 field_01;
    } field_F;
    s8  field_14;
    u8  field_15;
    s8  field_16;
    s8  field_17;
} s_800C1658;

typedef struct
{
    u8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800C1670;

// Sound data struct?
typedef struct
{
    s16 volumeXa_0; // Might be wrong, but it's used in a `Sd_SetVolBXa` call.
    s16 field_2;
    u16 field_4;
    s16 field_6;
    s16 volumeBgm_8; // Might be wrong, but it's used in a `Sd_SetVolBgm` call.
    s16 field_A;
    s8  field_C;     // (?) volume?
    s8  field_D;     // BGM volume?
    s8  field_E;     // SE volume?
} s_800C1678;

typedef struct
{
    s8  unk_0[4];
    s32 field_4;
    s32 field_8;
} s_800C1688;

typedef struct
{
    s8  unk_0[2];
    u16 field_2;
    u32 field_4;
    s32 field_8;
} s_800C37D4;
// Maybe the same.
typedef struct
{
    u8  field_0;
    s8  unk_1[3];
    u32 field_4;
    s32 field_8;
} s_800C37D8;

typedef struct
{
    s8 field_0;
    s8 field_1;
} s_800C38B0;

typedef struct
{
    s8  unk_0[12];
    s8  field_C;
    s8  field_D;
    s8  field_E;
    s8  unk_F;
    s32 field_10;
    s32 field_14;
    s32 field_18;
    s8  field_1C;
    s8  field_1D;
    s8  field_1E;
    s8  unk_1F;
} s_800C39A8;
STATIC_ASSERT_SIZEOF(s_800C39A8, 32);

typedef struct
{
    s32 unk_0[36];
    s32 field_24;
    s8  unk_2[212];
    s32 field_168;
    s32 field_16C;
    s32 field_170;
    s32 unk_174;
    s16 field_178;
    s16 field_17A;
    s16 field_17C;
    s32 field_180;
    s32 field_184;
    s32 field_188;
} s_800C3BE8;

typedef struct
{
    s8  unk_0[36];
    s32 field_24;
} s_800C3E18;

typedef struct
{
    s8      field_0;
    s8      field_1;
    s8      field_2;
    s8      field_3;
    s32     field_4;
    s32     field_8;
    s8      unk_C[12];
    s32     field_18;
    s8      field_1C;
    s8      field_1D;
    s8      field_1E;
    s32     field_20;
    s8      field_24;
    s8      field_25;
    s8      field_26;
    s8      unk_27;
    s8      field_28;
    s8      field_29;
    s8      field_2A;
    s16     field_2C;
    s16     field_2E;
    s16     field_30;
    s16     field_32;
    s16     field_34;
    s16     field_36;
    s16     field_38;
    s16     field_3A;
    s16     field_3C;
    s32     field_4C;
    s32     field_50;
    s8      unk_54[24];
    VECTOR3 field_60; // Type assumed.
} s_D_800C4168;

typedef struct
{
    s32 field_0;
    s8  unk_4[4];
    s8  field_8;
} s_800C4620;

typedef struct
{
    u8      field_0;
    u8      field_1;
    u8      field_2;
    u8      field_3;
    s8      unk_4[4];
    s16     field_8;
    s16     field_A;
    VECTOR3 field_C;
    s8      unk_18[4];
    s32     field_1C;
    s32     field_20;
} s_800C4818;

typedef struct
{
    s8   unk_0[216];
    void (*routine_D8)();
    s8   unk_DC[8];
    s32  (*routine_E4)(s_SubCharacter* chara0, s_SubCharacter* chara1);
} s_D_800C957C;

typedef struct
{
    VECTOR3 field_0;
    VECTOR3 field_C;
    s8      unk_18[6];
    u8      field_1E;
    u8      field_1F;
} s_func_800CFFF8;

/** Holds file IDs of anim/model/texture for each `e_ShCharacterId`, along with some data used in VC camera code. */
typedef struct
{
    s16   animFileIdx;
    s16   modelFileIdx;
    s16   textureFileIdx;
    s16   field_6;
    void* field_8;
    u16   field_C_0 : 2;
    s32   field_C_2 : 14;
    u16   unk_C_16  : 16;
} s_CharaFileInfo;
STATIC_ASSERT_SIZEOF(s_CharaFileInfo, 16);

// Contains animation data? Size is rather small, so if it does, it would be indices to
// larger arrays containing actual data.
typedef struct
{
    s8  unk_0[12];
    s16 field_C;
    s8  unk_10[2];
} s_MaybeCharacterAnim;

// Maybe a collection of matrices.
typedef struct
{
    s32 flags_0;
    s8  unk_4[12];
    s8  field_10;
    s8  unk_11[7];
} s_Bone;
STATIC_ASSERT_SIZEOF(s_Bone, 24);

// PROBABLY skeleton data.
typedef struct
{
    u8      boneCount_0;
    u8      boneIdx_1; // Current bone index? Used in traversal.
    s8      field_2;
    s8      field_3;
    s32     field_4;
    s_Bone* bones_8;

    // Maybe incorrect.
    s8      unk_C[3];
    u8      field_10; // Some count related to bone hierarchy.
    s8      unk_11;
    s8      field_12;
    s8      field_13;
    s8      field_14;
    s8      unk_15[8];
} s_Skeleton;
STATIC_ASSERT_SIZEOF(s_Skeleton, 28);

typedef struct
{
    SVECTOR3 posTarget_0;
    SVECTOR3 lookAtTarget_6;
    s16      field_C[2]; // `field_C[1]` gets passed to `vcChangeProjectionValue`.
} s_DmsKeyframeCamera;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCamera, 16);

typedef struct
{
    SVECTOR3 position_0;
    SVECTOR3 rotation_6;
} s_DmsKeyframeCharacter;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCharacter, 12);

typedef struct
{
    s16       keyframeCount_0;
    u8        svectorCount_2;
    u8        field_3;        // Usually 0, but sometimes filled in, possibly junk data left in padding byte.
    char      name_4[4];      // First 4 chars of name. E.g. Code checks for "DAHLIA", file is "DAHL".
    SVECTOR3* svectorPtr_8;   // Pointer to `SVECTOR3`s. Unknown purpose.
    union
    {
        s_DmsKeyframeCharacter* character;
        s_DmsKeyframeCamera*    camera;
    } keyframes_C;
} s_DmsEntry;
STATIC_ASSERT_SIZEOF(s_DmsEntry, 16);

typedef struct
{
    s16 start;
    s16 duration;
} s_DmsInterval;
STATIC_ASSERT_SIZEOF(s_DmsInterval, 4);

typedef struct
{
    u8             isLoaded_0;
    u8             characterCount_1;
    u8             intervalCount_2;
    u8             field_3; // Usually 0, but sometimes filled in.
    u32            field_4; // Unknown, correlates with DMS file size.
    s_DmsInterval* intervalPtr_8;
    VECTOR3        origin_C; // Origin point, gets added to character positions.
    s_DmsEntry*    characters_18;
    s_DmsEntry     camera_1C;
} s_DmsHeader;
STATIC_ASSERT_SIZEOF(s_DmsHeader, 44);

/** @brief Returned by `func_800699F8`, collision related? */
typedef struct _s_func_800699F8
{
    s32 chara_grnd_0;
    s16 field_4;
    s16 field_6;
    s8  field_8;
    u8  unk_9[3];
} s_func_800699F8;
STATIC_ASSERT_SIZEOF(s_func_800699F8, 12);

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    s32 field_C;
    s16 field_10;
    s16 field_12;
    s8  field_14;
    s8  unk_15[3];
    s32 field_18;
} s_func_8006A178;

/** @brief Used for normal credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E24, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E434C`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
} s_800AFE08;
STATIC_ASSERT_SIZEOF(s_800AFE08, 28);

/** @brief Used for UFO ending credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E40, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E4BD4`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
    s32  field_1C;
    s16  field_20;
    s16  field_22;
    s32  field_24;
    s32  field_28;
    s32  field_2C;
    s32  field_30;
    s32  field_34;
    s32  field_38;
    s32  field_3C;
    s32  field_40;
    s32  field_44;
    s32  field_48;
    s32  field_4C;
    s32  field_50;
    s32  field_54;
} s_800AFE24; // Size: 85

/** Part of map headers, pointer passed to `Chara_PositionUpdateFromParams`. */
typedef struct _AreaLoadParams
{
    s32 char_x_0;
    u32 mapIdx_4_0     : 5;
    u32 field_4_5      : 4;
    u32 field_4_9      : 3;
    u32 field_4_12     : 4;
    u32 rotationY_4_16 : 8;
    u32 field_4_24     : 8;
    s32 char_z_8;
} s_AreaLoadParams;

/** @brief Initial demo game state data, stored inside MISC/DEMOXXXX.DAT files. */
typedef struct _DemoWork
{
    s_ShSaveUserConfig config_0;
    u8                 unk_38[200];
    s_ShSavegame       savegame_100;
    u8                 unk_37C[1148];
    u32                frameCount_7F8;
    u16                randSeed_7FC;
} s_DemoWork;
STATIC_ASSERT_SIZEOF(s_DemoWork, 2048);

/** @brief Per-frame demo data, stored inside MISC/PLAYXXXX.DAT files. */
typedef struct _DemoFrameData
{
    s_AnalogController analogController_0;
    s8              gameStateExpected_8; /** Expected value of `g_GameWork.gameState_594` before `analogController_0` is processed, if it doesn't match `Demo_Update` will display `STEP ERROR` and stop reading demo. */
    u8              videoPresentInterval_9;
    u8              unk_A[2];
    u32             randSeed_C;
} s_DemoFrameData;
STATIC_ASSERT_SIZEOF(s_DemoFrameData, 16);

/** @brief Associates a demo number/ID with PLAYXXXX.DAT/DEMOXXXX.DAT file IDs. */
typedef struct _DemoFileInfo
{
    s16 demoFileId_0;       /** MISC/DEMOXXXX.DAT, initial gamestate for the demo and user config override. */
    s16 playFileId_2;       /** MISC/PLAYXXXX.DAT, data of button presses/randseed for each frame. */
    s32 (*canPlayDemo_4)(); /** Optional funcptr, returns whether this demo is eligible to be played (unused in retail demos). */
} s_DemoFileInfo;
STATIC_ASSERT_SIZEOF(s_DemoFileInfo, 8);

#define DEMO_FILE_COUNT_MAX 5
extern s_DemoFileInfo g_Demo_FileIds[DEMO_FILE_COUNT_MAX]; // 0x800AFDC4
/* TODO: data migration
s_DemoFileInfo g_Demo_FileIds[DEMO_FILE_COUNT_MAX] = {
    { FILE_MISC_DEMO0009_DAT, FILE_MISC_PLAY0009_DAT, NULL },
    { FILE_MISC_DEMO000A_DAT, FILE_MISC_PLAY000A_DAT, NULL },
    { FILE_MISC_DEMO0003_DAT, FILE_MISC_PLAY0003_DAT, NULL },
    { FILE_MISC_DEMO000B_DAT, FILE_MISC_PLAY000B_DAT, NULL },
    { FILE_MISC_DEMO0005_DAT, FILE_MISC_PLAY0005_DAT, NULL },
};
*/

typedef struct _SpawnInfo
{
    q19_12 positionX_0;
    s8     charaId_4;   /** `e_ShCharacterId` */
    u8     rotationY_5; /** Multiplied by 16 to get `s_SubCharacter.rotation_24.vy` value. */
    s8     flags_6;     /** Copied to `stateStep_3` in `s_Model`, with `state_2 = 0`. */
    s8     unk_7;
    q19_12 positionZ_8;
} s_SpawnInfo;
STATIC_ASSERT_SIZEOF(s_SpawnInfo, 12);

typedef struct _800B5494
{
    s32 field_0;
    s32 unk_4[9];
} s_800B5494;
STATIC_ASSERT_SIZEOF(s_800B5494, 40);

extern s_800B5494 D_800B5494;

/** TODO: `g_MapOverlayHeader` is part of the overlay bin files. Maybe should be moved to `maps/shared.h` or `dynamic/dynamic.h`. */
typedef struct _MapOverlayHeader
{
    s8                unk_0[4];
    s8                (*getMapRoomIdxFunc_4)(s32 x, s32 y);                              // Called by `func_80036420`.
    s8                field_8;
    s8                unk_9[3];
    s8                unk_C[4];
    s32               (*func_10)();
    s8                field_14;
    s8                unk_15[3];
    s8                unk_18[4];
    s_AreaLoadParams* mapAreaLoadParams_1C;
    void              (**mapEventFuncs_20)();                                            /** Points to array of event functions. */
    s8                unk_24[12];
    char**            mapMessageStrings_30;                                              /** Points to array of `char*` for each displayed message in the map. */
    s_AnimInfo*       animInfo_34;
    s8                unk_38[8];
    void              (*func_40)();
    void              (*func_44)();
    s8                unk_48[4];
    s_func_800625F4*  field_4C;
    s8                unk_50[16];
    s8                unk_60[104];
    void              (*func_C8)();
    void              (*func_CC)(s32);
    s32               (*func_D0)(s32, void*, s16, s32); // 0x800C964C
    s8                unk_D4[24];
    s32               (*func_EC)();
    s8                unk_F0[76];
    s32               (*func_13C)(s32, s32, void*, s16, s32); // 0x800C96B8
    s8                unk_140[40];
    void              (*func_168)(void*, void*, void*);
    s8                unk_16C[4];
    s8                unk_170[36];
    void              (*charaUpdateFuncs_194[Chara_Count])(s_SubCharacter*, void*, s32); /** Guessed params. Funcptrs for each `e_ShCharacterId`, set to 0 for IDs not included in the map overlay. Called by `func_80038354`. */
    u8                charaGroupIds_248[4];                                              /** `e_ShCharacterId` values where if `s_SpawnInfo.charaId_4` == 0, `charaGroupIds_248[0]` is used for `charaSpawnsA_24C` and `charaGroupIds_248[1]` for `charaSpawnsB_30C`. */
    s_SpawnInfo       charaSpawnsA_24C[16];                                              /** Array of chara type/position/flags, flags_6 == 0 are unused slots? Read by `func_80037F24`. */
    s_SpawnInfo       charaSpawnsB_30C[16];                                              /** Array of chara type/position/flags, flags_6 == 0 are unused slots? Read by `func_80037F24`. */
    VC_ROAD_DATA      roadDataList_3CC[48];
    // TODO: A lot more in here.
} s_MapOverlayHeader;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader, 2124); // Size incomplete.

extern s_FsImageDesc g_MainImg0; // 0x80022C74 - TODO: part of main exe, move to main/ headers?

extern s_80024C90 D_80024C90; 

extern s32 D_8002500C; // Some sort of struct inside RODATA, likely a constant.

extern s8* D_8002510C;

/** "\x07PAUSED" string */
extern char D_80025394[];

extern s32 D_80025528; // Type assumed.

extern s32 D_80025530; // Type assumed.

extern u8 D_80025D6C[];

extern u32 D_80025DC0[];

extern RECT D_80028A20;

extern RECT D_8002AB10;

extern RECT D_8002ABA4;

extern s_8002AC04 D_8002AC04[];

extern s_800BE9FC D_8002B2CC;

extern u8 D_800A8E58;

extern s_FsImageDesc D_800A8FF4;

extern s_FsImageDesc D_800A8FFC;

extern s_FsImageDesc D_800A9004;

extern s_FsImageDesc D_800A9014;

extern s_FsImageDesc D_800A901C;

extern s_FsImageDesc D_800A9024;

/** Save screen background image. */
extern s_FsImageDesc D_800A902C;

extern s_FsImageDesc D_800A9034;

extern s_FsImageDesc D_800A903C;

