#ifndef _BODYPROG_H
#define _BODYPROG_H

#include "game.h"
#include "bodyprog/sound_effects.h"
#include "bodyprog/view/vw_system.h"
#include "main/fsqueue.h"

/** @brief This header is used to declare any variable, struct, or
 * function of `BODYPROG.BIN` that has not been identified to
 * be related to a currently recognized and separated section of
 * the engine (like player logic, save game, or item screens).
 */

// ==========
// CONSTANTS
// ==========

#define WORLD_OBJECT_COUNT_MAX 29

#define OPT_SOUND_VOLUME_MIN   0
#define OPT_SOUND_VOLUME_MAX   128
#define OPT_VIBRATION_DISABLED 0
#define OPT_VIBRATION_ENABLED  128

#define IPD_HEADER_MAGIC 20
#define LM_HEADER_MAGIC  '0'
#define LM_VERSION       6

#define CHARA_FORCE_FREE_ALL 0xFF /** `Chara_Load` can force free already loaded models to make room for new ones. */

// ==============
// HELPER MACROS
// ==============

/** @brief Compares 8-character filenames using `u32`. Similar to `strcmp`.
 *
 * @param a First filename.
 * @param b Second filename.
 * @return `true` if the filenames aren't equal, `false` otherwise.
 */
#define COMPARE_FILENAMES(a, b)                                  \
    (((u_Filename*)(a))->u32[0] != ((u_Filename*)(b))->u32[0] || \
     ((u_Filename*)(a))->u32[1] != ((u_Filename*)(b))->u32[1])

// ======
// ENUMS
// ======

/** @brief Background music flags. */
typedef enum _BgmFlags
{
    BgmFlag_Unk0 = 1 << 0,
    BgmFlag_Unk1 = 1 << 1,
    BgmFlag_Unk2 = 1 << 2,
    BgmFlag_Unk3 = 1 << 3,

    MapFlag_Unk3             = 1 << 3  /** @unused Unused map type `XXX` has this flag. */
} e_MapFlags;

/** @brief Used as index into `MAP_INFOS` array.
 * TODO: Add descriptions for which areas are included in each type?
*/
typedef enum _MapType
{
    MapType_THR = 0,
    MapType_SC  = 1,
    MapType_SU  = 2,
    MapType_SPR = 3,
    MapType_SPU = 4,
    MapType_RSR = 5,
    MapType_RSU = 6,
    MapType_APR = 7, /** @unused */
    MapType_APU = 8,
    MapType_ER  = 9,
    MapType_ER2 = 10,
    MapType_DR  = 11,
    MapType_DRU = 12,
    MapType_HP  = 13,
    MapType_HU  = 14,
    MapType_XXX = 15, /** @unused */

    MapType_Count
} e_MapType;

typedef enum _BoneHierarchy
{
    BoneHierarchy_MultiModel = -3,
    BoneHierarchy_End        = -2
} e_BoneHierarchy;

typedef enum _EffectTextureFlags
{
    EffectTextureFlag_None         = 0,
    EffectTextureFlag_Glass        = 1 << 1, /** Broken glass in the cafe Air Screamer cutscene. */
    EffectTextureFlag_WaterRefract = 1 << 2, /** Water waves and light reflection in the sewer. */
    EffectTextureFlag_Water        = 1 << 3,
    EffectTextureFlag_Fire         = 1 << 4,
    EffectTextureFlag_Ef           = 1 << 5, // TODO: Rename. Looks like stringy flesh?
    EffectTextureFlag_Blood        = 1 << 6,
    EffectTextureFlag_WarmTest     = 1 << 7  /** @unused Test lens flare? */
} e_EffectTextureFlags;

typedef enum _SpeedZoneType
{
    SpeedZoneType_Slow   = 0,
    SpeedZoneType_Normal = 1,
    SpeedZoneType_Fast   = 2
} e_SpeedZoneType;

typedef enum _MainMenuEntry
{
    MainMenuEntry_Load     = 0,
    MainMenuEntry_Continue = 1,
    MainMenuEntry_Start    = 2,
    MainMenuEntry_Option   = 3,
    MainMenuEntry_Extra    = 4, /** @unused The extra options menu may have been accessible via the main menu. */

    MainMenuEntry_Count    = 5
} e_MainMenuEntry;

typedef enum _MainMenuState
{
    MenuState_Start              = 0,
    MenuState_Main               = 1,
    MenuState_LoadGame           = 2,
    MenuState_DifficultySelector = 3,
    MenuState_NewGameStart       = 4
} e_MainMenuState;

/** Used by `func_8003F654` to cast a specific field to the desired type. */
typedef enum _PrimitiveType
{
    PrimitiveType_None = 0,
    PrimitiveType_S8   = 1,
    PrimitiveType_U8   = 2,
    PrimitiveType_S16  = 3,
    PrimitiveType_U16  = 4,
    PrimitiveType_S32  = 5
} e_PrimitiveType;

typedef enum _LoadingScreenId
{
    LoadingScreenId_None              = 0,
    LoadingScreenId_PlayerRun         = 1,
    LoadingScreenId_BackgroundTexture = 2,
    LoadingScreenId_StageString       = 3
} e_LoadingScreenId;

typedef enum _StaticModelLoadState
{
    StaticModelLoadState_Invalid   = 0,
    StaticModelLoadState_Unloaded  = 1,
    StaticModelLoadState_Corrupted = 2, // Maybe wrong name for this.
    StaticModelLoadState_Loaded    = 3
} e_StaticModelLoadState;

// ================
// UNKNOWN STRUCTS
// ================

/* Structs called by functions that haven't been identified. */

/** SFX pair used for area loading (e.g. door opening and closing). */
typedef struct
{
    u16 sfx_0;
    u16 sfx_2;
} s_AreaLoadSfx;

// Exception, as one of the unidentified structs uses this.
typedef struct _s_8002AC04
{
    struct _s_8002AC04* field_0;

    union
    {
        u8 funcIdx_4; // `funcIdx_4` in structs below, needs to be part of those structs for match.

        struct
        {
            u8  funcIdx_4;
            u8  field_5;
            u16 field_6;
            s32 field_8;
            u32 field_C;
        } func_8008973C_data;
        struct
        {
            u8  funcIdx_4;
            u8  field_5;
            u16 field_6;
            s32 field_8;
            u32 field_C;
        } func_80089D0C_data;

        struct
        {
            u8                  funcIdx_4;
            u8                  field_5   : 7;
            u32                 field_5_7 : 1;
            u16                 field_6;
            struct _s_8002AC04* field_8;
            u32                 field_C;
        } func_80089BB8_data;

        struct
        {
            u8  funcIdx_4;
            u8  field_5;
            u16 field_6;
            u8* field_8;
            u32 field_C_0  : 16;
            u32 field_C_16 : 12;
            u32 field_C_28 : 3;
            u32 field_C_31 : 1;
        } func_80089DF0_data;
        struct
        {
            u8  funcIdx_4;
            u8  field_5_0 : 5;
            u32 field_5_5 : 1;
            u32 field_5_6 : 1;
            u32 field_5_7 : 1;
            u16 field_6;
            s32 field_8;
            u32 field_C;
        } func_80089A30_data;
    } field_4;
} s_8002AC04;
STATIC_ASSERT_SIZEOF(s_8002AC04, 16);

typedef struct
{
    s32               id_0;
    s32               flags_4;
    s32               modelCount_8;
    struct TMD_STRUCT models_c[1];
} s_TmdFile;

typedef struct
{
    u8  unk_0;
    u8  field_1;
    u8  unk_2[18];
    s32 field_14;
} s_800C45C8;

typedef struct
{
    char pad[12];
} s_func_8005B424;

// Something related to enemies attacks.
typedef struct
{
    union
    {
        s32 vx_0; // Q23.8 } Displacement offset. `func_80062708` indicates Q12?
        struct
        {
            s16 field_0;
            s16 field_2;
        } s_0;
        struct
        {
            u16 field_0;
            u16 field_2;
        } s_1;
    } field_0;
    union
    {
        s32 vz_4; // Q23.8 } `func_80062708` indicates Q12?
        struct
        {
            s16 field_0;
            s16 field_2;
        } s_0;
    } field_4;
    s16 vy_8; // Q7.8
    u8  field_A;
    u8  field_B; // Flags?
    union
    {
        s32 field_0;
        struct
        {
            q3_12 field_0; // Angle.
            q3_12 field_2; // Angle.
        } s_0;
        struct
        {
            u8 field_0;
            u8 field_1;
            u8 field_2;
            u8 field_3;
        } s_1;
        struct
        {
            u16 field_0;
            u16 field_2;
        } s_2;
    } field_C;
    union
    {
        q20_12 field_0;
        struct
        {
            s16 field_0;
            s16 field_2;
        } s_0;
        struct
        {
            s16 field_0;
            u8  field_2;
            u8  field_3;
        } s_1;
        struct
        {
            u8 field_0;
            u8 field_1;
            u8 field_2;
            u8 field_3;
        } s_2;
        struct
        {
            u16 field_0;
            u16 field_2;
        } s_3;
    } field_10;
} s_MapHdr_field_4C;
STATIC_ASSERT_SIZEOF(s_MapHdr_field_4C, 20);

typedef struct _Collision
{
    q19_12 groundHeight_0;
    q3_12  field_4;  // } Angles??
    q3_12  field_6;  // }
    s8     field_8;  // Count of something, maybe valid ground at probed points around center? Set to 0, 7, or 12.
    // 3 bytes of padding.
} s_Collision;
STATIC_ASSERT_SIZEOF(s_Collision, 12);

typedef struct
{
    VECTOR3  position_0; // Q19.12
    SVECTOR3 rotation_C; // Q3.12
    s8       field_12;
} s_func_8006AB50;

typedef struct
{
    s32        field_0;
    s32        field_4; // `bool`?
    s32        field_8; // 2D distance.
    SVECTOR    field_C; // Q23.8 | Position.
    DVECTOR_XZ direction_14;
    q23_8      positionX_18;
    q23_8      positionZ_1C;
    s32        field_20;
    s32        field_24;
    s16        field_28; // } `SVECTOR3`, packed rotation? Probably not.
    s16        field_2A; // }
    s16        field_2C; // }
} s_func_8006ABC0;

typedef struct
{
    u8  unk_0[2];
    s16 field_2;
    u8  unk_4[2];
    s16 field_6;
} s_func_8006CA18;

typedef struct
{
    u8  field_0;
    u8  field_1;
    s16 field_2;
    s32 field_4;
} s_func_8006CC44_A8;

typedef struct
{
    s8      field_0;
    s8      unk_1;
    DVECTOR field_2; // Q3.12 | XY rotation.
} s_func_8006CC44_44_0;

typedef struct
{
    s_func_8006CC44_44_0 field_0;
    s16                  field_6;
    s_func_8006CC44_44_0 field_8;
    s16                  field_E;
    s8*                  field_10[8];
    s_func_8006CC44_44_0 field_30;
    s16                  field_36;
} s_func_8006CC44_44;

typedef struct
{
    q23_8 field_0; // X position.                } Q8 according to `func_8006EE0C`?
    q23_8 field_4; // Y position.                }
    q7_8  field_8; // Z position, but why `s16`? }
    q7_8  field_A; // Y??
    q7_8  field_C; // Some kind of bound or threshold?
    s16   field_E;
} s_RayState_6C; // Unknown size;

typedef struct
{
    s16 field_0;
    s16 field_2;
} s_RayState_8C;

/** @brief State for an in-progress ray trace. Contains pointers to active characters among other things. */
typedef struct
{
    s32              field_0;
    s16              field_4;
    s16              field_6;
    q7_8             field_8; // Distance X?
    s8               unk_A[2];
    q23_8            field_C;  // } Q23.8 `VECTOR3`
    q23_8            field_10; // }
    q23_8            field_14; // }
    s8               unk_18[4];
    q7_8             field_1C; // Distance Z?
    s8               unk_1E[2];
    s_SubCharacter*  field_20;
    s16              field_24; // X } Q19.12
    s16              field_26; // Z }
    s32              field_28;
    VECTOR3          field_2C; // Q23.8
    s8               unk_38[4];
    s32              field_3C; // X  } Q23.8 `VECTOR3`?
    s32              field_40; // Y? }
    s32              field_44; // Z  }
    s8               unk_48[4];
    q7_8             field_4C; // X?
    q7_8             field_4E; // Z?
    SVECTOR          field_50; // Q23.8
    u16              field_58;
    s16              field_5A;
    s16              field_5C;
    s16              field_5E;
    s16              field_60;
    s8               unk_62[2];
    s_SubCharacter** characters_64; // Active characters?
    s32              characterCount_68;
    s_RayState_6C    field_6C;
    s32              field_7C;
    s32              field_80;
    u16              field_84;
    u8               unk_86[2];
    s32              field_88;
    s_RayState_8C    field_8C[1]; // Unknown size.
} s_RayState;

// Function from lib_unk
typedef struct _func_8009ECCC
{
    struct _func_8009ECCC* field_0; // TODO: Not sure if these point to other struct type or same type.
    struct _func_8009ECCC* field_4;
    s32                    field_8;
    s32                    field_C;
    s_8002AC04*            field_10;
    u32                    field_14_0  : 16;
    u32                    field_14_16 : 8;
    u32                    field_14_24 : 7;
    u32                    field_14_31 : 1;
    u32                    field_18;
    u16                    field_1C;
    u16                    field_1E;
} s_func_8009ECCC;

typedef struct
{
    q19_12 field_0; // X position.
    q19_12 field_4; // Z position.
    s32    field_8;
    s32    field_C;
    q19_12 field_10; // X
    q19_12 field_14; // Z
    s32    field_18; // X } Bounds?
    s32    field_1C; // X }
    s32    field_20; // Z }
    s32    field_24; // Z }
    q19_12 field_28; // } Maybe XZ position.
    q19_12 field_2C; // }
} s_func_8006F338;

typedef struct
{
    s16 field_0;
    s16 field_2;
} s_func_8006E490_20;

typedef struct
{
    s8                 unk_0[8];
    DVECTOR            field_8;
    s16                field_C;
    s16                field_E;
    s32                field_10; // } X
    s32                field_14; // } Z?
    s16                field_18;
    s8                 unk_1A[2];
    s32                field_1C; // Index into `field_20`.
    s_func_8006E490_20 field_20[2];
} s_func_8006E490;

/** @brief Animation keyframe? Doesn't hold bone data, but something gameplay-related
 * which is derived from here.
 */
typedef struct _Keyframe
{
    q3_12 field_0;
    q3_12 field_2;
    q3_12 field_4;
    q3_12 field_6;
    q3_12 field_8;
    q3_12 field_A;
    q3_12 field_C;
    q3_12 field_E;
    q3_12 field_10; // X offset?
    q3_12 field_12; // Z offset?
} s_Keyframe;

// ========
// STRUCTS
// ========

typedef struct _Normal
{
    s8 nx;
    s8 ny;
    s8 nz;
    u8 count;
} s_Normal;
STATIC_ASSERT_SIZEOF(s_Normal, 4);

/** @brief 8-character string usually used for filenames. Can be compared via the `u32` field. */
typedef union _Filename
{
    char str[8];
    u32  u32[2];
} u_Filename;

/** @brief Struct used by many functions involved with GTE. Kept at `PSX_SCRATCH_ADDR` (possibly only temporarily). */
typedef struct _GteScratchData
{
    DVECTOR screenXy_0[90];
    u16     screenZ_168[18];

    s16 field_18C[99]; // The size changed from 150 due to the addition of `field_252`. Not sure if this is correct.
    u8  field_252[102];

    u8      field_2B8[200]; // Size likely incorrect.

    union
    {
        MATRIX field_0;
        struct
        {
            s32     field_0;
            s32     field_4;
            CVECTOR field_8;
            CVECTOR field_C;
            u8      field_10;
            u8      field_11;
            u8      field_12;
            u8      field_13;
            u8      field_14;
            u8      field_15;
            u8      field_16;
            u8      field_17;
            s32     field_18;
            s32     field_1C;
        } s_0;
    } field_380;

    s_Normal field_3A0;

    DVECTOR  screenPos_3A4;
    s32      depthP_3A8;
    SVECTOR  field_3AC;
    u8       unk_3B4[36];
    CVECTOR  field_3D8; // Written by `func_8005A42C`.
    DVECTOR  screenPos_3DC;
    s32      depthP_3E0;
    MATRIX   field_3E4;
} s_GteScratchData;

typedef struct _Primitive
{
    u16 field_0;
    u16 field_2;
    u16 field_4;
    union
    {
        struct
        {
            u8 field_6_0  : 8;
            s8 field_6_8  : 7;
            u8 field_6_15 : 1; // `bool`
        } bits;

        u16 flags; // @hack `func_8005AC50` accesses `field_6_15` above with some weird shifts, haven't found how to make it work with bitfield yet.
    } field_6;
    u16 field_8;
    u16 field_A;
    u8  field_C[4];  // } Unknown type. `func_8005AC50` reads these as `s32`, but that breaks other funcs which use this struct. `s32` reads might have just been `memcpy`?
    u8  field_10[4]; // }
} s_Primitive;
STATIC_ASSERT_SIZEOF(s_Primitive, 20);

typedef struct _MeshHeader
{
    u8 primitiveCount_0;
    u8 vertexCount_1;
    u8 normalCount_2;
    u8 unkCount_3;

    s_Primitive* primitives_4;
    DVECTOR*     verticesXy_8;
    s16*         verticesZ_C;
    s_Normal*    normals_10;
    u8*          unkPtr_14;
} s_MeshHeader;
STATIC_ASSERT_SIZEOF(s_MeshHeader, 24);

typedef struct _ModelHeader
{
    u_Filename    name_0;
    u8            meshCount_8;
    u8            vertexOffset_9;
    u8            normalOffset_A;
    u8            field_B_0 : 1;
    u8            field_B_1 : 3; // Value used in `func_800571D0` switch.
    u8            field_B_4 : 2;
    u8            unk_B_6   : 2;
    s_MeshHeader* meshHdrs_C;
} s_ModelHeader;
STATIC_ASSERT_SIZEOF(s_ModelHeader, 16);

typedef struct _Texture
{
    s_FsImageDesc imageDesc_0;
    u_Filename    name_8;
    u32           queueIdx_10;
    s8            refCount_14;
} s_Texture;

typedef struct _Material
{
    u_Filename name_0;
    s_Texture* texture_8;
    u8         field_C;
    u8         unk_D[1];
    u8         field_E;
    u8         field_F;
    u16        field_10;
    u16        field_12;
    union
    {
        u8  u8[2];
        u16 u16;
    } field_14;
    union
    {
        u8  u8[2];
        u16 u16;
    } field_16;
} s_Material;
STATIC_ASSERT_SIZEOF(s_Material, 24);

typedef struct _LmHeader
{
    u8             magic_0;    /** See `LM_HEADER_MAGIC`. */
    u8             version_1;  /** See `LM_VERSION`. */
    u8             isLoaded_2; /** `bool` */
    u8             materialCount_3;
    s_Material*    materials_4;
    u8             modelCount_8;
    u8             unk_9[3];
    s_ModelHeader* modelHdrs_C;
    u8*            modelOrder_10;
} s_LmHeader;

typedef struct _IpdCollisionData_10
{
    s16 field_0;
    s16 field_2;
    s16 field_4;
    u16 field_6_0  : 5; // TODO: Might be using `s_IpdCollisionData_18` substruct here? Won't fit though.
    u16 field_6_5  : 3;
    u16 field_6_8  : 3;
    u16 field_6_11 : 4;
    u16 field_6_15 : 1;
    s16 field_8;
    s16 field_A;
} s_IpdCollisionData_10;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_10, 12);

typedef struct
{
    s16 field_0_0  : 14;
    u16 field_0_14 : 2;
    s16 field_2_0  : 14;
    u16 field_2_14 : 2;
    s16 field_4;
    u8  field_6;
    u8  field_7;
    u8  field_8;
    u8  field_9;
} s_IpdCollisionData_14;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_14, 10);

typedef struct
{
    s16 field_0;
    s8  unk_2[2];
} s_IpdCollisionData_20;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_20, 4);

typedef struct _IpdCollisionData_18
{
    u16      field_0_0  : 5;
    u16      field_0_5  : 3;
    u16      field_0_8  : 4;
    u16      field_0_12 : 3;
    u16      field_0_15 : 1;
    SVECTOR3 vec_2;
    s16      field_8;
} s_IpdCollisionData_18;
STATIC_ASSERT_SIZEOF(s_IpdCollisionData_18, 10);

typedef struct _IpdCollisionData
{
    s32                    positionX_0;
    s32                    positionZ_4;
    u32                    field_8_0  : 8;
    u32                    field_8_8  : 8;
    u32                    field_8_16 : 8;
    u32                    field_8_24 : 8;
    SVECTOR3*              ptr_C;
    s_IpdCollisionData_10* ptr_10;
    s_IpdCollisionData_14* ptr_14;
    s_IpdCollisionData_18* ptr_18;
    s16                    field_1C;
    u8                     field_1E; // } Used as multipliers for `field_1C` in `func_8006B004`.
    u8                     field_1F; // }
    s_IpdCollisionData_20* ptr_20;
    u16                    field_24; // `field_24/``field_26` defined in ipd2obj but haven't seen used yet, might be size of `ptr_28`/`ptr_2C`.
    u16                    field_26;
    u8*                    ptr_28; // Accessed as array of indices into `field_34` by `func_8006E53C`.
    void*                  ptr_2C;
    u8                     field_30;
    u8                     unk_31[3];
    u8                     field_34[256];
} s_IpdCollisionData;

typedef struct _IpdModelBuffer_C
{
    s_ModelHeader* modelHdr_0;
    MATRIX         field_4;
} s_IpdModelBuffer_C;
STATIC_ASSERT_SIZEOF(s_IpdModelBuffer_C, 36);

typedef struct _IpdModelBuffer
{
    u8                  field_0; // Count of `field_C` entries.
    u8                  field_1;
    u8                  field_2;
    s8                  unk_3;
    s16                 field_4;
    s16                 field_6;
    s16                 field_8;
    s16                 field_A;
    s_IpdModelBuffer_C* field_C;
    SVECTOR*            field_10; // Pointer to unknown collision data, type assumed.
    SVECTOR*            field_14; // Pointer to unknown collision data, type assumed.
} s_IpdModelBuffer;
STATIC_ASSERT_SIZEOF(s_IpdModelBuffer, 24);

typedef struct _IpdModelInfo
{
    u8             isGlobalPlm_0; // `false` if loaded from inside `IPD`, `true` if loaded from `*_GLB.PLM`.
    u8             unk_1[3];
    u_Filename     modelName_4;
    s_ModelHeader* modelHdr_C;
} s_IpdModelInfo;
STATIC_ASSERT_SIZEOF(s_IpdModelInfo, 16);

typedef struct _IpdHeader
{
    u8                 magic_0;
    u8                 isLoaded_1; /** `bool` */
    s8                 cellX_2;
    s8                 cellZ_3;
    s_LmHeader*        lmHdr_4;
    u8                 modelCount_8;
    u8                 modelBufferCount_9;
    u8                 modelOrderCount_A;
    u8                 unk_B[1];
    u8                 unk_C[8];
    s_IpdModelInfo*    modelInfo_14;
    s_IpdModelBuffer*  modelBuffers_18;
    u8                 textureCount_1C; // Should it be `u32`?
                                        // "`u8` - Relative pointer to textures list"
                                        // "`u32` - Relative pointer to object order"
    u8                 unk_1D[3];
    u8                 unk_20[48];
    u8*                modelOrderList_50;
    s_IpdCollisionData collisionData_54;
} s_IpdHeader;

// See: https://github.com/laura-a-n-n/silent-hill-museum/blob/main/ksy/sh1anm.ksy
typedef struct _AnmBindPose
{
    s8 parentBone;
    s8 rotationDataIdx_1;
    s8 translationDataIdx_2;
    s8 translationInitial_3[3];
} s_AnmBindPose;
STATIC_ASSERT_SIZEOF(s_AnmBindPose, 6);

typedef struct _AnmHeader
{
    u16           dataOffset_0;
    u8            rotationBoneCount_2;
    u8            translationBoneCount_3;
    u16           keyframeDataSize_4; // Size per keyframe, `(rotationBoneCount_2 * 9) + (translationBoneCount_3 * 3)`?
    u8            boneCount_6;
    u8            unk_7;
    u32           activeBones_8; // Holds bit field of bones to update.
    u32           fileSize_C;
    u16           keyframeCount_10;
    u8            scaleLog2_12;
    u8            rootYOffset_13;
    s_AnmBindPose bindPoses_14[0]; // Array size = `boneCount_6`.
} s_AnmHeader;
STATIC_ASSERT_SIZEOF(s_AnmHeader, 20);

typedef union
{
    s16 field_0;
    struct
    {
        u8 field_0;
        u8 field_1;
    } s_field_0;
} s_func_8006CC44_CC_C;

typedef struct
{
    DVECTOR_XZ field_0;
    DVECTOR_XZ field_4;
    u32        field_8;
    s32        field_C;
    s16        field_10;
    u8         unk_12[2];
    DVECTOR_XZ field_14;
} s_func_8006CC44_CC_20;

typedef struct
{
    s_IpdCollisionData*   ipdCollisionData_0;
    u8                    field_4; // Index.
    u8                    field_5;
    SVECTOR3              field_6;
    s_func_8006CC44_CC_C  field_C;
    u8                    field_E;
    u8                    field_F;
    u8                    field_10;
    u8                    field_11;
    SVECTOR3              field_12;
    SVECTOR3              field_18;
    s8                    unk_1E[2];
    s_func_8006CC44_CC_20 field_20;
} s_func_8006CC44_CC;
STATIC_ASSERT_SIZEOF(s_func_8006CC44_CC, 56);

typedef struct
{
    u8                 field_0_0  : 8;
    s8                 field_0_8  : 1;
    s8                 field_0_9  : 1;
    s8                 field_0_10 : 1;
    s8                 field_0_11 : 5;
    u16                field_2    : 16;
    s_func_8006ABC0    field_4;
    s32                field_34;
    s16                field_38;
    s16                field_3A;
    s16                field_3C; // X?
    s16                field_3E; // Z?
    s8*                field_40;
    s_func_8006CC44_44 field_44;
    s32                field_7C;
    s32                field_80; // X
    s32                field_84; // Z
    s32                field_88; // X
    s32                field_8C; // Z
    s32                field_90; // `bool`?
    s32                field_94;
    union
    {
        DVECTOR_XZ vec_0;
        s32        field_0;
    } field_98;
    union
    {
        DVECTOR_XZ vec_0;
        s32        field_0;
    } field_9C;
    union
    {
        struct
        {
            u8                 field_0; // Start index for something.
            u8                 field_1;
            u8                 field_2;
            u8                 field_3;
            s_func_8006CA18*   field_4;
            s_func_8006CC44_A8 field_8[4];
        } s_0;
        struct
        {
            q7_8 field_0;
            q7_8 field_2;
            s16  field_4;
            u8   field_6;
            u8*  field_8;
            s8   unk_C[28];
        } s_1;
    } field_A0;
    u8                 field_C8;
    u8                 unk_C9[1];
    s16                field_CA;
    s_func_8006CC44_CC field_CC;
    // TODO: May be incomplete. Maybe not, added the final padding based on `Collision_Get`.
} s_func_8006CC44;

typedef struct _GlobalLm
{
    s_LmHeader* lmHdr_0;
    s32         fileIdx_4;
    s32         queueIdx_8;
} s_GlobalLm;

typedef struct
{
    s32            field_0; // Bone flags?
    GsCOORDINATE2* coord_4;
    s_ModelHeader* modelHdr_8;
    s32            modelIdx_C;
} s_ModelInfo;

typedef struct _Bone
{
    s_ModelInfo   modelInfo_0;
    s8            field_10;
    s8            unk_11[3];
} s_Bone;
STATIC_ASSERT_SIZEOF(s_Bone, 20);

typedef struct _LinkedBone
{
    s_Bone              bone_0;
    struct _LinkedBone* next_14;
} s_LinkedBone;
STATIC_ASSERT_SIZEOF(s_LinkedBone, 24);

typedef struct
{
    u8            boneCount_0;
    u8            boneIdx_1;
    u8            field_2;
    s8            field_3;
    s_LinkedBone* bones_4;
    s_LinkedBone* bones_8;
    s_LinkedBone  bones_C[56];
} s_Skeleton;
STATIC_ASSERT_SIZEOF(s_Skeleton, 1356);

typedef struct
{
    s8  field_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s32 field_4[4];
} s_800382B0;

typedef struct
{
    s16 field_0; // Flags?
} s_8008D850;

// or `s_AnimMetadata`?
typedef struct _CharaAnimDataInfo
{
    s8             charaId0_0;  /** `e_CharacterId` */
    s8             charaId1_1;  /** `e_CharacterId` */
    // 2 bytes of padding.
    s32            animFile0_4; // s_AnmHeader* animFile0_4; // TODO: Needs to be a pointer.
    s_AnmHeader*   animFile1_8;
    s32            animBufferSize1_C;
    s32            animBufferSize2_10;
    GsCOORDINATE2* npcCoords_14;
} s_CharaAnimDataInfo;
STATIC_ASSERT_SIZEOF(s_CharaAnimDataInfo, 24);

/** Related to weapon attacks. Stats, SFX IDs, damange values, etc.? */
typedef struct
{
    q4_12 field_0;
    s16   field_2;
    u16   field_4;  // Related to damage. Multiplier?
    s8    field_6;  // Accessed by `func_8008BF84` as `u16`
    s8    unk_7;
    u8    field_8;  // Accessed by `func_8008BF84` as `u16`
    u8    field_9;  /** `e_CharacterId` */
    u8    field_A;  // Accessed by `func_8008BF84` as `u16`
    u8    field_B;
    u16   field_C;
    u8    field_E;  // Keyframe index offset?
    u8    field_F;  // Keyframe index offset?
    u8    field_10; // State.
    u8    field_11;
    u8    field_12;
    u8    unk_13;
    u32*  unk_14; // Some pointer. All entries have the same value `D_800AD4C4`.
} s_800AD4C8;
STATIC_ASSERT_SIZEOF(s_800AD4C8, 24);

/** @brief Collision point data. */
typedef struct
{
    VECTOR3     position_0; // Q19.12
    s_Collision collision_C;
    s32         field_18; // Count of points in circle?
} s_CollisionPoint;

typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800BCDA8;
STATIC_ASSERT_SIZEOF(s_800BCDA8, 4);

typedef struct _SpeedZone
{
    s8   type_0; /** `e_SpeedZoneType` */
    // 1 byte of padding.
    q11_4 minX_2;
    q11_4 maxX_4;
    q11_4 minZ_6;
    q11_4 maxZ_8;
} s_SpeedZone;

typedef struct _WaterZone
{
    u8  isEnabled_0; /** `bool` */
    // 1 byte of padding.
    s16 illumination_2;
    q11_4 minX_4;
    q11_4 maxX_6;
    q11_4 minZ_8;
    q11_4 maxZ_A;
} s_WaterZone;

typedef struct
{
    u8            charaId_0;  /** `e_CharacterId` */
    u8            isLoaded_1; /** `bool` */
    // 2 bytes of padding.
    s32           queueIdx_4;
    s_LmHeader*   lmHdr_8;
    s_FsImageDesc texture_C;
    s_Skeleton    skeleton_14;
} s_CharaModel;
STATIC_ASSERT_SIZEOF(s_CharaModel, 1376);

typedef struct _MapInfo
{
    s16                plmFileIdx_0;
    char               tag_2[4];
    u8                 flags_6; /** `e_MapFlags` */
    // 1 byte of padding.
    const s_WaterZone* waterZones_8;
    const s_SpeedZone* speedZones_C;
} s_MapInfo;

// Rough name.
typedef struct _WorldObjectMetadata
{
    u_Filename name_0;
    s8         field_8;
    s8         lmIdx_9; /** Set to 2 when found in `g_Map.globalLm_138.lmHdr_0` and 3-6 if found in `g_Map.ipdActive_15C[i] (i + 3)`. */
} s_WorldObjectMetadata;

// Rough name.
typedef struct _WorldObjectModel
{
    s_ModelInfo           modelInfo_0;
    s_WorldObjectMetadata metadata_10;
} s_WorldObjectModel;
STATIC_ASSERT_SIZEOF(s_WorldObjectModel, 28);

/** @brief Geometry space world object to draw. */
typedef struct _WorldObject
{
    s_WorldObjectModel* model_0;
    s32                 positionX_4 : 18; /** Q9.8 */
    s32                 positionY_4 : 14; /** Q5.8 */
    s32                 positionZ_8 : 18; /** Q9.8 */
    s32                 pad_8_18    : 14;
    s32                 rotationX_C : 10; /** Q0.10 */
    s32                 rotationY_C : 12; /** Q0.12 */
    s32                 rotationZ_C : 10; /** Q0.10 */
} s_WorldObject;
STATIC_ASSERT_SIZEOF(s_WorldObject, 16);

typedef struct
{
    u8  endOfArray_0_0 : 1;  // End of array marker.
    s32 positionX_0_1  : 10; // X
    s32 positionZ_0_11 : 10; // Z
    u32 sizeX_0_21     : 4;  // X size
    u32 sizeZ_0_25     : 4;  // Z size
    u32 field_0_29     : 3;  // Related to ground height? Used to set `s_func_8006F338::field_2C` which then gets copied by `func_8006F250`, that func has only been seen called by AirScreamer?
} s_func_8006F8FC;
STATIC_ASSERT_SIZEOF(s_func_8006F8FC, 4);

typedef struct _HeldItem
{
    s32           itemId_0; /** `e_InventoryItemId` */
    s32           queueIdx_4;
    char*         textureName_8;
    s_FsImageDesc imageDesc_C;
    s_LmHeader*   lmHdr_14;
    s_Bone        bone_18;
} s_HeldItem;
STATIC_ASSERT_SIZEOF(s_HeldItem, 0x2C);

/** @brief World GFX workspace.
 * TODO: Could be `s_RendererWork`? Will depend on where other data resides.
 * Will: `s_WorldModelWork` fits better, this is mainly responsible for handling model data.
 * `s_WorldEnvWork` should have this name as it is used for general GFX.
 */
typedef struct _WorldGfxWork
{
    s_MapInfo*        mapInfo_0;
    u8                useStoredPoint_4; /** `bool` */
    u8                unk_5[3];
    VECTOR3           ipdSamplePoint_8; /** Used by IPD logic to sample which chunks to load or unload. */
    u8*               charaLmBuffer_14;
    s_CharaModel*     registeredCharaModels_18[Chara_Count];
    s_CharaModel      charaModels_CC[GROUP_CHARA_COUNT];
    s_CharaModel      harryModel_164C;
    s_HeldItem        heldItem_1BAC;             /** The item held by the player. */
    s_func_8006F8FC*  field_1BD8;
    VC_CAMERA_INTINFO vcCameraInternalInfo_1BDC; /** Debug camera info. */
    s_LmHeader        itemLmHdr_1BE4;
    u8                itemLmData_1BF4[4096 - sizeof(s_LmHeader)]; // Retail game uses 2.75kb file, but they allocate 4kb for it.
    s32               itemLmQueueIdx_2BE4;
    s32               objectCount_2BE8;                     /** `objects_2BEC` size. */
    s_WorldObject     objects_2BEC[WORLD_OBJECT_COUNT_MAX]; /** World objects to draw. */
} s_WorldGfxWork;
STATIC_ASSERT_SIZEOF(s_WorldGfxWork, 11708);

// IPD data?
typedef struct
{
    s_IpdHeader* ipdHdr_0;
    s32          queueIdx_4;
    s16          cellX_8;
    s16          cellZ_A;
    q19_12       distance0_C;
    q19_12       distance1_10;
    u8           materialCount_14;
    s8           unk_15[3];
    s32          outsideCount_18;
} s_IpdChunk;
STATIC_ASSERT_SIZEOF(s_IpdChunk, 28);

typedef struct _IpdRow
{
    s16 idx[16];
} s_IpdColumn;
STATIC_ASSERT_SIZEOF(s_IpdColumn, 32);

typedef struct _ActiveTextures
{
    s32        count_0;
    s_Texture* textures_4[10];
} s_ActiveTextures;

typedef struct _IpdTextures
{
    s_ActiveTextures fullPage_0;
    s_ActiveTextures halfPage_2C;
    s_Texture        fullPageTextures_58[8];
    s_Texture        halfPageTextures_118[2];
} s_IpdTextures;
STATIC_ASSERT_SIZEOF(s_IpdTextures, 328);

typedef struct _Map
{
    s_IpdCollisionData collisionData_0; // Default chunk collision data?
    s32                texFileIdx_134;
    s_GlobalLm         globalLm_138;
    char               mapTag_144[4];
    s32                mapTagSize_148;
    s32                ipdFileIdx_14C;
    s_IpdHeader*       ipdBuffer_150;
    s32                ipdBufferSize_154;
    s32                ipdActiveSize_158;
    s_IpdChunk         ipdActive_15C[4];
    s_IpdColumn        ipdGrid_1CC[18];
    s8                 unk_40C[32];     // Could be one extra row in table above.
    s_IpdColumn*       ipdGridCenter_42C;
    s_IpdTextures      ipdTextures_430;
    q19_12             positionX_578;
    q19_12             positionX_57C;
    s32                cellX_580;
    s32                cellZ_584;
    bool               isExterior_588;
} s_Map;
STATIC_ASSERT_SIZEOF(s_Map, 1420);

typedef struct
{
    VECTOR3 field_0[2][1];
} s_WorldEnvWork_84;

/** @brief World environment workspace.
 *  Holds fog distances and ramps, lighting and color parameters,
 *  water zone references, and other per-map environmental data
 *  used during world rendering.
 */
typedef struct _WorldEnvWork
{
    u8            field_0;        // `bool`?
    u8            isFogEnabled_1; /** `bool` */
    u8            field_2;
    u8            field_3;        // Enviroment lighting.
    s_WaterZone*  waterZones_4;
    s32           screenBrightness_8;
    s32           fogNearDistance_C;
    q23_8         fogFarDistance_10; // "DrawDistanmce" in SHME, "has no effect when fog is disabled".
    s32           fogDepthShift_14;   // "FogThing1" from SHME. Affects the distance where fog begins.
    s32           fogIntensity_18;   // "FogThing2" from SHME. Affects the distance where fog begins.
    CVECTOR       fogColor_1C;
    s32           field_20;        // Map lighting.
    u8            field_24; // } RGB. Character color lighting.
    u8            field_25; // }
    u8            field_26; // }
    s8            unk_27;
    CVECTOR       worldTintColor_28;
    MATRIX        field_2C;
    s32           field_4C;
    s16           field_50;
    s32           field_54;
    SVECTOR       field_58; // Rotation.
    VECTOR3       field_60;
    SVECTOR       field_6C; // Player current angles?
    SVECTOR       field_74;
    SVECTOR       field_7C;
    s_WorldEnvWork_84 field_84[3];
    u8            fogRamp_CC[128]; // Fog-related values based on `fogNearDistance_C`/`fogFarDistance_10`.
    u16           field_14C;
} s_WorldEnvWork;

typedef struct
{
    u16              field_0; // Flags.
    u8               field_2; // Size of `field_4`.
    u8               unk_3;
    s_func_8006F8FC* field_4[20]; // Guessed size.
} s_800C4478;

typedef struct
{
    u8      field_0; // `bool`?
    u8      field_1; // `bool`?
    u8      field_2; // `bool`?
    u8      field_3;
    s8      unk_4[4];
    s16     field_8;
    s16     field_A;
    VECTOR3 field_C;
    s8      unk_18[4];
    s32     field_1C;
    s32     field_20;
} s_800C4818;

typedef struct
{
    u8  unk_0[4];
    s16 field_4;
    s16 field_6; // Keyframe index or time.
} s_800C44F0; // Probable size: 8 bytes.

/** Holds file IDs of anim/model/texture for each `e_CharacterId`, along with some data used in VC camera code. */
typedef struct
{
    s16            animFileIdx;
    s16            modelFileIdx;
    s16            textureFileIdx         : 16;
    q8_8           field_6                : 10;
    u16            materialBlendMode_6_10 : 6; /** `e_BlendMode` */
    s_FsImageDesc* field_8;                    // Extra texture pointer? Usually `NULL` in `CHARA_FILE_INFOS`.
    u16            cameraAnchor_C_0  : 2;      /** `e_CameraAnchor` */
    q19_12         cameraOffsetY_C_2 : 14;
    // 2 bytes of padding.
} s_CharaFileInfo;
STATIC_ASSERT_SIZEOF(s_CharaFileInfo, 16);

typedef struct
{
    SVECTOR3 positionTarget_0; /** Q7.8 */
    SVECTOR3 lookAtTarget_6;   /** Q7.8 */
    s16      field_C[2];       // `field_C[1]` gets passed to `vcChangeProjectionValue`.
} s_DmsKeyframeCamera;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCamera, 16);

typedef struct
{
    SVECTOR3 position_0; /** Q7.8 */
    SVECTOR3 rotation_6; /** Q7.8 */
} s_DmsKeyframeCharacter;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCharacter, 12);

typedef struct
{
    s16       keyframeCount_0;
    u8        svectorCount_2;
    u8        field_3;      // Usually 0, but sometimes filled in, possibly junk data left in padding byte.
    char      name_4[4];    // First 4 chars of name. E.g. Code checks for "DAHLIA", file is "DAHL".
    SVECTOR3* svectorPtr_8; // Pointer to `SVECTOR3`s. Unknown purpose.
    union
    {
        s_DmsKeyframeCharacter* character;
        s_DmsKeyframeCamera*    camera;
    } keyframes_C;
} s_DmsEntry;
STATIC_ASSERT_SIZEOF(s_DmsEntry, 16);

typedef struct
{
    s16 startKeyframeIdx_0;
    s16 frameCount_2; /** Frame duration at 30 FPS. */
} s_DmsInterval;
STATIC_ASSERT_SIZEOF(s_DmsInterval, 4);

typedef struct
{
    u8             isLoaded_0; /** `bool` */
    u8             characterCount_1;
    u8             intervalCount_2;
    u8             field_3; // Usually 0, but sometimes filled in.
    u32            field_4; // Unknown, correlates with DMS file size.
    s_DmsInterval* intervalPtr_8;
    VECTOR3        origin_C; /** Q23.8 | Origin point. Gets added to character positions. */
    s_DmsEntry*    characters_18;
    s_DmsEntry     camera_1C;
} s_DmsHeader;
STATIC_ASSERT_SIZEOF(s_DmsHeader, 44);

/** @brief Used for normal credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height? */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E24, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E434C`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
} s_800AFE08;
STATIC_ASSERT_SIZEOF(s_800AFE08, 28);

/** @brief Used for UFO ending credits screen. */
typedef struct
{
    s_800AFE08 sub_0;
    s32        field_1C;
    s16        field_20;
    s16        field_22;
    s32        field_24;
    s32        field_28;
    s32        field_2C;
    s32        field_30;
    s32        field_34;
    s32        field_38;
    s32        field_3C;
    s32        field_40;
    s32        field_44;
    s32        field_48;
    s32        field_4C;
    s32        field_50;
    s32        field_54;
} s_800AFE24; // Size: 85

/** @brief Contains X/Z coordinates and optional 4 bytes of data.
 * Map headers include an array of these, into which `s_EventData` includes an index. */
typedef struct _MapPoint2d
{
    q19_12 positionX_0;

    // Optional data.
    u32   mapIdx_4_0          : 5; /** `e_PaperMapIdx`? */
    u32   field_4_5           : 4;
    u32   loadingScreenId_4_9 : 3; /** `e_LoadingScreenId` */
    u32   field_4_12          : 4;
    q24_8 triggerParam0_4_16  : 8; // Usually a `Q8_ANGLE`
    u32   triggerParam1_4_24  : 8;

    q19_12 positionZ_8;
} s_MapPoint2d;
STATIC_ASSERT_SIZEOF(s_MapPoint2d, 12);

typedef struct _SpawnInfo
{
    q19_12 positionX_0;
    s8  charaId_4;   /** `e_CharacterId` */
    u8  rotationY_5; /** Degrees in Q7.8, range [0, 256]. */
    s8  flags_6;     /** Copied to `stateStep_3` in `s_Model`, with `controlState_2 = ModelState_Uninitialized`. */
    s32 minGameDifficulty_7_0 : 4;
    q19_12 positionZ_8;
} s_SpawnInfo;
STATIC_ASSERT_SIZEOF(s_SpawnInfo, 12);

/** Special map-specific Harry anim data. */
typedef struct
{
    s16   status_0; /** Packed anim status. See `s_ModelAnim::status_0`. */
    s16   status_2; /** Packed anim status. See `s_ModelAnim::status_0`. */
    q3_12 time_4;   /** Fixed-point anim time. */
    s16   keyframeIdx_6;
} s_UnkStruct3_Mo; // Probable size: 8 bytes.

/** Guessed based on in-debugger observation during gameplay.
 * Everything is inited to 0xFFFF and some data is written when the player is hit by monsters.
 * Might be more generic particles/decals struct.
 */
typedef struct _BloodSplat
{
    s16 field_0; // Maybe an array of `u16`s? Contains indices.
} s_BloodSplat;

typedef struct
{
    u8    unk_0;
    u8    field_1;
    u8    field_2;
    u8    unk_3;
    u8    field_4;
    u8    field_5;
    u8    field_6;
    u8    unk_7;
    u8    unk_8[2];
    s16   field_A;
    u8    unk_C[2];
    s16   field_E;
    q3_12 field_10;
    u8    unk_12[4];
    s16   field_16;
    u8    unk_18[8];
    s32   field_20;
    s32   field_24;
} s_MapOverlayHeader_5C;

typedef struct
{
    u8  field_0;
    u8  field_1;
    u8  field_2;
    u8  field_3;
    s16 field_4;
    s16 field_6;
    s16 field_8;
    s16 field_A;
    s16 field_C;
    s16 field_E;
    s16 field_10;
    s16 field_12;
    s32 field_14;
    s32 field_18;
    s32 field_1C;
} s_MapOverlayHeader_7C;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader_7C, 0x20);

typedef struct
{
    s32    field_0[4];
    s16    field_10[4];
    s32    field_18[4];
    u16    field_28[4];
    u8     field_30[4];
    q3_12  field_34[4]; // Y angles.
    u16    field_3C[4];
    u16    field_44[4];
    s16    field_4C[4];
    u16    field_54[4];
    u16    field_5C[4];
    q4_12  field_64[4];
    s16    field_6c[4];
    s16    field_74;
    s16    unk_76;
    u8     field_78;
} s_MapOverlayHeader_94;

/** TODO: `g_MapOverlayHeader` is part of the map overlay BIN files. Maybe should be moved to `maps/shared.h`.
 * If field has a comment that lists only certain map(s) it means all others set this field to 0.
 * func(?) means the signature is unknown and a default void() was selected for now.
 */
typedef struct _MapOverlayHeader
{
    s_MapInfo*             mapInfo_0;
    u8                     (*getMapRoomIdxFunc_4)(s32 x, s32 y); // Called by `Savegame_MapRoomIdxUpdate`.
    s8                     field_8;
    s32                    (*func_C)();
    // 3 bytes of padding.
    void                   (*bgmEvent_10)(bool);
    s8                     bgmIdx_14;           // Flags? Music related.
    u8                     ambientAudioIdx_15; // Ambient file index from `g_AmbientVabTaskLoadCmds`.
    s8                     field_16;           // Set ambient tint and render distance.
                                               // A value of 3 sets the map to night.
                                               // A value of 2 will sets the map to use a tint used during the hallaway
                                               // intro.
                                               // Giving this and next variable a name will require further investigation
                                               // of `particle.c` code.
    s8                     field_17;           // Set weather to play. Rain, heavy rain, or snow.
    void                   (**loadingScreenFuncs_18)();
    s_MapPoint2d*          mapPointsOfInterest_1C;
    void                   (**mapEventFuncs_20)(); /** Points to array of event functions. */
    s_EventData*           mapEvents_24;
    GsCOORDINATE2*         field_28;
    u8*                    loadableItems_2C;
    const char**           mapMessages_30; // Array of strings.
    s_AnimInfo*            animInfos_34;   // Map-specific anim infos for Harry (for anims 38+).
    s_UnkStruct3_Mo*       field_38; // Array of 40?
    void                   (*worldObjectsInit_3C)(void); // func(?).
    void                   (*worldObjectsUpdate_40)(void);
    void                   (*func_44)();
    void                   (*npcSpawnEvent_48)(); // func(?).
    s_MapHdr_field_4C*     unkTable1_4C; // Related to collision?
    s16                    unkTable1Count_50;
    // 2 bytes of padding.
    s_BloodSplat*          bloodSplats_54;
    s16                    bloodSplatCount_58;
    // 2 bytes of padding.
    s_MapOverlayHeader_5C* field_5C;
    void                   (*func_60)(s32, s32);
    s32                    (*func_64)(POLY_FT4** poly, s32);
    s32                    (*func_68)(POLY_FT4** poly, s32);
    void                   (*func_6C)(); // func(?).
    s32                    (*func_70)(POLY_FT4** poly, s32);
    void                   (*func_74)(); // func(?).
    s32                    (*func_78)(POLY_FT4** poly, s32);
    s_MapOverlayHeader_7C* field_7C;     // only map1_s01, map6_s04.
    void                   (*func_80)(); // func(?).
    s32                    (*func_84)(POLY_FT4** poly, s32);
    s32*                   func_88; // only map0_s01, map7_s01.
    s32                    (*func_8C)(POLY_FT4** poly, s32); // func(?) only map0_s01, map7_s01.
    s32                    (*func_90)(POLY_FT4** poly, s32); // func(?) only map5_s00.
    s_MapOverlayHeader_94* field_94;                    // only map1_s02, map1_s03.
    s32                    (*func_98)(POLY_FT4** poly, s32); // only map1_s02, map1_s03.
    void                   (*func_9C)();                // only map1_s02, map1_s03.
    s32*                   func_A0; // only map1_s03.
    s32                    (*func_A4)(POLY_FT4** poly, s32); // func(?) only map1_s03.
    void                   (*func_A8)(); // func(?) only map6_s02.
    s32                    (*func_AC)(POLY_FT4** poly, s32); // func(?) only map4_s03, map4_s05.
    s32                    (*func_B0)(POLY_FT4** poly, s32); // func(?) only map4_s03, map4_s05.
    s32                    (*func_B4)(POLY_FT4** poly, s32); // func(?) only map1_s03, map4_s05, map6_s01, map6_s02, map5_s01.
    void                   (*func_B8)(s_SubCharacter* chara, s_PlayerExtra* extra, GsCOORDINATE2* coords);
    void                   (*func_BC)(s_SubCharacter* chara, s_PlayerExtra* extra, GsCOORDINATE2* coords);
    void                   (*func_C0)(); // func(?).
    void                   (*playerMatchArmAnimDisable_C4)(); // func(?).
    void                   (*playerControlFreeze_C8)();
    void                   (*playerControlUnfreeze_CC)(bool setIdle);
    bool                   (*func_D0)(s32 playerExtraState, VECTOR3* vec, q3_12 angle, s32 vecCount); // 0x800C964C
    s32                    (*func_D4)(s32 playerExtraState); // Points to `sharedFunc_800D2C7C_0_s00` which has `void` return type, but changing this funcptr causes mismatch in `func_80085EB8`
    void                   (*func_D8)();                     // Assumed return type.
    void                   (*playerAnimLock_DC)(void);
    void                   (*playerAnimIsLocked_E0)(); // func(?).
    s32                    (*playerAnimUnlock_E4)(s_SubCharacter*, s32); // Assumed return type.
    s64                    (*func_E8)(s_SubCharacter*);      // Is it really `s64`???
    bool                   (*playerMoveDistIsZero_EC)();
    void                   (*playerMoveDistClear_F0)(); // func(?).
    void                   (*playerFallBackward_F4)();
    void                   (*func_F8)(); // func(?).
    void                   (*playerDamageFeetFront_FC)(); // func(?).
    void                   (*func_100)(); // func(?).
    void                   (*func_104)(); // func(?).
    s32                    (*func_108)();
    void                   (*func_10C)(); // func(?).
    void                   (*func_110)(); // func(?).
    void                   (*func_114)(); // func(?).
    void                   (*func_118)(); // func(?).
    void                   (*func_11C)(); // func(?).
    void                   (*func_120)(); // func(?).
    void                   (*func_124)(s_SubCharacter*); // Assumed return type.
    s32                    (*func_128)(s_SubCharacter*); // Assumed return type.
    s32                    (*func_12C)(s_SubCharacter*); // Assumed return type.
    void                   (*func_130)(); // func(?).
    s32                    (*func_134)(s_SubCharacter*); // Assumed return type.
    s32                    (*func_138)(s_SubCharacter*); // Keyframe state getter. Return value depends on the anim update function being used.
    s32                    (*func_13C)(s32, s32, void*, s16, s32); // `arg0` is `s_SubCharacter*`.
    void                   (*func_140)(); // func(?).
    void                   (*func_144)(); // func(?).
    void                   (*func_148)(); // func(?).
    void                   (*func_14C)(); // func(?).
    void                   (*animStartKeyframeIdxGet_150)();
    void                   (*func_154)(); // func(?).
    void                   (*func_158)(q19_12 x, q19_12 z); // only map1_s05, map1_s06.
    void                   (*func_15C)(); // func(?) only map5_s01.
    void                   (*func_160)(); // func(?) only map5_s01.
    void                   (*func_164)(); // func(?) only map5_s01.
    void                   (*particlesUpdate_168)(s32 unused, s32 mapId, s32);
    void                   (*enviromentSet_16C)(s8, u32);
    void                   (*func_170)(); // func(?).
    void                   (*func_174)(); // func(?).
    void                   (*particleHyperBlasterBeamDraw_178)(VECTOR3* vec0, q19_12* rotX, q19_12* rotY);
    void                   (*particleBeamDraw_17C)(const VECTOR3* from, const VECTOR3* to);
    void                   (*particleSoundStop_17C)();
    s32*                   windSpeedX_184;
    s32*                   windSpeedZ_188;
    s32*                   data_18C;
    s32*                   data_190;
    void                   (*charaUpdateFuncs_194[Chara_Count])(s_SubCharacter* chara, s_AnmHeader* anmHdr, GsCOORDINATE2* coords); /** Guessed params. Funcptrs for each `e_CharacterId`, set to 0 for IDs not included in the map overlay. Called by `Game_NpcUpdate`. */
    s8                     charaGroupIds_248[GROUP_CHARA_COUNT];                              /** `e_CharacterId` values where if `s_SpawnInfo::charaId_4 == Chara_None`, `charaGroupIds_248[0]` is used for `charaSpawns_24C[0]` and `charaGroupIds_248[1]` for `charaSpawns_24C[1]`. */
    s_SpawnInfo            charaSpawns_24C[2][16];                                            /** Array of character type/position/flags. `flags_6 == 0` are unused slots? Read by `Game_NpcRoomInitSpawn`. */
    VC_ROAD_DATA           roadDataList_3CC[100];
    s_func_8006F8FC        field_D2C[200];
} s_MapOverlayHeader;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader, 0x104C);

typedef struct
{
    s8 maxIdx_0;
    u8 selectedEntryIdx_1;
} s_MapMsgSelect;

// TODO: Might just be an array of `char*`, array is in `.data` while strings inside are in `.rodata`?
typedef struct
{
    char* field_0;               // `NULL`
    char* savePadName_4;         // "PAD_NEAR"
    char* firstAidKitName_8;     // "AIDKIT_N"
    char* healthDrinkName_C;     // "DRINK_NE"
    char* ampouleName_10;        // "AMPULE_N"
    char* handgunBulletsName_14; // "BULLET_N"
    char* shotgunShellsName_18;  // "SHELL_NE"
    char* rifleShellsName_1C;    // "SHOT_NEA"
} s_800A99E4;
STATIC_ASSERT_SIZEOF(s_800A99E4, 32);

typedef struct
{
    u8 presetIdx1_0;
    u8 presetIdx2_1;
} s_MapEffectsPresetIdxs;

/** @brief Line of sight data for finished ray trace. TODO: Could rename to `s_Los` to keep "ray" as a generic math term? */
typedef struct
{
    s8              hasHit_0; /** `bool` */
    u8              field_1;
    s8              unk_2[2]; // Probably padding.
    VECTOR3         field_4;  // Q19.12
    s_SubCharacter* chara_10;
    q19_12          field_14; // Hit distance X?
    q19_12          field_18; // Hit distance Z?
    q7_8            field_1C; // Angle.
} s_RayData;

typedef struct
{
    VECTOR3 offset_0;  // Q19.12
    s32     field_C;   // Absolute ground height? Might be using `s_Collision` substruct?
    s16     field_10;
    s16     field_12;
    s8      field_14;  // Count of something? 12 is significant.
    s8      unk_15[3]; // Probably padding.
    s32     field_18;
} s_800C4590;

typedef struct
{
    DVECTOR  screenXy_0[90];
