#ifndef _BODYPROG_H
#define _BODYPROG_H

#include "game.h"
#include "bodyprog/text_draw.h" // TODO: Add to .c files that make use of this instead of including here.
#include "bodyprog/vw_system.h"
#include "main/fsqueue.h"
#include "types.h"

/** @brief This header is used to declare any variable, struct, or
 * function part of `BODYPROG.BIN` that has not been identified to
 * be related a to currently recognized and separated section of
 * the engine (like player logic, save game or item screens).
 */

// ========
// DEFINES
// ========

#define TEMP_MEMORY_ADDR ((s8*)0x801A2600)

#define IMAGE_BUFFER_0 ((u_long*)0x801CFA00)
#define IMAGE_BUFFER_1 ((u_long*)0x801C8200)
#define IMAGE_BUFFER_2 ((u_long*)0x801ABE00)
#define FONT24_BUFFER ((u_long*)0x801F5600) // Loaded by `GameFs_StfRollBinLoad`.

#define CD_ADDR_0 ((u_long*)0x801E2600)

#define OPT_SOUND_VOLUME_MIN   0
#define OPT_SOUND_VOLUME_MAX   128
#define OPT_VIBRATION_DISABLED 0
#define OPT_VIBRATION_ENABLED  128

// TODO: Could be part of a larger SFX enum with every sound effect? Maybe registered like filesystem assets.
#define SFX_DENIED  0x518
#define SFX_BACK    0x519
#define SFX_CANCEL  0x51A
#define SFX_CONFIRM 0x51B

// ======
// ENUMS
// ======

/** Used by `func_8003F654` to cast a specific field to the desired type. */
typedef enum _MenuState
{
    MenuState_Start              = 0,
    MenuState_Main               = 1,
    MenuState_LoadGame           = 2,
    MenuState_DifficultySelector = 3,
    MenuState_NewGameStart       = 4
} e_MenuState;

typedef enum _PrimitiveType
{
    PrimitiveType_None = 0,
    PrimitiveType_S8   = 1,
    PrimitiveType_U8   = 2,
    PrimitiveType_S16  = 3,
    PrimitiveType_U16  = 4,
    PrimitiveType_S32  = 5
} s_PrimitiveType;

// ================
// UNKNOWN STRUCTS
// ================

/* Structs called by functions that haven't been identified. */

// Exception, as one of the unidentified structs uses this.
typedef struct
{
    s32 field_0;
    u8  field_4;
    u8  field_5;
    u16 field_6;
    s32 field_8;
    s32 field_C;
} s_8002AC04;
STATIC_ASSERT_SIZEOF(s_8002AC04, 16);

// Likely not `s_Skeleton` since `field_8` must be `s8`.
typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
    s8 unk_4[4];
    s8 field_8;
} s_80041CEC;

typedef struct 
{
    s32  field_0;
    u8   unk_4[12];
    s8*  field_16;
    u8   unk_20[4];
    s8   field_24;
    s8   field_25;
} s_func_8003C8F8;

typedef struct
{
    s32 field_0;
    s8* field_4;
} s_func_8003F654;

typedef struct
{
    s8  unk_0[4];
    s16 field_4;
    s8  unk_6[2];
    s8  unk_8[3];
    s8  unk_10[4];
    s32 field_14;
} s_func_8003FEC0;

typedef struct
{
    s_80041CEC* field_0;
    s32         field_4;
    s32         field_8;
} s_func_80041CB4;

typedef struct
{
    u8  field_0;
    u8  field_1;
    u8  field_2;
    u8  field_3;
    s16 field_4;
    s16 field_6;
} s_func_8005660C_1;

typedef struct
{
    s8  unk_0[14];
    s8  field_E;
    s16 field_10;
    s8  unk_12[2];
    u8  field_14;
    u8  field_15;
} s_func_8005660C_0;

typedef struct
{
  u8 unk_0[24];
} s_func_800566B4_sub;
STATIC_ASSERT_SIZEOF(s_func_800566B4_sub, 24);

typedef struct
{
    s8                   unk_0[3];
    u8                   field_3; // Size of `field_4` array.
    s_func_800566B4_sub* field_4;
} s_func_800566B4;

typedef struct
{
    s8 unk_0[20];
    s8 field_14;
} s_func_8005B370;

typedef struct
{
    char pad[12];
} s_func_8005B424;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s16 field_8;
    s8  unk_A;
    s8  field_B;
    s8  field_C;
    s8  field_D;
    s16 field_E;
    s32 field_10;
} s_func_800625F4;
STATIC_ASSERT_SIZEOF(s_func_800625F4, 20);

typedef struct
{
    s16 field_0;
    s16 field_2;
    s16 field_4;
    u16 field_6_0  : 5; // TODO: Might be using `s_func_800699E4_18` substruct here? Won't fit though..
    u16 field_6_5  : 3;
    u16 field_6_8  : 3;
    u16 field_6_11 : 4;
    u16 field_6_15 : 1;
    s16 field_8;
    s16 field_A;
} s_func_800699E4_10;
STATIC_ASSERT_SIZEOF(s_func_800699E4_10, 12);

typedef struct
{
    u16 field_0_0  : 5;
    u16 field_0_5  : 3;
    u16 field_0_8  : 3;
    u16 field_0_11 : 4;
    u16 field_0_15 : 1;
    u8  unk_2[2];
    u8  unk_4[6];
} s_func_800699E4_18;
STATIC_ASSERT_SIZEOF(s_func_800699E4_18, 10);

typedef struct
{
    s32                 field_0;
    s32                 field_4;
    u32                 field_8_0  : 8;
    u32                 field_8_8  : 8;
    u32                 field_8_16 : 8;
    u32                 field_8_24 : 8;
    u8                  unk_C[4];
    s_func_800699E4_10* ptr_10;
    u8                  unk_14[4];
    s_func_800699E4_18* ptr_18;
    u8                  unk_1C[2];
    u8                  field_1E;
    u8                  unk_1F[1];
    s32*                field_20; // Might point to `s_func_8006B1C8`?
    u8                  unk_24[4];
    s8*                 field_28;
    s8*                 field_2C;
    u8                  field_30;
    u8                  unk_31[3];
    u8                  field_34[256];
} s_func_800699E4;

/** @brief Returned by `func_800699F8`, collision related? */
typedef struct _s_func_800699F8
{
    s32 chara_grnd_0;
    s16 field_4;
    s16 field_6;
    s8  field_8;
    u8  unk_9[3];
} s_func_800699F8;
STATIC_ASSERT_SIZEOF(s_func_800699F8, 12);

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    s32 field_C;
    s16 field_10;
    s16 field_12;
    s8  field_14;
    s8  unk_15[3];
    s32 field_18;
} s_func_8006A178;

typedef struct
{
    VECTOR3  pos_0;
    SVECTOR3 rot_C;
    s8       field_12;
} s_func_8006AB50;

typedef struct
{
    s32     field_0;
    s32     field_4;
    s32     field_8;
    SVECTOR field_C;
    s16     dirX_14;
    s16     dirZ_16;
    s32     posX_18;
    s32     posZ_1C;
    s32     field_20;
    s32     field_24;
    s16     field_28;
    s16     field_2A;
    s16     field_2C;
} s_func_8006ABC0;

typedef struct
{
    s16 field_0;
    u8  unk_2[2];
    s16 field_4;
} s_func_8006B1C8;

typedef struct
{
    s8  unk_0[48];
    s16 field_30;
    s8  unk_32[164];
    s16 field_D6;
    s8  unk_DA[8];
    s32 field_E0;
    s8  unk_E4[2];
    u16 field_E6;
    s8  unk_EA[2];
    s32 field_EC;
} s_func_8006BC34;

typedef struct
{
    s8  field_0;
    s8  unk_1;
    s16 field_2;
    s16 field_4;
} s_func_8006BDDC;

typedef struct
{
    u8  unk_0[2];
    s16 field_2;
    u8  unk_4[2];
    s16 field_6;
} s_func_8006CA18;

typedef struct
{
    u8  unk_0[1];
    u8  field_1;
    u8  unk_2[2];
    s32 field_4;
} s_func_8006CC44_A8;

typedef struct
{
    u8                 field_0_0  : 8;
    s8                 field_0_8  : 1;
    s8                 field_0_9  : 1;
    s8                 field_0_10 : 1;
    s8                 field_0_11 : 5;
    u16                field_2    : 16;
    s_func_8006ABC0    field_4;
    s32                field_34;
    s8                 unk_38[12];
    s8                 field_44;
    s8                 unk_45[5];
    s16                field_4A;
    s8                 field_4C;
    s8                 unk_4D[3];
    s8                 unk_50[36];
    s8                 field_74;
    s8                 unk_75[5];
    s16                field_7A;
    s32                field_7C;
    s32                field_80;
    s32                field_84;
    s32                field_88;
    s32                field_8C;
    s32                field_90;
    s32                field_94;
    s16                field_98;
    s16                field_9A;
    u8                 unk_9C[4];
    u8                 field_A0;
    u8                 field_A1;
    u8                 field_A2;
    u8                 field_A3;
    s_func_8006CA18*   field_A4;
    s_func_8006CC44_A8 field_A8[4];
    u8                 field_C8;
    u8                 unk_C9[1];
    s16                field_CA;
    u8                 unk_CC[4];
    u8                 unk_D0[8];
    u8                 field_D8;
    u8                 field_D9;
    // TODO: May be incomplete.
} s_func_8006CC44;

typedef struct
{
    s8  unk_0[22];
    s32 field_18;
} s_func_80089840;

typedef struct
{
    VECTOR3 field_0;
    VECTOR3 field_C;
    s8      unk_18[6];
    u8      field_1E;
    u8      field_1F;
} s_func_800CFFF8;

// Function from lib_unk
typedef struct
{
    char unk_0[0xC];
    s32 field_C;
    s_8002AC04* field_10;
    u32 field_14_0  : 16;
    u32 field_14_16 : 8;
    u32 field_14_24 : 7;
    u32 field_14_31 : 1;
    u32 field_18;
    u16 field_1C;
    u16 field_1E;
} s_func_8009ECCC;

// ========
// STRUCTS
// ========

typedef struct
{
    u16 field_0;
    u16 field_2; // Engine cmd.
} s_800252BC;

typedef struct
{
    s8  field_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s32 field_4[4];
} s_800382B0;

// Maybe same.
typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
    struct s_80043F2C* field_C;
} s_80043F2C;
STATIC_ASSERT_SIZEOF(s_80043F2C, 16);
// Maybe same.
typedef struct
{
    u8  field_0;
    s8  unk_1[3];
    s32 field_4;
    s8  unk_2[3];
    s32 field_C;
} s_80043E50Sub;
STATIC_ASSERT_SIZEOF(s_80043E50Sub, 16);

typedef struct
{
    s32            field_0;
    s32            field_4;
    u8             elementCount_8;
    s8             unk_C[9];
    s_80043E50Sub* elements_14;
} s_80043E50;

typedef struct
{
    s8  unk_0;
    s8  field_1;
    s8  field_2;
    s8  field_3;
    s8  unk_4[80];
    s32 field_54;
    s32 field_58;
} s_80044044;

typedef struct
{
    s16 field_0; // Flags?
} s_8008D850;

// Maybe level stream data?
typedef struct
{
    s32 field_0;
    s32 queueEntryIdx_4;
    s16 fileChunkCoordX_8;
    s16 fileChunkCoordZ_A;
    s32 field_C;           // Something to do with distance from file chunk edge.
    s32 field_10;          // Something to do with distance from file chunk edge.
} s_80043338;

// Maybe s_Skeleton?
typedef struct
{
    s8  unk_0;
    u8  field_1;
    s8  unk_2[2];
    s32 field_4;
    s8  unk_8[12];
    s32 field_14;
    s32 unk_18; 
} s_80043B70;

typedef struct
{
    s8 unk_0;
    u8 field_1;
} s_80043BA4;

typedef struct
{
    s8 unk_0[14];
    u8 field_E;
    u8 field_F;
} s_8008A35C;

typedef struct
{
    u8  field_0;
    s8  unk_1;
    s16 field_2;
    s8  unk_4[4];
    s32 field_8;
} s_8008E51C;

typedef struct
{
    u8 unk_0[6];
    u8 field_6;
} s_800A992C_sub; // Size: 80?

typedef struct
{
    s8              field_0;
    s8              field_1; // Index.
    s8              unk_2[2];
    u32             field_4; // Size of `field_8` array?
    s_800A992C_sub* field_8;
    s32             field_C;
    s32             field_10;
    s32             field_14;
} s_800A992C;
STATIC_ASSERT_SIZEOF(s_800A992C, 24);

typedef struct
{
    u8  field_0;
    u8  unk_1[3];
    u32 field_4    : 24;
    u8  field_4_24 : 8;
    u32 field_8    : 24;
    u8  field_8_24 : 8;
} s_800AA894;
STATIC_ASSERT_SIZEOF(s_800AA894, 12);

typedef struct
{
    u8  field_0;
    u8  unk_1;
    u16 field_2;
    u8  field_4;
    s8  field_5;
} s_800ACAA8;

typedef struct
{
    s8 field_0;
    s8 unk_1[5];
    s8 field_6;
    s8 unk_7;
    u8 field_8;
    u8 field_9;
    s8 unk_A[5];
    s8 field_F;
    u8 field_10;
    u8 field_11;
    s8 field_12[6];
} s_800AD4C8;
STATIC_ASSERT_SIZEOF(s_800AD4C8, 24);

typedef struct
{
    u8  field_0;
    s8  unk1;
    u8  field_2;
    u8  unk3;
    u8* field_4;
    u8  field_8;
    u8  unk9;
    u8  unkA;
    u8  unkB;
    u8* field_C;
    u8* field_10;
    s8  unk_11[4075];
    s32 queueIdx_1000;
} s_800BE9FC;

typedef struct
{
    s32 field_0[16];
} s_800B5C40;

typedef struct
{
    s32 unk_0[2048];
} s_800B5D04;

typedef struct
{
    s8 field_0;
    s8 field_1;
    s8 field_2;
    s8 field_3;
} s_800BCDA8;
STATIC_ASSERT_SIZEOF(s_800BCDA8, 4);

// Maybe a collection of matrices.
typedef struct
{
    s32 flags_0;
    s8  unk_4[12];
    s8  field_10;
    s8  unk_11[7];
} s_Bone;
STATIC_ASSERT_SIZEOF(s_Bone, 24);

// PROBABLY skeleton data.
typedef struct
{
    u8      boneCount_0;
    u8      boneIdx_1; // Current bone index? Used in traversal.
    s8      field_2;
    s8      field_3;
    s32     field_4;
    s_Bone* bones_8;

    // Maybe incorrect.
    s8 field_C[3]; // Maybe struct similar to `s_Bone` but smaller.
    u8 field_10;   // Some count related to bone hierarchy.
    s8 unk_11;
    s8 field_12;
    s8 field_13;
    s8 field_14;
    s8 unk_15[8];
} s_Skeleton;
STATIC_ASSERT_SIZEOF(s_Skeleton, 28);

typedef struct
{
    s8 field_0;
    u8 unk_1;
    s16 field_2;
    s16 field_4;
    s16 field_6;
    s16 field_8;
} s_800BCE18_0_0_C;

typedef struct
{
    s16 field_0;
    s16 field_2;
    s16 unk_4;
    u8  field_6;
    u8  unk_7;
    s32 field_8;
    s_800BCE18_0_0_C* field_C;
} s_sub_800BCE18_0;

// Looks similar to `s_Skeleton`
typedef struct
{
    u8            field_0;
    u8            field_1;
    u8            unk_2[2];
    s32           field_4;
    void*         field_8;
    s_FsImageDesc field_C;
    s_Skeleton    field_14; // Could be different struct?
} s_800BCE18_0_CC; // Unknown size.

typedef struct
{
    s_sub_800BCE18_0* field_0;
    s8                field_4;
    u8                unk_5[3];
    VECTOR3           field_8; // Vaguely assumed. Chane done for matching `func_8003C368`.
    s32               field_14;
    s_800BCE18_0_CC*  field_18[Chara_Count]; // Per-character data? So far only seen accessed by `map4_s03::800D59EC` which calls `func_8003BE50(Chara_Twinfeeler)`.
    s_800BCE18_0_CC   field_CC;
    u8                unk_D0[368];
    s32               field_26C;
    u8                unk_270[752];
} s_800BCE18_0;
STATIC_ASSERT_SIZEOF(s_800BCE18_0, 1376);

typedef struct
{
    s32 field_0;
    s32 field_4;
    u8  unk_8;
    s8  field_9;
} s_800BCE18_2BEC_0_10;

typedef struct
{
    s8                    unk_0[8];
    s_800BCE18_2BEC_0_10* field_8;
    s8                    unk_C[4];
    s_800BCE18_2BEC_0_10  field_10[1]; // Unknown length.
} s_800BCE18_2BEC_0;

typedef struct
{
    s_800BCE18_2BEC_0* field_0;
    s32                gsCoordinate0_4 : 18; // Used as `GsCOORDINATE2::coord.t[0].`
    s32                gsCoordinate1_4 : 14; // Used as `GsCOORDINATE2::coord.t[1].`
    s32                gsCoordinate2_8 : 18; // Used as `GsCOORDINATE2::coord.t[2].`
    s32                unk_8_18        : 14;
    s32                vx_C            : 10;
    s32                vy_C            : 12;
    s32                vz_C            : 10;
} s_800BCE18_2BEC;
STATIC_ASSERT_SIZEOF(s_800BCE18_2BEC, 16);

typedef struct
{
    s32           field_0;
    s32           field_4;
    char*         field_8;
    s_FsImageDesc imageDesc_C;
    s_800BE9FC*   field_14;
    s32           field_18;
    s32           field_1C;
    s32           field_20;
} s_800BCE18_1BAC;

typedef struct
{
    s_800BCE18_0      field_0[4];
    u8                unk_1580[204];
    s_800BCE18_0_CC   field_164C;
    u8                unk_1650[1328];
    s_800BCE18_1BAC   field_1BAC;
    u8                unk_1BD0[8];
    s32               field_1BD8;
    VC_CAMERA_INTINFO vcCameraInternalInfo_1BDC; // Debug camera info.
    s_800BE9FC        field_1BE4;
    s32               field_2BE8;
    s_800BCE18_2BEC   field_2BEC[1]; // Unknown size, valid count determined by `field_2BE8`?
} s_800BCE18;
STATIC_ASSERT_SIZEOF(s_800BCE18, 11260);

typedef struct
{
    s8  unk_0[28];
    s16 field_1C;
    s8  unk_1E[304];
    s32 field_150;
    s32 field_154;
    s32 field_158;
    s8  unk_15A[1060];
    s32 field_580;
    s32 field_584;
    s32 field_588;
    // More may follow.
} s_800C1020;

typedef struct
{
    s32 field_0;
    u8  unk_4[4];
    s16 field_8;
    s16 field_A;
    u8  unk_C[16];
} s_800C117C;
STATIC_ASSERT_SIZEOF(s_800C117C, 28);

typedef struct
{
    u8 field_0;
    u8 field_1;
} s_800C15F0;

typedef struct
{
    u16 field_0;
    u16 field_2;
    u16 field_4;
    u16 field_6;
    u16 field_8[1]; // Unknown size.
    s16 field_A;
    s16 field_C;
    u16 field_E;
    union
    {
        s8  field_0[3];
        u16 field_01;
    } field_F;
    u8  field_14;
    u8  field_15;
    s8  field_16;
    s8  field_17;
} s_800C1658;

typedef struct
{
    u8 field_0;
    s8 field_1;
    u8 field_2;
    s8 field_3;
} s_800C1670;

// Sound data struct?
typedef struct
{
    s16 volumeXa_0; // Might be wrong, but it's used in a `Sd_SetVolBXa` call.
    s16 field_2;
    u16 field_4;
    s16 field_6;
    s16 volumeBgm_8; // Might be wrong, but it's used in a `Sd_SetVolBgm` call.
    s16 field_A;
    s8  field_C;     // (?) volume?
    s8  field_D;     // BGM volume?
    s8  field_E;     // SE volume?
} s_800C1678;

typedef struct
{
    s32 field_0;
    s32 field_4;
    s32 field_8;
} s_800C1688;

typedef struct
{
    u8  field_0;
    u8  field_1;
    s16 field_2;
    s16 field_4;
    s16 field_6;
    s16 field_8;
    s16 field_A;
    s16 field_C;
    s16 field_E;
} s_800C1698;

typedef struct
{
    s8  field_0;
    s8  unk_1[1];
    u16 field_2;
    u32 field_4;
    s32 field_8;
} s_800C37D4;
// Maybe the same.
typedef struct
{
    u8  field_0;
    s8  unk_1[3];
    u32 field_4;
    s32 field_8;
} s_800C37D8;

typedef struct
{
    s8 field_0;
    s8 field_1;
} s_800C38B0;

typedef struct
{
    VECTOR  field_0;
    SVECTOR field_10;
    VECTOR  field_18;
} s_800C3BE8;

typedef struct
{
    s8      field_0;
    u8      field_1;
    s8      field_2;
    s8      field_3;
    s32     field_4;
    s32     field_8;
    s8      unk_C[12];
    s32     field_18;
    u8      field_1C;
    u8      field_1D;
    u8      field_1E;
    s32     field_20;
    s8      field_24;
    s8      field_25;
    s8      field_26;
    s8      unk_27;
    s8      field_28;
    s8      field_29;
    s8      field_2A;
    s16     field_2C;
    s16     field_2E;
    s16     field_30;
    s16     field_32;
    s16     field_34;
    s16     field_36;
    s16     field_38;
    s16     field_3A;
    s16     field_3C;
    s32     field_4C;
    s32     field_50;
    s8      unk_54[24];
    VECTOR3 field_60; // Type assumed.
} s_800C4168;

typedef struct
{
    s32 field_0;
    s8  unk_4[4];
    s8  field_8;
} s_800C4620;

typedef struct
{
    u8      field_0;
    u8      field_1;
    u8      field_2;
    u8      field_3;
    s8      unk_4[4];
    s16     field_8;
    s16     field_A;
    VECTOR3 field_C;
    s8      unk_18[4];
    s32     field_1C;
    s32     field_20;
} s_800C4818;

/** Holds file IDs of anim/model/texture for each `e_ShCharacterId`, along with some data used in VC camera code. */
typedef struct
{
    s16   animFileIdx;
    s16   modelFileIdx;
    s16   textureFileIdx : 16;
    s16   field_6        : 10;
    u16   field_6_10     : 6;
    void* field_8;
    u16   field_C_0 : 2;
    s32   field_C_2 : 14;
    u16   unk_C_16  : 16;
} s_CharaFileInfo;
STATIC_ASSERT_SIZEOF(s_CharaFileInfo, 16);

// Contains animation data? Size is rather small, so if it does, it would be indices to
// larger arrays containing actual data.
typedef struct
{
    s8  unk_0[12];
    s16 field_C;
    s8  unk_10[2];
} s_MaybeCharacterAnim;

typedef struct
{
    SVECTOR3 posTarget_0;
    SVECTOR3 lookAtTarget_6;
    s16      field_C[2]; // `field_C[1]` gets passed to `vcChangeProjectionValue`.
} s_DmsKeyframeCamera;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCamera, 16);

typedef struct
{
    SVECTOR3 position_0;
    SVECTOR3 rotation_6;
} s_DmsKeyframeCharacter;
STATIC_ASSERT_SIZEOF(s_DmsKeyframeCharacter, 12);

typedef struct
{
    s16       keyframeCount_0;
    u8        svectorCount_2;
    u8        field_3;        // Usually 0, but sometimes filled in, possibly junk data left in padding byte.
    char      name_4[4];      // First 4 chars of name. E.g. Code checks for "DAHLIA", file is "DAHL".
    SVECTOR3* svectorPtr_8;   // Pointer to `SVECTOR3`s. Unknown purpose.
    union
    {
        s_DmsKeyframeCharacter* character;
        s_DmsKeyframeCamera*    camera;
    } keyframes_C;
} s_DmsEntry;
STATIC_ASSERT_SIZEOF(s_DmsEntry, 16);

typedef struct
{
    s16 start;
    s16 duration;
} s_DmsInterval;
STATIC_ASSERT_SIZEOF(s_DmsInterval, 4);

typedef struct
{
    u8             isLoaded_0;
    u8             characterCount_1;
    u8             intervalCount_2;
    u8             field_3; // Usually 0, but sometimes filled in.
    u32            field_4; // Unknown, correlates with DMS file size.
    s_DmsInterval* intervalPtr_8;
    VECTOR3        origin_C; // Origin point, gets added to character positions.
    s_DmsEntry*    characters_18;
    s_DmsEntry     camera_1C;
} s_DmsHeader;
STATIC_ASSERT_SIZEOF(s_DmsHeader, 44);

/** @brief Used for normal credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E24, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E434C`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
} s_800AFE08;
STATIC_ASSERT_SIZEOF(s_800AFE08, 28);

/** @brief Used for UFO ending credits screen. */
typedef struct
{
    s16  field_0;  /** Prim vertex X. */
    s16  field_2;  /** Prim vertex Y. */
    s16  field_4;  /** Width? */
    s8   field_6;  /** Height?  */
    s8   field_7;  /** Blend flag. */
    s32  field_8;  /** Rgb24 color + code. */
    s16* field_C;  /** Points to 0x801E5C24, data size 400. */
    s32* field_10; /** Points to 0x801E5E40, data size 28, rgb24 + code. */
    u16  field_14; /** Tpage for `setDrawTPage`, calculated from `field_18` with `func_801E4BD4`. */
    s16  field_16; /** Clut XY. */
    u32  field_18; /** Texture UV. */
    s32  field_1C;
    s16  field_20;
    s16  field_22;
    s32  field_24;
    s32  field_28;
    s32  field_2C;
    s32  field_30;
    s32  field_34;
    s32  field_38;
    s32  field_3C;
    s32  field_40;
    s32  field_44;
    s32  field_48;
    s32  field_4C;
    s32  field_50;
    s32  field_54;
} s_800AFE24; // Size: 85

/** Part of map headers, pointer passed to `Chara_PositionUpdateFromParams`. */
typedef struct _AreaLoadParams
{
    s32 char_x_0;
    u32 mapIdx_4_0     : 5;
    u32 field_4_5      : 4;
    u32 field_4_9      : 3;
    u32 field_4_12     : 4;
    u32 rotationY_4_16 : 8;
    u32 field_4_24     : 8;
    s32 char_z_8;
} s_AreaLoadParams;

typedef struct _SpawnInfo
{
    q19_12 positionX_0;
    s8     charaId_4;   /** `e_ShCharacterId` */
    u8     rotationY_5; /** Multiplied by 16 to get `s_SubCharacter.rotation_24.vy` value. */
    s8     flags_6;     /** Copied to `stateStep_3` in `s_Model`, with `state_2 = 0`. */
    s8     unk_7;
    q19_12 positionZ_8;
} s_SpawnInfo;
STATIC_ASSERT_SIZEOF(s_SpawnInfo, 12);

typedef struct s_UnkStruct_MapOverlay
{
    u8 field_0[34]; /** `e_InventoryItemId` */
} s_UnkStruct_MO;

typedef struct
{
    u8 unk_0[6];
    u8 field_6;
} s_UnkStruct2_MO;

/** TODO: `g_MapOverlayHeader` is part of the map overlay BIN files. Maybe should be moved to `maps/shared.h`. */
typedef struct _MapOverlayHeader
{
    s_UnkStruct2_MO*  field_0;
    s8                (*getMapRoomIdxFunc_4)(s32 x, s32 y); // Called by `func_80036420`.
    s8                field_8;
    s8                unk_9[3];
    s8                unk_C[4];
    s32               (*func_10)();
    s8                field_14;
    u8                field_15;
    s8                field_16;
    s8                field_17;
    void              (**func_18)();
    s_AreaLoadParams* mapAreaLoadParams_1C;
    void              (**mapEventFuncs_20)(); /** Points to array of event functions. */
    s8                unk_24[4];
    GsCOORDINATE2*    field_28;
    s_UnkStruct_MO*   field_2C;
    char**            mapMessageStrings_30; /** Points to array of `char*` for each displayed message in the map. */
    s_AnimInfo*       animInfo_34;
    s8                unk_38[8];
    void              (*func_40)();
    void              (*func_44)();
    s8                unk_48[4];
    s_func_800625F4*  field_4C;
    s8                unk_50[16];
    s8                unk_60[88];
    void              (*func_B8)(s_SubCharacter*, s_MainCharacterExtra*, GsCOORDINATE2*);
    void              (*func_BC)(s_SubCharacter*, s_MainCharacterExtra*, GsCOORDINATE2*);
    s8                unk_C0[8];
    void              (*func_C8)();
    void              (*func_CC)(s32);
    s32               (*func_D0)(s32, void*, s16, s32); // 0x800C964C
    s32               (*func_D4)(s_SubCharacter*); // Assumed return type.
    void              (*func_D8)(); // Assumed return type.
    void              (*func_DC)(s_SubCharacter*); // Assumed return type.
    s8                unk_E0[4];
    s32               (*func_E4)(s_SubCharacter*, s_SubCharacter*); // Assumed return type.
    s64               (*func_E8)(s_SubCharacter*); // Is it really `s64`???
    s32               (*func_EC)();
    s8                unk_F0[24];
    s32               (*func_108)(s32, s32);
    s8                unk_10C[24];
    void              (*func_124)(s_SubCharacter*); // Assumed return type.
    s32               (*func_128)(s_SubCharacter*); // Assumed return type.
    s32               (*func_12C)(s_SubCharacter*); // Assumed return type.
    s8                unk_130[4];
    s32               (*func_134)(s_SubCharacter*); // Assumed return type.
    s32               (*func_138)(s_SubCharacter*); // Assumed return type.
    s32               (*func_13C)(s32, s32, void*, s16, s32); // 0x800C96B8
    s8                unk_140[40];
    void              (*func_168)(void*, void*, void*);
    void              (*func_16C)(VECTOR3*, s16);
    s8                unk_170[36];
    void              (*charaUpdateFuncs_194[Chara_Count])(s_SubCharacter*, void*, s32); /** Guessed params. Funcptrs for each `e_ShCharacterId`, set to 0 for IDs not included in the map overlay. Called by `func_80038354`. */
    s8                charaGroupIds_248[4];                                              /** `e_ShCharacterId` values where if `s_SpawnInfo.charaId_4` == 0, `charaGroupIds_248[0]` is used for `charaSpawnsA_24C` and `charaGroupIds_248[1]` for `charaSpawnsB_30C`. */
    s_SpawnInfo       charaSpawnsA_24C[16];                                              /** Array of chara type/position/flags, flags_6 == 0 are unused slots? Read by `func_80037F24`. */
    s_SpawnInfo       charaSpawnsB_30C[16];                                              /** Array of chara type/position/flags, flags_6 == 0 are unused slots? Read by `func_80037F24`. */
    VC_ROAD_DATA      roadDataList_3CC[48];
    // TODO: A lot more in here.
} s_MapOverlayHeader;
STATIC_ASSERT_SIZEOF(s_MapOverlayHeader, 2124); // Size incomplete.

typedef struct
{
    s8 field_0;
    s8 field_1;
} s_800BCD78;

typedef struct
{
    u8 field_0;
    u8 field_1;
} s_800A9F80;

// ========
// GLOBALS
// ========

extern s_FsImageDesc g_MainImg0; // 0x80022C74 - TODO: part of main exe, move to main/ headers?

/** Some sort of struct inside RODATA, likely a constant. */
extern s32 D_8002500C;

extern s8* D_8002510C;

/** Default key bindings. Multiple configs probably? */
extern s_ControllerConfig D_8002511C[];

extern s_800252BC const D_800252BC[];

extern u8 D_80025D6C[];

extern u32 D_80025DC0[];

extern char D_80028544[0x10];

extern RECT D_80028A20;

extern RECT D_8002ABA4;

extern s_8002AC04 D_8002AC04[];

extern s_800BE9FC D_8002B2CC;

extern u8 D_800A8E58;

extern DR_MODE D_800A8E5C[];

extern TILE D_800A8E74[];

extern s32 D_800A8E94;

extern DR_MODE D_800A8E98[];

extern POLY_G4 D_800A8EB0[];

extern s32 D_800A8F40;

extern GsOT D_800A8F9C[];

